;******************************************************************************
;* TI ARM C/C++ Codegen                                             PC v5.1.6 *
;* Date/Time created: Thu Aug 14 09:05:06 2014                                *
;******************************************************************************
	.compiler_opts --abi=eabi --arm_vmrs_si_workaround=on --code_state=16 --diag_wrap=off --disable_dual_state --embedded_constants=on --endian=little --float_support=FPv4SPD16 --hll_source=on --object_format=elf --silicon_version=7M4 --symdebug:dwarf --symdebug:dwarf_version=3 --unaligned_access=on 
	.thumb

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("C:/wolfssl/ctaocrypt/src/asn.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v5.1.6 Copyright (c) 1996-2014 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\khimes\Documents\GitHub\wolfssl-examples\tirtos_ccs_examples\wolfssl_tirtos_benchmark\Debug")

$C$DW$1	.dwtag  DW_TAG_subprogram, DW_AT_name("memcpy")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("memcpy")
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("c:/ti/ccsv6/tools/compiler/arm_5.1.6/include/string.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0x5e)
	.dwattr $C$DW$1, DW_AT_decl_column(0x16)
$C$DW$2	.dwtag  DW_TAG_formal_parameter

	.dwattr $C$DW$1598, DW_AT_decl_column(0x05)
$C$DW$1599	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_CRL_CONFIRM_E"), DW_AT_const_value(-189)
	.dwattr $C$DW$1599, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/error-crypt.h")
	.dwattr $C$DW$1599, DW_AT_decl_line(0x72)
	.dwattr $C$DW$1599, DW_AT_decl_column(0x05)
$C$DW$1600	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_CRL_NO_SIGNER_E"), DW_AT_const_value(-190)
	.dwattr $C$DW$1600, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/error-crypt.h")
	.dwattr $C$DW$1600, DW_AT_decl_line(0x73)
	.dwattr $C$DW$1600, DW_AT_decl_column(0x05)
$C$DW$1601	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_OCSP_CONFIRM_E"), DW_AT_const_value(-191)
	.dwattr $C$DW$1601, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/error-crypt.h")
	.dwattr $C$DW$1601, DW_AT_decl_line(0x74)
	.dwattr $C$DW$1601, DW_AT_decl_column(0x05)
$C$DW$1602	.dwtag  DW_TAG_enumerator, DW_AT_name("BAD_ENC_STATE_E"), DW_AT_const_value(-192)
	.dwattr $C$DW$1602, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/error-crypt.h")
	.dwattr $C$DW$1602, DW_AT_decl_line(0x76)
	.dwattr $C$DW$1602, DW_AT_decl_column(0x05)
$C$DW$1603	.dwtag  DW_TAG_enumerator, DW_AT_name("BAD_PADDING_E"), DW_AT_const_value(-193)
	.dwattr $C$DW$1603, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/error-crypt.h")
	.dwattr $C$DW$1603, DW_AT_decl_line(0x77)
	.dwattr $C$DW$1603, DW_AT_decl_column(0x05)
$C$DW$1604	.dwtag  DW_TAG_enumerator, DW_AT_name("REQ_ATTRIBUTE_E"), DW_AT_const_value(-194)
	.dwattr $C$DW$1604, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/error-crypt.h")
	.dwattr $C$DW$1604, DW_AT_decl_line(0x79)
	.dwattr $C$DW$1604, DW_AT_decl_column(0x05)
$C$DW$1605	.dwtag  DW_TAG_enumerator, DW_AT_name("PKCS7_OID_E"), DW_AT_const_value(-195)
	.dwattr $C$DW$1605, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/error-crypt.h")
	.dwattr $C$DW$1605, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$1605, DW_AT_decl_column(0x05)
$C$DW$1606	.dwtag  DW_TAG_enumerator, DW_AT_name("PKCS7_RECIP_E"), DW_AT_const_value(-196)
	.dwattr $C$DW$1606, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/error-crypt.h")
	.dwattr $C$DW$1606, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$1606, DW_AT_decl_column(0x05)
$C$DW$1607	.dwtag  DW_TAG_enumerator, DW_AT_name("FIPS_NOT_ALLOWED_E"), DW_AT_const_value(-197)
	.dwattr $C$DW$1607, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/error-crypt.h")
	.dwattr $C$DW$1607, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$1607, DW_AT_decl_column(0x05)
$C$DW$1608	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_NAME_INVALID_E"), DW_AT_const_value(-198)
	.dwattr $C$DW$1608, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/error-crypt.h")
	.dwattr $C$DW$1608, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$1608, DW_AT_decl_column(0x05)
$C$DW$1609	.dwtag  DW_TAG_enumerator, DW_AT_name("RNG_FAILURE_E"), DW_AT_const_value(-199)
	.dwattr $C$DW$1609, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/error-crypt.h")
	.dwattr $C$DW$1609, DW_AT_decl_line(0x80)
	.dwattr $C$DW$1609, DW_AT_decl_column(0x05)
$C$DW$1610	.dwtag  DW_TAG_enumerator, DW_AT_name("HMAC_MIN_KEYLEN_E"), DW_AT_const_value(-200)
	.dwattr $C$DW$1610, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/error-crypt.h")
	.dwattr $C$DW$1610, DW_AT_decl_line(0x81)
	.dwattr $C$DW$1610, DW_AT_decl_column(0x05)
$C$DW$1611	.dwtag  DW_TAG_enumerator, DW_AT_name("RSA_PAD_E"), DW_AT_const_value(-201)
	.dwattr $C$DW$1611, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/error-crypt.h")
	.dwattr $C$DW$1611, DW_AT_decl_line(0x82)
	.dwattr $C$DW$1611, DW_AT_decl_column(0x05)
$C$DW$1612	.dwtag  DW_TAG_enumerator, DW_AT_name("MIN_CODE_E"), DW_AT_const_value(-300)
	.dwattr $C$DW$1612, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/error-crypt.h")
	.dwattr $C$DW$1612, DW_AT_decl_line(0x84)
	.dwattr $C$DW$1612, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$583

	.dwattr $C$DW$T$583, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/error-crypt.h")
	.dwattr $C$DW$T$583, DW_AT_decl_line(0x23)
	.dwattr $C$DW$T$583, DW_AT_decl_column(0x06)

$C$DW$T$584	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$584, DW_AT_byte_size(0x01)
$C$DW$1613	.dwtag  DW_TAG_enumerator, DW_AT_name("DES_ENC_TYPE"), DW_AT_const_value(0x02)
	.dwattr $C$DW$1613, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/des3.h")
	.dwattr $C$DW$1613, DW_AT_decl_line(0x27)
	.dwattr $C$DW$1613, DW_AT_decl_column(0x05)
$C$DW$1614	.dwtag  DW_TAG_enumerator, DW_AT_name("DES3_ENC_TYPE"), DW_AT_const_value(0x03)
	.dwattr $C$DW$1614, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/des3.h")
	.dwattr $C$DW$1614, DW_AT_decl_line(0x28)
	.dwattr $C$DW$1614, DW_AT_decl_column(0x05)
$C$DW$1615	.dwtag  DW_TAG_enumerator, DW_AT_name("DES_BLOCK_SIZE"), DW_AT_const_value(0x08)
	.dwattr $C$DW$1615, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/des3.h")
	.dwattr $C$DW$1615, DW_AT_decl_line(0x29)
	.dwattr $C$DW$1615, DW_AT_decl_column(0x05)
$C$DW$1616	.dwtag  DW_TAG_enumerator, DW_AT_name("DES_KS_SIZE"), DW_AT_const_value(0x20)
	.dwattr $C$DW$1616, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/des3.h")
	.dwattr $C$DW$1616, DW_AT_decl_line(0x2a)
	.dwattr $C$DW$1616, DW_AT_decl_column(0x05)
$C$DW$1617	.dwtag  DW_TAG_enumerator, DW_AT_name("DES_ENCRYPTION"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1617, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/des3.h")
	.dwattr $C$DW$1617, DW_AT_decl_line(0x2c)
	.dwattr $C$DW$1617, DW_AT_decl_column(0x05)
$C$DW$1618	.dwtag  DW_TAG_enumerator, DW_AT_name("DES_DECRYPTION"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1618, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/des3.h")
	.dwattr $C$DW$1618, DW_AT_decl_line(0x2d)
	.dwattr $C$DW$1618, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$584

	.dwattr $C$DW$T$584, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/des3.h")
	.dwattr $C$DW$T$584, DW_AT_decl_line(0x26)
	.dwattr $C$DW$T$584, DW_AT_decl_column(0x06)

$C$DW$T$126	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$126, DW_AT_byte_size(0x228)
$C$DW$1619	.dwtag  DW_TAG_member
	.dwattr $C$DW$1619, DW_AT_type(*$C$DW$T$125)
	.dwattr $C$DW$1619, DW_AT_name("dp")
	.dwattr $C$DW$1619, DW_AT_TI_symbol_name("dp")
	.dwattr $C$DW$1619, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1619, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1619, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/tfm.h")
	.dwattr $C$DW$1619, DW_AT_decl_line(0x110)
	.dwattr $C$DW$1619, DW_AT_decl_column(0x0e)
$C$DW$1620	.dwtag  DW_TAG_member
	.dwattr $C$DW$1620, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1620, DW_AT_name("used")
	.dwattr $C$DW$1620, DW_AT_TI_symbol_name("used")
	.dwattr $C$DW$1620, DW_AT_data_member_location[DW_OP_plus_uconst 0x220]
	.dwattr $C$DW$1620, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1620, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/tfm.h")
	.dwattr $C$DW$1620, DW_AT_decl_line(0x111)
	.dwattr $C$DW$1620, DW_AT_decl_column(0x0e)
$C$DW$1621	.dwtag  DW_TAG_member
	.dwattr $C$DW$1621, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1621, DW_AT_name("sign")
	.dwattr $C$DW$1621, DW_AT_TI_symbol_name("sign")
	.dwattr $C$DW$1621, DW_AT_data_member_location[DW_OP_plus_uconst 0x224]
	.dwattr $C$DW$1621, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1621, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/tfm.h")
	.dwattr $C$DW$1621, DW_AT_decl_line(0x112)
	.dwattr $C$DW$1621, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$126

	.dwattr $C$DW$T$126, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/tfm.h")
	.dwattr $C$DW$T$126, DW_AT_decl_line(0x10f)
	.dwattr $C$DW$T$126, DW_AT_decl_column(0x10)
$C$DW$T$585	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$585, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$T$585, DW_AT_address_class(0x20)
$C$DW$T$131	.dwtag  DW_TAG_typedef, DW_AT_name("fp_int")
	.dwattr $C$DW$T$131, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$T$131, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$131, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/tfm.h")
	.dwattr $C$DW$T$131, DW_AT_decl_line(0x113)
	.dwattr $C$DW$T$131, DW_AT_decl_column(0x03)
$C$DW$T$132	.dwtag  DW_TAG_typedef, DW_AT_name("mp_int")
	.dwattr $C$DW$T$132, DW_AT_type(*$C$DW$T$131)
	.dwattr $C$DW$T$132, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$132, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/tfm.h")
	.dwattr $C$DW$T$132, DW_AT_decl_line(0x273)
	.dwattr $C$DW$T$132, DW_AT_decl_column(0x14)
$C$DW$T$587	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$587, DW_AT_type(*$C$DW$T$132)
	.dwattr $C$DW$T$587, DW_AT_address_class(0x20)
$C$DW$T$588	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$588, DW_AT_type(*$C$DW$T$587)

$C$DW$T$130	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$130, DW_AT_byte_size(0x1c)
$C$DW$1622	.dwtag  DW_TAG_member
	.dwattr $C$DW$1622, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1622, DW_AT_name("size")
	.dwattr $C$DW$1622, DW_AT_TI_symbol_name("size")
	.dwattr $C$DW$1622, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1622, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1622, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/ecc.h")
	.dwattr $C$DW$1622, DW_AT_decl_line(0x31)
	.dwattr $C$DW$1622, DW_AT_decl_column(0x09)
$C$DW$1623	.dwtag  DW_TAG_member
	.dwattr $C$DW$1623, DW_AT_type(*$C$DW$T$129)
	.dwattr $C$DW$1623, DW_AT_name("name")
	.dwattr $C$DW$1623, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$1623, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1623, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1623, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/ecc.h")
	.dwattr $C$DW$1623, DW_AT_decl_line(0x32)
	.dwattr $C$DW$1623, DW_AT_decl_column(0x11)
$C$DW$1624	.dwtag  DW_TAG_member
	.dwattr $C$DW$1624, DW_AT_type(*$C$DW$T$129)
	.dwattr $C$DW$1624, DW_AT_name("prime")
	.dwattr $C$DW$1624, DW_AT_TI_symbol_name("prime")
	.dwattr $C$DW$1624, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1624, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1624, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/ecc.h")
	.dwattr $C$DW$1624, DW_AT_decl_line(0x33)
	.dwattr $C$DW$1624, DW_AT_decl_column(0x11)
$C$DW$1625	.dwtag  DW_TAG_member
	.dwattr $C$DW$1625, DW_AT_type(*$C$DW$T$129)
	.dwattr $C$DW$1625, DW_AT_name("Bf")
	.dwattr $C$DW$1625, DW_AT_TI_symbol_name("Bf")
	.dwattr $C$DW$1625, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1625, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1625, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/ecc.h")
	.dwattr $C$DW$1625, DW_AT_decl_line(0x34)
	.dwattr $C$DW$1625, DW_AT_decl_column(0x11)
$C$DW$1626	.dwtag  DW_TAG_member
	.dwattr $C$DW$1626, DW_AT_type(*$C$DW$T$129)
	.dwattr $C$DW$1626, DW_AT_name("order")
	.dwattr $C$DW$1626, DW_AT_TI_symbol_name("order")
	.dwattr $C$DW$1626, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1626, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1626, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/ecc.h")
	.dwattr $C$DW$1626, DW_AT_decl_line(0x35)
	.dwattr $C$DW$1626, DW_AT_decl_column(0x11)
$C$DW$1627	.dwtag  DW_TAG_member
	.dwattr $C$DW$1627, DW_AT_type(*$C$DW$T$129)
	.dwattr $C$DW$1627, DW_AT_name("Gx")
	.dwattr $C$DW$1627, DW_AT_TI_symbol_name("Gx")
	.dwattr $C$DW$1627, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1627, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1627, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/ecc.h")
	.dwattr $C$DW$1627, DW_AT_decl_line(0x36)
	.dwattr $C$DW$1627, DW_AT_decl_column(0x11)
$C$DW$1628	.dwtag  DW_TAG_member
	.dwattr $C$DW$1628, DW_AT_type(*$C$DW$T$129)
	.dwattr $C$DW$1628, DW_AT_name("Gy")
	.dwattr $C$DW$1628, DW_AT_TI_symbol_name("Gy")
	.dwattr $C$DW$1628, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1628, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1628, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/ecc.h")
	.dwattr $C$DW$1628, DW_AT_decl_line(0x37)
	.dwattr $C$DW$1628, DW_AT_decl_column(0x11)
	.dwendtag $C$DW$T$130

	.dwattr $C$DW$T$130, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/ecc.h")
	.dwattr $C$DW$T$130, DW_AT_decl_line(0x30)
	.dwattr $C$DW$T$130, DW_AT_decl_column(0x10)
$C$DW$T$134	.dwtag  DW_TAG_typedef, DW_AT_name("ecc_set_type")
	.dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$130)
	.dwattr $C$DW$T$134, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$134, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/ecc.h")
	.dwattr $C$DW$T$134, DW_AT_decl_line(0x38)
	.dwattr $C$DW$T$134, DW_AT_decl_column(0x03)
$C$DW$T$135	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$134)
$C$DW$T$136	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$136, DW_AT_type(*$C$DW$T$135)
	.dwattr $C$DW$T$136, DW_AT_address_class(0x20)

$C$DW$T$133	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$133, DW_AT_byte_size(0x678)
$C$DW$1629	.dwtag  DW_TAG_member
	.dwattr $C$DW$1629, DW_AT_type(*$C$DW$T$132)
	.dwattr $C$DW$1629, DW_AT_name("x")
	.dwattr $C$DW$1629, DW_AT_TI_symbol_name("x")
	.dwattr $C$DW$1629, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1629, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1629, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/ecc.h")
	.dwattr $C$DW$1629, DW_AT_decl_line(0x3e)
	.dwattr $C$DW$1629, DW_AT_decl_column(0x0c)
$C$DW$1630	.dwtag  DW_TAG_member
	.dwattr $C$DW$1630, DW_AT_type(*$C$DW$T$132)
	.dwattr $C$DW$1630, DW_AT_name("y")
	.dwattr $C$DW$1630, DW_AT_TI_symbol_name("y")
	.dwattr $C$DW$1630, DW_AT_data_member_location[DW_OP_plus_uconst 0x228]
	.dwattr $C$DW$1630, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1630, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/ecc.h")
	.dwattr $C$DW$1630, DW_AT_decl_line(0x3f)
	.dwattr $C$DW$1630, DW_AT_decl_column(0x0c)
$C$DW$1631	.dwtag  DW_TAG_member
	.dwattr $C$DW$1631, DW_AT_type(*$C$DW$T$132)
	.dwattr $C$DW$1631, DW_AT_name("z")
	.dwattr $C$DW$1631, DW_AT_TI_symbol_name("z")
	.dwattr $C$DW$1631, DW_AT_data_member_location[DW_OP_plus_uconst 0x450]
	.dwattr $C$DW$1631, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1631, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/ecc.h")
	.dwattr $C$DW$1631, DW_AT_decl_line(0x40)
	.dwattr $C$DW$1631, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$133

	.dwattr $C$DW$T$133, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/ecc.h")
	.dwattr $C$DW$T$133, DW_AT_decl_line(0x3d)
	.dwattr $C$DW$T$133, DW_AT_decl_column(0x10)
$C$DW$T$137	.dwtag  DW_TAG_typedef, DW_AT_name("ecc_point")
	.dwattr $C$DW$T$137, DW_AT_type(*$C$DW$T$133)
	.dwattr $C$DW$T$137, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$137, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/ecc.h")
	.dwattr $C$DW$T$137, DW_AT_decl_line(0x41)
	.dwattr $C$DW$T$137, DW_AT_decl_column(0x03)

$C$DW$T$138	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$138, DW_AT_byte_size(0x8ac)
$C$DW$1632	.dwtag  DW_TAG_member
	.dwattr $C$DW$1632, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1632, DW_AT_name("type")
	.dwattr $C$DW$1632, DW_AT_TI_symbol_name("type")
	.dwattr $C$DW$1632, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1632, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1632, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/ecc.h")
	.dwattr $C$DW$1632, DW_AT_decl_line(0x46)
	.dwattr $C$DW$1632, DW_AT_decl_column(0x09)
$C$DW$1633	.dwtag  DW_TAG_member
	.dwattr $C$DW$1633, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1633, DW_AT_name("idx")
	.dwattr $C$DW$1633, DW_AT_TI_symbol_name("idx")
	.dwattr $C$DW$1633, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1633, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1633, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/ecc.h")
	.dwattr $C$DW$1633, DW_AT_decl_line(0x47)
	.dwattr $C$DW$1633, DW_AT_decl_column(0x09)
$C$DW$1634	.dwtag  DW_TAG_member
	.dwattr $C$DW$1634, DW_AT_type(*$C$DW$T$136)
	.dwattr $C$DW$1634, DW_AT_name("dp")
	.dwattr $C$DW$1634, DW_AT_TI_symbol_name("dp")
	.dwattr $C$DW$1634, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1634, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1634, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/ecc.h")
	.dwattr $C$DW$1634, DW_AT_decl_line(0x4a)
	.dwattr $C$DW$1634, DW_AT_decl_column(0x19)
$C$DW$1635	.dwtag  DW_TAG_member
	.dwattr $C$DW$1635, DW_AT_type(*$C$DW$T$137)
	.dwattr $C$DW$1635, DW_AT_name("pubkey")
	.dwattr $C$DW$1635, DW_AT_TI_symbol_name("pubkey")
	.dwattr $C$DW$1635, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1635, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1635, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/ecc.h")
	.dwattr $C$DW$1635, DW_AT_decl_line(0x4c)
	.dwattr $C$DW$1635, DW_AT_decl_column(0x0f)
$C$DW$1636	.dwtag  DW_TAG_member
	.dwattr $C$DW$1636, DW_AT_type(*$C$DW$T$132)
	.dwattr $C$DW$1636, DW_AT_name("k")
	.dwattr $C$DW$1636, DW_AT_TI_symbol_name("k")
	.dwattr $C$DW$1636, DW_AT_data_member_location[DW_OP_plus_uconst 0x684]
	.dwattr $C$DW$1636, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1636, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/ecc.h")
	.dwattr $C$DW$1636, DW_AT_decl_line(0x4d)
	.dwattr $C$DW$1636, DW_AT_decl_column(0x0f)
	.dwendtag $C$DW$T$138

	.dwattr $C$DW$T$138, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/ecc.h")
	.dwattr $C$DW$T$138, DW_AT_decl_line(0x45)
	.dwattr $C$DW$T$138, DW_AT_decl_column(0x10)

$C$DW$T$204	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$204, DW_AT_type(*$C$DW$T$138)
	.dwattr $C$DW$T$204, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$204, DW_AT_byte_size(0x8ac)
$C$DW$1637	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1637, DW_AT_upper_bound(0x00)
	.dwendtag $C$DW$T$204

$C$DW$T$591	.dwtag  DW_TAG_typedef, DW_AT_name("ecc_key")
	.dwattr $C$DW$T$591, DW_AT_type(*$C$DW$T$138)
	.dwattr $C$DW$T$591, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$591, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/ecc.h")
	.dwattr $C$DW$T$591, DW_AT_decl_line(0x4e)
	.dwattr $C$DW$T$591, DW_AT_decl_column(0x03)
$C$DW$T$592	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$592, DW_AT_type(*$C$DW$T$591)
	.dwattr $C$DW$T$592, DW_AT_address_class(0x20)
$C$DW$T$593	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$593, DW_AT_type(*$C$DW$T$592)

$C$DW$T$141	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$141, DW_AT_byte_size(0x08)
$C$DW$1638	.dwtag  DW_TAG_member
	.dwattr $C$DW$1638, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1638, DW_AT_name("length")
	.dwattr $C$DW$1638, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$1638, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1638, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1638, DW_AT_decl_file("C:/ti/tirtos_tivac_2_00_02_36/products/bios_6_40_02_27/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$1638, DW_AT_decl_line(0xe2)
	.dwattr $C$DW$1638, DW_AT_decl_column(0x16)
$C$DW$1639	.dwtag  DW_TAG_member
	.dwattr $C$DW$1639, DW_AT_type(*$C$DW$T$140)
	.dwattr $C$DW$1639, DW_AT_name("elem")
	.dwattr $C$DW$1639, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$1639, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1639, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1639, DW_AT_decl_file("C:/ti/tirtos_tivac_2_00_02_36/products/bios_6_40_02_27/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$1639, DW_AT_decl_line(0xe2)
	.dwattr $C$DW$1639, DW_AT_decl_column(0x3a)
	.dwendtag $C$DW$T$141

	.dwattr $C$DW$T$141, DW_AT_decl_file("C:/ti/tirtos_tivac_2_00_02_36/products/bios_6_40_02_27/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$141, DW_AT_decl_line(0xe2)
	.dwattr $C$DW$T$141, DW_AT_decl_column(0x10)
$C$DW$T$594	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$594, DW_AT_type(*$C$DW$T$141)
	.dwattr $C$DW$T$594, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$594, DW_AT_decl_file("C:/ti/tirtos_tivac_2_00_02_36/products/bios_6_40_02_27/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$594, DW_AT_decl_line(0xe2)
	.dwattr $C$DW$T$594, DW_AT_decl_column(0x42)
$C$DW$T$595	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$595, DW_AT_type(*$C$DW$T$594)
	.dwattr $C$DW$T$595, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$595, DW_AT_decl_file("C:/ti/tirtos_tivac_2_00_02_36/products/bios_6_40_02_27/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$595, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$T$595, DW_AT_decl_column(0x2b)
$C$DW$T$596	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$596, DW_AT_type(*$C$DW$T$595)
	.dwattr $C$DW$T$596, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$596, DW_AT_decl_file("C:/ti/tirtos_tivac_2_00_02_36/products/bios_6_40_02_27/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$596, DW_AT_decl_line(0xe4)
	.dwattr $C$DW$T$596, DW_AT_decl_column(0x27)

$C$DW$T$144	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$144, DW_AT_byte_size(0x08)
$C$DW$1640	.dwtag  DW_TAG_member
	.dwattr $C$DW$1640, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1640, DW_AT_name("length")
	.dwattr $C$DW$1640, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$1640, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1640, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1640, DW_AT_decl_file("C:/ti/tirtos_tivac_2_00_02_36/products/bios_6_40_02_27/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$1640, DW_AT_decl_line(0x19f)
	.dwattr $C$DW$1640, DW_AT_decl_column(0x16)
$C$DW$1641	.dwtag  DW_TAG_member
	.dwattr $C$DW$1641, DW_AT_type(*$C$DW$T$143)
	.dwattr $C$DW$1641, DW_AT_name("elem")
	.dwattr $C$DW$1641, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$1641, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1641, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1641, DW_AT_decl_file("C:/ti/tirtos_tivac_2_00_02_36/products/bios_6_40_02_27/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$1641, DW_AT_decl_line(0x19f)
	.dwattr $C$DW$1641, DW_AT_decl_column(0x3b)
	.dwendtag $C$DW$T$144

	.dwattr $C$DW$T$144, DW_AT_decl_file("C:/ti/tirtos_tivac_2_00_02_36/products/bios_6_40_02_27/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$144, DW_AT_decl_line(0x19f)
	.dwattr $C$DW$T$144, DW_AT_decl_column(0x10)
$C$DW$T$597	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$597, DW_AT_type(*$C$DW$T$144)
	.dwattr $C$DW$T$597, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$597, DW_AT_decl_file("C:/ti/tirtos_tivac_2_00_02_36/products/bios_6_40_02_27/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$597, DW_AT_decl_line(0x19f)
	.dwattr $C$DW$T$597, DW_AT_decl_column(0x43)
$C$DW$T$598	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$598, DW_AT_type(*$C$DW$T$597)
	.dwattr $C$DW$T$598, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$598, DW_AT_decl_file("C:/ti/tirtos_tivac_2_00_02_36/products/bios_6_40_02_27/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$598, DW_AT_decl_line(0x1a0)
	.dwattr $C$DW$T$598, DW_AT_decl_column(0x2c)
$C$DW$T$599	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$599, DW_AT_type(*$C$DW$T$598)
	.dwattr $C$DW$T$599, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$599, DW_AT_decl_file("C:/ti/tirtos_tivac_2_00_02_36/products/bios_6_40_02_27/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$599, DW_AT_decl_line(0x1a1)
	.dwattr $C$DW$T$599, DW_AT_decl_column(0x28)

$C$DW$T$145	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$145, DW_AT_byte_size(0x08)
$C$DW$1642	.dwtag  DW_TAG_member
	.dwattr $C$DW$1642, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1642, DW_AT_name("quot")
	.dwattr $C$DW$1642, DW_AT_TI_symbol_name("quot")
	.dwattr $C$DW$1642, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1642, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1642, DW_AT_decl_file("c:/ti/ccsv6/tools/compiler/arm_5.1.6/include/stdlib.h")
	.dwattr $C$DW$1642, DW_AT_decl_line(0x50)
	.dwattr $C$DW$1642, DW_AT_decl_column(0x16)
$C$DW$1643	.dwtag  DW_TAG_member
	.dwattr $C$DW$1643, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1643, DW_AT_name("rem")
	.dwattr $C$DW$1643, DW_AT_TI_symbol_name("rem")
	.dwattr $C$DW$1643, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1643, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1643, DW_AT_decl_file("c:/ti/ccsv6/tools/compiler/arm_5.1.6/include/stdlib.h")
	.dwattr $C$DW$1643, DW_AT_decl_line(0x50)
	.dwattr $C$DW$1643, DW_AT_decl_column(0x1c)
	.dwendtag $C$DW$T$145

	.dwattr $C$DW$T$145, DW_AT_decl_file("c:/ti/ccsv6/tools/compiler/arm_5.1.6/include/stdlib.h")
	.dwattr $C$DW$T$145, DW_AT_decl_line(0x50)
	.dwattr $C$DW$T$145, DW_AT_decl_column(0x10)
$C$DW$T$600	.dwtag  DW_TAG_typedef, DW_AT_name("div_t")
	.dwattr $C$DW$T$600, DW_AT_type(*$C$DW$T$145)
	.dwattr $C$DW$T$600, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$600, DW_AT_decl_file("c:/ti/ccsv6/tools/compiler/arm_5.1.6/include/stdlib.h")
	.dwattr $C$DW$T$600, DW_AT_decl_line(0x50)
	.dwattr $C$DW$T$600, DW_AT_decl_column(0x23)

$C$DW$T$146	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$146, DW_AT_byte_size(0x08)
$C$DW$1644	.dwtag  DW_TAG_member
	.dwattr $C$DW$1644, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1644, DW_AT_name("quot")
	.dwattr $C$DW$1644, DW_AT_TI_symbol_name("quot")
	.dwattr $C$DW$1644, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1644, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1644, DW_AT_decl_file("c:/ti/ccsv6/tools/compiler/arm_5.1.6/include/stdlib.h")
	.dwattr $C$DW$1644, DW_AT_decl_line(0x52)
	.dwattr $C$DW$1644, DW_AT_decl_column(0x16)
$C$DW$1645	.dwtag  DW_TAG_member
	.dwattr $C$DW$1645, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1645, DW_AT_name("rem")
	.dwattr $C$DW$1645, DW_AT_TI_symbol_name("rem")
	.dwattr $C$DW$1645, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1645, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1645, DW_AT_decl_file("c:/ti/ccsv6/tools/compiler/arm_5.1.6/include/stdlib.h")
	.dwattr $C$DW$1645, DW_AT_decl_line(0x52)
	.dwattr $C$DW$1645, DW_AT_decl_column(0x1c)
	.dwendtag $C$DW$T$146

	.dwattr $C$DW$T$146, DW_AT_decl_file("c:/ti/ccsv6/tools/compiler/arm_5.1.6/include/stdlib.h")
	.dwattr $C$DW$T$146, DW_AT_decl_line(0x52)
	.dwattr $C$DW$T$146, DW_AT_decl_column(0x10)
$C$DW$T$601	.dwtag  DW_TAG_typedef, DW_AT_name("ldiv_t")
	.dwattr $C$DW$T$601, DW_AT_type(*$C$DW$T$146)
	.dwattr $C$DW$T$601, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$601, DW_AT_decl_file("c:/ti/ccsv6/tools/compiler/arm_5.1.6/include/stdlib.h")
	.dwattr $C$DW$T$601, DW_AT_decl_line(0x52)
	.dwattr $C$DW$T$601, DW_AT_decl_column(0x23)

$C$DW$T$147	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$147, DW_AT_byte_size(0x10)
$C$DW$1646	.dwtag  DW_TAG_member
	.dwattr $C$DW$1646, DW_AT_type(*$C$DW$T$14)
	.dwattr $C$DW$1646, DW_AT_name("quot")
	.dwattr $C$DW$1646, DW_AT_TI_symbol_name("quot")
	.dwattr $C$DW$1646, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1646, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1646, DW_AT_decl_file("c:/ti/ccsv6/tools/compiler/arm_5.1.6/include/stdlib.h")
	.dwattr $C$DW$1646, DW_AT_decl_line(0x55)
	.dwattr $C$DW$1646, DW_AT_decl_column(0x1c)
$C$DW$1647	.dwtag  DW_TAG_member
	.dwattr $C$DW$1647, DW_AT_type(*$C$DW$T$14)
	.dwattr $C$DW$1647, DW_AT_name("rem")
	.dwattr $C$DW$1647, DW_AT_TI_symbol_name("rem")
	.dwattr $C$DW$1647, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1647, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1647, DW_AT_decl_file("c:/ti/ccsv6/tools/compiler/arm_5.1.6/include/stdlib.h")
	.dwattr $C$DW$1647, DW_AT_decl_line(0x55)
	.dwattr $C$DW$1647, DW_AT_decl_column(0x22)
	.dwendtag $C$DW$T$147

	.dwattr $C$DW$T$147, DW_AT_decl_file("c:/ti/ccsv6/tools/compiler/arm_5.1.6/include/stdlib.h")
	.dwattr $C$DW$T$147, DW_AT_decl_line(0x55)
	.dwattr $C$DW$T$147, DW_AT_decl_column(0x10)
$C$DW$T$602	.dwtag  DW_TAG_typedef, DW_AT_name("lldiv_t")
	.dwattr $C$DW$T$602, DW_AT_type(*$C$DW$T$147)
	.dwattr $C$DW$T$602, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$602, DW_AT_decl_file("c:/ti/ccsv6/tools/compiler/arm_5.1.6/include/stdlib.h")
	.dwattr $C$DW$T$602, DW_AT_decl_line(0x55)
	.dwattr $C$DW$T$602, DW_AT_decl_column(0x29)

$C$DW$T$151	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$151, DW_AT_byte_size(0x04)
$C$DW$1648	.dwtag  DW_TAG_member
	.dwattr $C$DW$1648, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$1648, DW_AT_name("f")
	.dwattr $C$DW$1648, DW_AT_TI_symbol_name("f")
	.dwattr $C$DW$1648, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1648, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1648, DW_AT_decl_file("c:/ti/xdctools_3_30_01_25_core/packages/xdc/std.h")
	.dwattr $C$DW$1648, DW_AT_decl_line(0xac)
	.dwattr $C$DW$1648, DW_AT_decl_column(0x0f)
$C$DW$1649	.dwtag  DW_TAG_member
	.dwattr $C$DW$1649, DW_AT_type(*$C$DW$T$150)
	.dwattr $C$DW$1649, DW_AT_name("a")
	.dwattr $C$DW$1649, DW_AT_TI_symbol_name("a")
	.dwattr $C$DW$1649, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1649, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1649, DW_AT_decl_file("c:/ti/xdctools_3_30_01_25_core/packages/xdc/std.h")
	.dwattr $C$DW$1649, DW_AT_decl_line(0xad)
	.dwattr $C$DW$1649, DW_AT_decl_column(0x0f)
	.dwendtag $C$DW$T$151

	.dwattr $C$DW$T$151, DW_AT_decl_file("c:/ti/xdctools_3_30_01_25_core/packages/xdc/std.h")
	.dwattr $C$DW$T$151, DW_AT_decl_line(0xab)
	.dwattr $C$DW$T$151, DW_AT_decl_column(0x0f)
$C$DW$T$603	.dwtag  DW_TAG_typedef, DW_AT_name("xdc_FloatData")
	.dwattr $C$DW$T$603, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$T$603, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$603, DW_AT_decl_file("c:/ti/xdctools_3_30_01_25_core/packages/xdc/std.h")
	.dwattr $C$DW$T$603, DW_AT_decl_line(0xae)
	.dwattr $C$DW$T$603, DW_AT_decl_column(0x03)

$C$DW$T$156	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$156, DW_AT_byte_size(0xd0)
$C$DW$1650	.dwtag  DW_TAG_member
	.dwattr $C$DW$1650, DW_AT_type(*$C$DW$T$152)
	.dwattr $C$DW$1650, DW_AT_name("md5")
	.dwattr $C$DW$1650, DW_AT_TI_symbol_name("md5")
	.dwattr $C$DW$1650, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1650, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1650, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/hmac.h")
	.dwattr $C$DW$1650, DW_AT_decl_line(0x74)
	.dwattr $C$DW$1650, DW_AT_decl_column(0x0d)
$C$DW$1651	.dwtag  DW_TAG_member
	.dwattr $C$DW$1651, DW_AT_type(*$C$DW$T$153)
	.dwattr $C$DW$1651, DW_AT_name("sha")
	.dwattr $C$DW$1651, DW_AT_TI_symbol_name("sha")
	.dwattr $C$DW$1651, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1651, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1651, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/hmac.h")
	.dwattr $C$DW$1651, DW_AT_decl_line(0x77)
	.dwattr $C$DW$1651, DW_AT_decl_column(0x0d)
$C$DW$1652	.dwtag  DW_TAG_member
	.dwattr $C$DW$1652, DW_AT_type(*$C$DW$T$154)
	.dwattr $C$DW$1652, DW_AT_name("sha256")
	.dwattr $C$DW$1652, DW_AT_TI_symbol_name("sha256")
	.dwattr $C$DW$1652, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1652, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1652, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/hmac.h")
	.dwattr $C$DW$1652, DW_AT_decl_line(0x7a)
	.dwattr $C$DW$1652, DW_AT_decl_column(0x10)
$C$DW$1653	.dwtag  DW_TAG_member
	.dwattr $C$DW$1653, DW_AT_type(*$C$DW$T$155)
	.dwattr $C$DW$1653, DW_AT_name("sha512")
	.dwattr $C$DW$1653, DW_AT_TI_symbol_name("sha512")
	.dwattr $C$DW$1653, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1653, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1653, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/hmac.h")
	.dwattr $C$DW$1653, DW_AT_decl_line(0x80)
	.dwattr $C$DW$1653, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$156

	.dwattr $C$DW$T$156, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/hmac.h")
	.dwattr $C$DW$T$156, DW_AT_decl_line(0x72)
	.dwattr $C$DW$T$156, DW_AT_decl_column(0x0f)
$C$DW$T$193	.dwtag  DW_TAG_typedef, DW_AT_name("Hash")
	.dwattr $C$DW$T$193, DW_AT_type(*$C$DW$T$156)
	.dwattr $C$DW$T$193, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$193, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/hmac.h")
	.dwattr $C$DW$T$193, DW_AT_decl_line(0x85)
	.dwattr $C$DW$T$193, DW_AT_decl_column(0x03)

$C$DW$T$167	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$167, DW_AT_name(".ggroup1")
	.dwattr $C$DW$T$167, DW_AT_byte_size(0x11c)
$C$DW$1654	.dwtag  DW_TAG_member
	.dwattr $C$DW$1654, DW_AT_type(*$C$DW$T$158)
	.dwattr $C$DW$1654, DW_AT_name("desCbcAlgoID")
	.dwattr $C$DW$1654, DW_AT_TI_symbol_name("desCbcAlgoID$9")
	.dwattr $C$DW$1654, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1654, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1655	.dwtag  DW_TAG_member
	.dwattr $C$DW$1655, DW_AT_type(*$C$DW$T$159)
	.dwattr $C$DW$1655, DW_AT_name("shaAlgoID")
	.dwattr $C$DW$1655, DW_AT_TI_symbol_name("shaAlgoID$3")
	.dwattr $C$DW$1655, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$1655, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1656	.dwtag  DW_TAG_member
	.dwattr $C$DW$1656, DW_AT_type(*$C$DW$T$159)
	.dwattr $C$DW$1656, DW_AT_name("ECC_AlgoID")
	.dwattr $C$DW$1656, DW_AT_TI_symbol_name("ECC_AlgoID$21")
	.dwattr $C$DW$1656, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1656, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1657	.dwtag  DW_TAG_member
	.dwattr $C$DW$1657, DW_AT_type(*$C$DW$T$160)
	.dwattr $C$DW$1657, DW_AT_name("des3CbcAlgoID")
	.dwattr $C$DW$1657, DW_AT_TI_symbol_name("des3CbcAlgoID$10")
	.dwattr $C$DW$1657, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
	.dwattr $C$DW$1657, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1658	.dwtag  DW_TAG_member
	.dwattr $C$DW$1658, DW_AT_type(*$C$DW$T$161)
	.dwattr $C$DW$1658, DW_AT_name("shawECDSA_AlgoID")
	.dwattr $C$DW$1658, DW_AT_TI_symbol_name("shawECDSA_AlgoID$16")
	.dwattr $C$DW$1658, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
	.dwattr $C$DW$1658, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1659	.dwtag  DW_TAG_member
	.dwattr $C$DW$1659, DW_AT_type(*$C$DW$T$162)
	.dwattr $C$DW$1659, DW_AT_name("md5AlgoID")
	.dwattr $C$DW$1659, DW_AT_TI_symbol_name("md5AlgoID$7")
	.dwattr $C$DW$1659, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$1659, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1660	.dwtag  DW_TAG_member
	.dwattr $C$DW$1660, DW_AT_type(*$C$DW$T$162)
	.dwattr $C$DW$1660, DW_AT_name("md2AlgoID")
	.dwattr $C$DW$1660, DW_AT_TI_symbol_name("md2AlgoID$8")
	.dwattr $C$DW$1660, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr $C$DW$1660, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1661	.dwtag  DW_TAG_member
	.dwattr $C$DW$1661, DW_AT_type(*$C$DW$T$162)
	.dwattr $C$DW$1661, DW_AT_name("sha256wECDSA_AlgoID")
	.dwattr $C$DW$1661, DW_AT_TI_symbol_name("sha256wECDSA_AlgoID$17")
	.dwattr $C$DW$1661, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$1661, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1662	.dwtag  DW_TAG_member
	.dwattr $C$DW$1662, DW_AT_type(*$C$DW$T$162)
	.dwattr $C$DW$1662, DW_AT_name("sha384wECDSA_AlgoID")
	.dwattr $C$DW$1662, DW_AT_TI_symbol_name("sha384wECDSA_AlgoID$18")
	.dwattr $C$DW$1662, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
	.dwattr $C$DW$1662, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1663	.dwtag  DW_TAG_member
	.dwattr $C$DW$1663, DW_AT_type(*$C$DW$T$162)
	.dwattr $C$DW$1663, DW_AT_name("sha512wECDSA_AlgoID")
	.dwattr $C$DW$1663, DW_AT_TI_symbol_name("sha512wECDSA_AlgoID$19")
	.dwattr $C$DW$1663, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr $C$DW$1663, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1664	.dwtag  DW_TAG_member
	.dwattr $C$DW$1664, DW_AT_type(*$C$DW$T$163)
	.dwattr $C$DW$1664, DW_AT_name("sha256AlgoID")
	.dwattr $C$DW$1664, DW_AT_TI_symbol_name("sha256AlgoID$4")
	.dwattr $C$DW$1664, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
	.dwattr $C$DW$1664, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1665	.dwtag  DW_TAG_member
	.dwattr $C$DW$1665, DW_AT_type(*$C$DW$T$163)
	.dwattr $C$DW$1665, DW_AT_name("sha384AlgoID")
	.dwattr $C$DW$1665, DW_AT_TI_symbol_name("sha384AlgoID$5")
	.dwattr $C$DW$1665, DW_AT_data_member_location[DW_OP_plus_uconst 0x61]
	.dwattr $C$DW$1665, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1666	.dwtag  DW_TAG_member
	.dwattr $C$DW$1666, DW_AT_type(*$C$DW$T$163)
	.dwattr $C$DW$1666, DW_AT_name("sha512AlgoID")
	.dwattr $C$DW$1666, DW_AT_TI_symbol_name("sha512AlgoID$6")
	.dwattr $C$DW$1666, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
	.dwattr $C$DW$1666, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1667	.dwtag  DW_TAG_member
	.dwattr $C$DW$1667, DW_AT_type(*$C$DW$T$163)
	.dwattr $C$DW$1667, DW_AT_name("md5wRSA_AlgoID")
	.dwattr $C$DW$1667, DW_AT_TI_symbol_name("md5wRSA_AlgoID$11")
	.dwattr $C$DW$1667, DW_AT_data_member_location[DW_OP_plus_uconst 0x77]
	.dwattr $C$DW$1667, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1668	.dwtag  DW_TAG_member
	.dwattr $C$DW$1668, DW_AT_type(*$C$DW$T$163)
	.dwattr $C$DW$1668, DW_AT_name("shawRSA_AlgoID")
	.dwattr $C$DW$1668, DW_AT_TI_symbol_name("shawRSA_AlgoID$12")
	.dwattr $C$DW$1668, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
	.dwattr $C$DW$1668, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1669	.dwtag  DW_TAG_member
	.dwattr $C$DW$1669, DW_AT_type(*$C$DW$T$163)
	.dwattr $C$DW$1669, DW_AT_name("sha256wRSA_AlgoID")
	.dwattr $C$DW$1669, DW_AT_TI_symbol_name("sha256wRSA_AlgoID$13")
	.dwattr $C$DW$1669, DW_AT_data_member_location[DW_OP_plus_uconst 0x8d]
	.dwattr $C$DW$1669, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1670	.dwtag  DW_TAG_member
	.dwattr $C$DW$1670, DW_AT_type(*$C$DW$T$163)
	.dwattr $C$DW$1670, DW_AT_name("sha384wRSA_AlgoID")
	.dwattr $C$DW$1670, DW_AT_TI_symbol_name("sha384wRSA_AlgoID$14")
	.dwattr $C$DW$1670, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
	.dwattr $C$DW$1670, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1671	.dwtag  DW_TAG_member
	.dwattr $C$DW$1671, DW_AT_type(*$C$DW$T$163)
	.dwattr $C$DW$1671, DW_AT_name("sha512wRSA_AlgoID")
	.dwattr $C$DW$1671, DW_AT_TI_symbol_name("sha512wRSA_AlgoID$15")
	.dwattr $C$DW$1671, DW_AT_data_member_location[DW_OP_plus_uconst 0xa3]
	.dwattr $C$DW$1671, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1672	.dwtag  DW_TAG_member
	.dwattr $C$DW$1672, DW_AT_type(*$C$DW$T$163)
	.dwattr $C$DW$1672, DW_AT_name("RSA_AlgoID")
	.dwattr $C$DW$1672, DW_AT_TI_symbol_name("RSA_AlgoID$20")
	.dwattr $C$DW$1672, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
	.dwattr $C$DW$1672, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1673	.dwtag  DW_TAG_member
	.dwattr $C$DW$1673, DW_AT_type(*$C$DW$T$166)
	.dwattr $C$DW$1673, DW_AT_name("_ytab")
	.dwattr $C$DW$1673, DW_AT_TI_symbol_name("_ytab$1")
	.dwattr $C$DW$1673, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
	.dwattr $C$DW$1673, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$167


$C$DW$T$606	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$606, DW_AT_name("ASN_Flags")
	.dwattr $C$DW$T$606, DW_AT_byte_size(0x01)
$C$DW$1674	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_CONSTRUCTED"), DW_AT_const_value(0x20)
	.dwattr $C$DW$1674, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1674, DW_AT_decl_line(0x4d)
	.dwattr $C$DW$1674, DW_AT_decl_column(0x05)
$C$DW$1675	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_CONTEXT_SPECIFIC"), DW_AT_const_value(0x80)
	.dwattr $C$DW$1675, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1675, DW_AT_decl_line(0x4e)
	.dwattr $C$DW$1675, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$606

	.dwattr $C$DW$T$606, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$T$606, DW_AT_decl_line(0x4c)
	.dwattr $C$DW$T$606, DW_AT_decl_column(0x07)

$C$DW$T$607	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$607, DW_AT_name("ASN_Tags")
	.dwattr $C$DW$T$607, DW_AT_byte_size(0x01)
$C$DW$1676	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_BOOLEAN"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1676, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1676, DW_AT_decl_line(0x37)
	.dwattr $C$DW$1676, DW_AT_decl_column(0x05)
$C$DW$1677	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_INTEGER"), DW_AT_const_value(0x02)
	.dwattr $C$DW$1677, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1677, DW_AT_decl_line(0x38)
	.dwattr $C$DW$1677, DW_AT_decl_column(0x05)
$C$DW$1678	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_BIT_STRING"), DW_AT_const_value(0x03)
	.dwattr $C$DW$1678, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1678, DW_AT_decl_line(0x39)
	.dwattr $C$DW$1678, DW_AT_decl_column(0x05)
$C$DW$1679	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_OCTET_STRING"), DW_AT_const_value(0x04)
	.dwattr $C$DW$1679, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1679, DW_AT_decl_line(0x3a)
	.dwattr $C$DW$1679, DW_AT_decl_column(0x05)
$C$DW$1680	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_TAG_NULL"), DW_AT_const_value(0x05)
	.dwattr $C$DW$1680, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1680, DW_AT_decl_line(0x3b)
	.dwattr $C$DW$1680, DW_AT_decl_column(0x05)
$C$DW$1681	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_OBJECT_ID"), DW_AT_const_value(0x06)
	.dwattr $C$DW$1681, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1681, DW_AT_decl_line(0x3c)
	.dwattr $C$DW$1681, DW_AT_decl_column(0x05)
$C$DW$1682	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_ENUMERATED"), DW_AT_const_value(0x0a)
	.dwattr $C$DW$1682, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1682, DW_AT_decl_line(0x3d)
	.dwattr $C$DW$1682, DW_AT_decl_column(0x05)
$C$DW$1683	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_UTF8STRING"), DW_AT_const_value(0x0c)
	.dwattr $C$DW$1683, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1683, DW_AT_decl_line(0x3e)
	.dwattr $C$DW$1683, DW_AT_decl_column(0x05)
$C$DW$1684	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_SEQUENCE"), DW_AT_const_value(0x10)
	.dwattr $C$DW$1684, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1684, DW_AT_decl_line(0x3f)
	.dwattr $C$DW$1684, DW_AT_decl_column(0x05)
$C$DW$1685	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_SET"), DW_AT_const_value(0x11)
	.dwattr $C$DW$1685, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1685, DW_AT_decl_line(0x40)
	.dwattr $C$DW$1685, DW_AT_decl_column(0x05)
$C$DW$1686	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_UTC_TIME"), DW_AT_const_value(0x17)
	.dwattr $C$DW$1686, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1686, DW_AT_decl_line(0x41)
	.dwattr $C$DW$1686, DW_AT_decl_column(0x05)
$C$DW$1687	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_OTHER_TYPE"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1687, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1687, DW_AT_decl_line(0x42)
	.dwattr $C$DW$1687, DW_AT_decl_column(0x05)
$C$DW$1688	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_RFC822_TYPE"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1688, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1688, DW_AT_decl_line(0x43)
	.dwattr $C$DW$1688, DW_AT_decl_column(0x05)
$C$DW$1689	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_DNS_TYPE"), DW_AT_const_value(0x02)
	.dwattr $C$DW$1689, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1689, DW_AT_decl_line(0x44)
	.dwattr $C$DW$1689, DW_AT_decl_column(0x05)
$C$DW$1690	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_DIR_TYPE"), DW_AT_const_value(0x04)
	.dwattr $C$DW$1690, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1690, DW_AT_decl_line(0x45)
	.dwattr $C$DW$1690, DW_AT_decl_column(0x05)
$C$DW$1691	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_GENERALIZED_TIME"), DW_AT_const_value(0x18)
	.dwattr $C$DW$1691, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1691, DW_AT_decl_line(0x46)
	.dwattr $C$DW$1691, DW_AT_decl_column(0x05)
$C$DW$1692	.dwtag  DW_TAG_enumerator, DW_AT_name("CRL_EXTENSIONS"), DW_AT_const_value(0xa0)
	.dwattr $C$DW$1692, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1692, DW_AT_decl_line(0x47)
	.dwattr $C$DW$1692, DW_AT_decl_column(0x05)
$C$DW$1693	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_EXTENSIONS"), DW_AT_const_value(0xa3)
	.dwattr $C$DW$1693, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1693, DW_AT_decl_line(0x48)
	.dwattr $C$DW$1693, DW_AT_decl_column(0x05)
$C$DW$1694	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_LONG_LENGTH"), DW_AT_const_value(0x80)
	.dwattr $C$DW$1694, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1694, DW_AT_decl_line(0x49)
	.dwattr $C$DW$1694, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$607

	.dwattr $C$DW$T$607, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$T$607, DW_AT_decl_line(0x36)
	.dwattr $C$DW$T$607, DW_AT_decl_column(0x06)

$C$DW$T$170	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$170, DW_AT_name("Arc4")
	.dwattr $C$DW$T$170, DW_AT_byte_size(0x102)
$C$DW$1695	.dwtag  DW_TAG_member
	.dwattr $C$DW$1695, DW_AT_type(*$C$DW$T$168)
	.dwattr $C$DW$1695, DW_AT_name("x")
	.dwattr $C$DW$1695, DW_AT_TI_symbol_name("x")
	.dwattr $C$DW$1695, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1695, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1695, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/arc4.h")
	.dwattr $C$DW$1695, DW_AT_decl_line(0x2c)
	.dwattr $C$DW$1695, DW_AT_decl_column(0x0a)
$C$DW$1696	.dwtag  DW_TAG_member
	.dwattr $C$DW$1696, DW_AT_type(*$C$DW$T$168)
	.dwattr $C$DW$1696, DW_AT_name("y")
	.dwattr $C$DW$1696, DW_AT_TI_symbol_name("y")
	.dwattr $C$DW$1696, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1696, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1696, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/arc4.h")
	.dwattr $C$DW$1696, DW_AT_decl_line(0x2d)
	.dwattr $C$DW$1696, DW_AT_decl_column(0x0a)
$C$DW$1697	.dwtag  DW_TAG_member
	.dwattr $C$DW$1697, DW_AT_type(*$C$DW$T$169)
	.dwattr $C$DW$1697, DW_AT_name("state")
	.dwattr $C$DW$1697, DW_AT_TI_symbol_name("state")
	.dwattr $C$DW$1697, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1697, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1697, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/arc4.h")
	.dwattr $C$DW$1697, DW_AT_decl_line(0x2e)
	.dwattr $C$DW$1697, DW_AT_decl_column(0x0a)
	.dwendtag $C$DW$T$170

	.dwattr $C$DW$T$170, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/arc4.h")
	.dwattr $C$DW$T$170, DW_AT_decl_line(0x2b)
	.dwattr $C$DW$T$170, DW_AT_decl_column(0x10)
$C$DW$T$200	.dwtag  DW_TAG_typedef, DW_AT_name("Arc4")
	.dwattr $C$DW$T$200, DW_AT_type(*$C$DW$T$170)
	.dwattr $C$DW$T$200, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$200, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/arc4.h")
	.dwattr $C$DW$T$200, DW_AT_decl_line(0x34)
	.dwattr $C$DW$T$200, DW_AT_decl_column(0x03)
$C$DW$T$608	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$608, DW_AT_type(*$C$DW$T$200)
	.dwattr $C$DW$T$608, DW_AT_address_class(0x20)

$C$DW$T$610	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$610, DW_AT_name("AuthInfo_Sum")
	.dwattr $C$DW$T$610, DW_AT_byte_size(0x01)
$C$DW$1698	.dwtag  DW_TAG_enumerator, DW_AT_name("AIA_OCSP_OID"), DW_AT_const_value(0x74)
	.dwattr $C$DW$1698, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1698, DW_AT_decl_line(0xec)
	.dwattr $C$DW$1698, DW_AT_decl_column(0x05)
$C$DW$1699	.dwtag  DW_TAG_enumerator, DW_AT_name("AIA_CA_ISSUER_OID"), DW_AT_const_value(0x75)
	.dwattr $C$DW$1699, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1699, DW_AT_decl_line(0xed)
	.dwattr $C$DW$1699, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$610

	.dwattr $C$DW$T$610, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$T$610, DW_AT_decl_line(0xeb)
	.dwattr $C$DW$T$610, DW_AT_decl_column(0x06)

$C$DW$T$174	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$174, DW_AT_name("Base_entry")
	.dwattr $C$DW$T$174, DW_AT_byte_size(0x10)
$C$DW$1700	.dwtag  DW_TAG_member
	.dwattr $C$DW$1700, DW_AT_type(*$C$DW$T$172)
	.dwattr $C$DW$1700, DW_AT_name("next")
	.dwattr $C$DW$1700, DW_AT_TI_symbol_name("next")
	.dwattr $C$DW$1700, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1700, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1700, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1700, DW_AT_decl_line(0x119)
	.dwattr $C$DW$1700, DW_AT_decl_column(0x11)
$C$DW$1701	.dwtag  DW_TAG_member
	.dwattr $C$DW$1701, DW_AT_type(*$C$DW$T$173)
	.dwattr $C$DW$1701, DW_AT_name("name")
	.dwattr $C$DW$1701, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$1701, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1701, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1701, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1701, DW_AT_decl_line(0x11a)
	.dwattr $C$DW$1701, DW_AT_decl_column(0x11)
$C$DW$1702	.dwtag  DW_TAG_member
	.dwattr $C$DW$1702, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1702, DW_AT_name("nameSz")
	.dwattr $C$DW$1702, DW_AT_TI_symbol_name("nameSz")
	.dwattr $C$DW$1702, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1702, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1702, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1702, DW_AT_decl_line(0x11b)
	.dwattr $C$DW$1702, DW_AT_decl_column(0x11)
$C$DW$1703	.dwtag  DW_TAG_member
	.dwattr $C$DW$1703, DW_AT_type(*$C$DW$T$168)
	.dwattr $C$DW$1703, DW_AT_name("type")
	.dwattr $C$DW$1703, DW_AT_TI_symbol_name("type")
	.dwattr $C$DW$1703, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1703, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1703, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1703, DW_AT_decl_line(0x11c)
	.dwattr $C$DW$1703, DW_AT_decl_column(0x11)
	.dwendtag $C$DW$T$174

	.dwattr $C$DW$T$174, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$T$174, DW_AT_decl_line(0x118)
	.dwattr $C$DW$T$174, DW_AT_decl_column(0x08)
$C$DW$T$171	.dwtag  DW_TAG_typedef, DW_AT_name("Base_entry")
	.dwattr $C$DW$T$171, DW_AT_type(*$C$DW$T$174)
	.dwattr $C$DW$T$171, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$171, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$T$171, DW_AT_decl_line(0x116)
	.dwattr $C$DW$T$171, DW_AT_decl_column(0x1c)
$C$DW$T$172	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$172, DW_AT_type(*$C$DW$T$171)
	.dwattr $C$DW$T$172, DW_AT_address_class(0x20)
$C$DW$T$611	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$611, DW_AT_type(*$C$DW$T$172)
	.dwattr $C$DW$T$611, DW_AT_address_class(0x20)
$C$DW$T$612	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$612, DW_AT_type(*$C$DW$T$174)
	.dwattr $C$DW$T$612, DW_AT_address_class(0x20)

$C$DW$T$615	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$615, DW_AT_name("Block_Sum")
	.dwattr $C$DW$T$615, DW_AT_byte_size(0x02)
$C$DW$1704	.dwtag  DW_TAG_enumerator, DW_AT_name("DESb"), DW_AT_const_value(0x45)
	.dwattr $C$DW$1704, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1704, DW_AT_decl_line(0xb8)
	.dwattr $C$DW$1704, DW_AT_decl_column(0x05)
$C$DW$1705	.dwtag  DW_TAG_enumerator, DW_AT_name("DES3b"), DW_AT_const_value(0x28c)
	.dwattr $C$DW$1705, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1705, DW_AT_decl_line(0xb9)
	.dwattr $C$DW$1705, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$615

	.dwattr $C$DW$T$615, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$T$615, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$T$615, DW_AT_decl_column(0x06)

$C$DW$T$616	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$616, DW_AT_name("CYA_Log_Levels")
	.dwattr $C$DW$T$616, DW_AT_byte_size(0x01)
$C$DW$1706	.dwtag  DW_TAG_enumerator, DW_AT_name("ERROR_LOG"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1706, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/logging.h")
	.dwattr $C$DW$1706, DW_AT_decl_line(0x23)
	.dwattr $C$DW$1706, DW_AT_decl_column(0x05)
$C$DW$1707	.dwtag  DW_TAG_enumerator, DW_AT_name("INFO_LOG"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1707, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/logging.h")
	.dwattr $C$DW$1707, DW_AT_decl_line(0x24)
	.dwattr $C$DW$1707, DW_AT_decl_column(0x05)
$C$DW$1708	.dwtag  DW_TAG_enumerator, DW_AT_name("ENTER_LOG"), DW_AT_const_value(0x02)
	.dwattr $C$DW$1708, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/logging.h")
	.dwattr $C$DW$1708, DW_AT_decl_line(0x25)
	.dwattr $C$DW$1708, DW_AT_decl_column(0x05)
$C$DW$1709	.dwtag  DW_TAG_enumerator, DW_AT_name("LEAVE_LOG"), DW_AT_const_value(0x03)
	.dwattr $C$DW$1709, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/logging.h")
	.dwattr $C$DW$1709, DW_AT_decl_line(0x26)
	.dwattr $C$DW$1709, DW_AT_decl_column(0x05)
$C$DW$1710	.dwtag  DW_TAG_enumerator, DW_AT_name("OTHER_LOG"), DW_AT_const_value(0x04)
	.dwattr $C$DW$1710, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/logging.h")
	.dwattr $C$DW$1710, DW_AT_decl_line(0x27)
	.dwattr $C$DW$1710, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$616

	.dwattr $C$DW$T$616, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/logging.h")
	.dwattr $C$DW$T$616, DW_AT_decl_line(0x22)
	.dwattr $C$DW$T$616, DW_AT_decl_column(0x07)

$C$DW$T$19	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$19, DW_AT_name("CertStatus")
	.dwattr $C$DW$T$19, DW_AT_declaration
	.dwendtag $C$DW$T$19

	.dwattr $C$DW$T$19, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$T$19, DW_AT_decl_line(0x233)
	.dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
$C$DW$T$617	.dwtag  DW_TAG_typedef, DW_AT_name("CertStatus")
	.dwattr $C$DW$T$617, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$617, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$617, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$T$617, DW_AT_decl_line(0x233)
	.dwattr $C$DW$T$617, DW_AT_decl_column(0x1b)

$C$DW$T$618	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$618, DW_AT_name("CertType")
	.dwattr $C$DW$T$618, DW_AT_byte_size(0x01)
$C$DW$1711	.dwtag  DW_TAG_enumerator, DW_AT_name("CERT_TYPE"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1711, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn_public.h")
	.dwattr $C$DW$1711, DW_AT_decl_line(0x28)
	.dwattr $C$DW$1711, DW_AT_decl_column(0x05)
$C$DW$1712	.dwtag  DW_TAG_enumerator, DW_AT_name("PRIVATEKEY_TYPE"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1712, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn_public.h")
	.dwattr $C$DW$1712, DW_AT_decl_line(0x29)
	.dwattr $C$DW$1712, DW_AT_decl_column(0x05)
$C$DW$1713	.dwtag  DW_TAG_enumerator, DW_AT_name("DH_PARAM_TYPE"), DW_AT_const_value(0x02)
	.dwattr $C$DW$1713, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn_public.h")
	.dwattr $C$DW$1713, DW_AT_decl_line(0x2a)
	.dwattr $C$DW$1713, DW_AT_decl_column(0x05)
$C$DW$1714	.dwtag  DW_TAG_enumerator, DW_AT_name("CRL_TYPE"), DW_AT_const_value(0x03)
	.dwattr $C$DW$1714, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn_public.h")
	.dwattr $C$DW$1714, DW_AT_decl_line(0x2b)
	.dwattr $C$DW$1714, DW_AT_decl_column(0x05)
$C$DW$1715	.dwtag  DW_TAG_enumerator, DW_AT_name("CA_TYPE"), DW_AT_const_value(0x04)
	.dwattr $C$DW$1715, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn_public.h")
	.dwattr $C$DW$1715, DW_AT_decl_line(0x2c)
	.dwattr $C$DW$1715, DW_AT_decl_column(0x05)
$C$DW$1716	.dwtag  DW_TAG_enumerator, DW_AT_name("ECC_PRIVATEKEY_TYPE"), DW_AT_const_value(0x05)
	.dwattr $C$DW$1716, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn_public.h")
	.dwattr $C$DW$1716, DW_AT_decl_line(0x2d)
	.dwattr $C$DW$1716, DW_AT_decl_column(0x05)
$C$DW$1717	.dwtag  DW_TAG_enumerator, DW_AT_name("CERTREQ_TYPE"), DW_AT_const_value(0x06)
	.dwattr $C$DW$1717, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn_public.h")
	.dwattr $C$DW$1717, DW_AT_decl_line(0x2e)
	.dwattr $C$DW$1717, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$618

	.dwattr $C$DW$T$618, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn_public.h")
	.dwattr $C$DW$T$618, DW_AT_decl_line(0x27)
	.dwattr $C$DW$T$618, DW_AT_decl_column(0x06)

$C$DW$T$619	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$619, DW_AT_name("CertificatePolicy_Sum")
	.dwattr $C$DW$T$619, DW_AT_byte_size(0x01)
$C$DW$1718	.dwtag  DW_TAG_enumerator, DW_AT_name("CP_ANY_OID"), DW_AT_const_value(0x92)
	.dwattr $C$DW$1718, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1718, DW_AT_decl_line(0xe4)
	.dwattr $C$DW$1718, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$619

	.dwattr $C$DW$T$619, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$T$619, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$T$619, DW_AT_decl_column(0x06)

$C$DW$T$620	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$620, DW_AT_name("Ctc_Encoding")
	.dwattr $C$DW$T$620, DW_AT_byte_size(0x01)
$C$DW$1719	.dwtag  DW_TAG_enumerator, DW_AT_name("CTC_UTF8"), DW_AT_const_value(0x0c)
	.dwattr $C$DW$1719, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn_public.h")
	.dwattr $C$DW$1719, DW_AT_decl_line(0x42)
	.dwattr $C$DW$1719, DW_AT_decl_column(0x05)
$C$DW$1720	.dwtag  DW_TAG_enumerator, DW_AT_name("CTC_PRINTABLE"), DW_AT_const_value(0x13)
	.dwattr $C$DW$1720, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn_public.h")
	.dwattr $C$DW$1720, DW_AT_decl_line(0x43)
	.dwattr $C$DW$1720, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$620

	.dwattr $C$DW$T$620, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn_public.h")
	.dwattr $C$DW$T$620, DW_AT_decl_line(0x41)
	.dwattr $C$DW$T$620, DW_AT_decl_column(0x06)

$C$DW$T$621	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$621, DW_AT_name("Ctc_SigType")
	.dwattr $C$DW$T$621, DW_AT_byte_size(0x02)
$C$DW$1721	.dwtag  DW_TAG_enumerator, DW_AT_name("CTC_SHAwDSA"), DW_AT_const_value(0x205)
	.dwattr $C$DW$1721, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn_public.h")
	.dwattr $C$DW$1721, DW_AT_decl_line(0x34)
	.dwattr $C$DW$1721, DW_AT_decl_column(0x05)
$C$DW$1722	.dwtag  DW_TAG_enumerator, DW_AT_name("CTC_MD2wRSA"), DW_AT_const_value(0x286)
	.dwattr $C$DW$1722, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn_public.h")
	.dwattr $C$DW$1722, DW_AT_decl_line(0x35)
	.dwattr $C$DW$1722, DW_AT_decl_column(0x05)
$C$DW$1723	.dwtag  DW_TAG_enumerator, DW_AT_name("CTC_MD5wRSA"), DW_AT_const_value(0x288)
	.dwattr $C$DW$1723, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn_public.h")
	.dwattr $C$DW$1723, DW_AT_decl_line(0x36)
	.dwattr $C$DW$1723, DW_AT_decl_column(0x05)
$C$DW$1724	.dwtag  DW_TAG_enumerator, DW_AT_name("CTC_SHAwRSA"), DW_AT_const_value(0x289)
	.dwattr $C$DW$1724, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn_public.h")
	.dwattr $C$DW$1724, DW_AT_decl_line(0x37)
	.dwattr $C$DW$1724, DW_AT_decl_column(0x05)
$C$DW$1725	.dwtag  DW_TAG_enumerator, DW_AT_name("CTC_SHAwECDSA"), DW_AT_const_value(0x208)
	.dwattr $C$DW$1725, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn_public.h")
	.dwattr $C$DW$1725, DW_AT_decl_line(0x38)
	.dwattr $C$DW$1725, DW_AT_decl_column(0x05)
$C$DW$1726	.dwtag  DW_TAG_enumerator, DW_AT_name("CTC_SHA256wRSA"), DW_AT_const_value(0x28f)
	.dwattr $C$DW$1726, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn_public.h")
	.dwattr $C$DW$1726, DW_AT_decl_line(0x39)
	.dwattr $C$DW$1726, DW_AT_decl_column(0x05)
$C$DW$1727	.dwtag  DW_TAG_enumerator, DW_AT_name("CTC_SHA256wECDSA"), DW_AT_const_value(0x20c)
	.dwattr $C$DW$1727, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn_public.h")
	.dwattr $C$DW$1727, DW_AT_decl_line(0x3a)
	.dwattr $C$DW$1727, DW_AT_decl_column(0x05)
$C$DW$1728	.dwtag  DW_TAG_enumerator, DW_AT_name("CTC_SHA384wRSA"), DW_AT_const_value(0x290)
	.dwattr $C$DW$1728, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn_public.h")
	.dwattr $C$DW$1728, DW_AT_decl_line(0x3b)
	.dwattr $C$DW$1728, DW_AT_decl_column(0x05)
$C$DW$1729	.dwtag  DW_TAG_enumerator, DW_AT_name("CTC_SHA384wECDSA"), DW_AT_const_value(0x20d)
	.dwattr $C$DW$1729, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn_public.h")
	.dwattr $C$DW$1729, DW_AT_decl_line(0x3c)
	.dwattr $C$DW$1729, DW_AT_decl_column(0x05)
$C$DW$1730	.dwtag  DW_TAG_enumerator, DW_AT_name("CTC_SHA512wRSA"), DW_AT_const_value(0x291)
	.dwattr $C$DW$1730, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn_public.h")
	.dwattr $C$DW$1730, DW_AT_decl_line(0x3d)
	.dwattr $C$DW$1730, DW_AT_decl_column(0x05)
$C$DW$1731	.dwtag  DW_TAG_enumerator, DW_AT_name("CTC_SHA512wECDSA"), DW_AT_const_value(0x20e)
	.dwattr $C$DW$1731, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn_public.h")
	.dwattr $C$DW$1731, DW_AT_decl_line(0x3e)
	.dwattr $C$DW$1731, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$621

	.dwattr $C$DW$T$621, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn_public.h")
	.dwattr $C$DW$T$621, DW_AT_decl_line(0x33)
	.dwattr $C$DW$T$621, DW_AT_decl_column(0x06)

$C$DW$T$177	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$177, DW_AT_name("DNS_entry")
	.dwattr $C$DW$T$177, DW_AT_byte_size(0x08)
$C$DW$1732	.dwtag  DW_TAG_member
	.dwattr $C$DW$1732, DW_AT_type(*$C$DW$T$176)
	.dwattr $C$DW$1732, DW_AT_name("next")
	.dwattr $C$DW$1732, DW_AT_TI_symbol_name("next")
	.dwattr $C$DW$1732, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1732, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1732, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1732, DW_AT_decl_line(0x111)
	.dwattr $C$DW$1732, DW_AT_decl_column(0x10)
$C$DW$1733	.dwtag  DW_TAG_member
	.dwattr $C$DW$1733, DW_AT_type(*$C$DW$T$173)
	.dwattr $C$DW$1733, DW_AT_name("name")
	.dwattr $C$DW$1733, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$1733, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1733, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1733, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1733, DW_AT_decl_line(0x112)
	.dwattr $C$DW$1733, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$177

	.dwattr $C$DW$T$177, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$T$177, DW_AT_decl_line(0x110)
	.dwattr $C$DW$T$177, DW_AT_decl_column(0x08)
$C$DW$T$175	.dwtag  DW_TAG_typedef, DW_AT_name("DNS_entry")
	.dwattr $C$DW$T$175, DW_AT_type(*$C$DW$T$177)
	.dwattr $C$DW$T$175, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$175, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$T$175, DW_AT_decl_line(0x10e)
	.dwattr $C$DW$T$175, DW_AT_decl_column(0x1c)
$C$DW$T$176	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$176, DW_AT_type(*$C$DW$T$175)
	.dwattr $C$DW$T$176, DW_AT_address_class(0x20)
$C$DW$T$622	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$622, DW_AT_type(*$C$DW$T$177)
	.dwattr $C$DW$T$622, DW_AT_address_class(0x20)

$C$DW$T$625	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$625, DW_AT_name("DN_Tags")
	.dwattr $C$DW$T$625, DW_AT_byte_size(0x01)
$C$DW$1734	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_COMMON_NAME"), DW_AT_const_value(0x03)
	.dwattr $C$DW$1734, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1734, DW_AT_decl_line(0x52)
	.dwattr $C$DW$1734, DW_AT_decl_column(0x05)
$C$DW$1735	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_SUR_NAME"), DW_AT_const_value(0x04)
	.dwattr $C$DW$1735, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1735, DW_AT_decl_line(0x53)
	.dwattr $C$DW$1735, DW_AT_decl_column(0x05)
$C$DW$1736	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_SERIAL_NUMBER"), DW_AT_const_value(0x05)
	.dwattr $C$DW$1736, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1736, DW_AT_decl_line(0x54)
	.dwattr $C$DW$1736, DW_AT_decl_column(0x05)
$C$DW$1737	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_COUNTRY_NAME"), DW_AT_const_value(0x06)
	.dwattr $C$DW$1737, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1737, DW_AT_decl_line(0x55)
	.dwattr $C$DW$1737, DW_AT_decl_column(0x05)
$C$DW$1738	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_LOCALITY_NAME"), DW_AT_const_value(0x07)
	.dwattr $C$DW$1738, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1738, DW_AT_decl_line(0x56)
	.dwattr $C$DW$1738, DW_AT_decl_column(0x05)
$C$DW$1739	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_STATE_NAME"), DW_AT_const_value(0x08)
	.dwattr $C$DW$1739, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1739, DW_AT_decl_line(0x57)
	.dwattr $C$DW$1739, DW_AT_decl_column(0x05)
$C$DW$1740	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_ORG_NAME"), DW_AT_const_value(0x0a)
	.dwattr $C$DW$1740, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1740, DW_AT_decl_line(0x58)
	.dwattr $C$DW$1740, DW_AT_decl_column(0x05)
$C$DW$1741	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_ORGUNIT_NAME"), DW_AT_const_value(0x0b)
	.dwattr $C$DW$1741, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1741, DW_AT_decl_line(0x59)
	.dwattr $C$DW$1741, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$625

	.dwattr $C$DW$T$625, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$T$625, DW_AT_decl_line(0x51)
	.dwattr $C$DW$T$625, DW_AT_decl_column(0x06)

$C$DW$T$184	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$184, DW_AT_name("DecodedCert")
	.dwattr $C$DW$T$184, DW_AT_byte_size(0x314)
$C$DW$1742	.dwtag  DW_TAG_member
	.dwattr $C$DW$1742, DW_AT_type(*$C$DW$T$178)
	.dwattr $C$DW$1742, DW_AT_name("publicKey")
	.dwattr $C$DW$1742, DW_AT_TI_symbol_name("publicKey")
	.dwattr $C$DW$1742, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1742, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1742, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1742, DW_AT_decl_line(0x141)
	.dwattr $C$DW$1742, DW_AT_decl_column(0x0d)
$C$DW$1743	.dwtag  DW_TAG_member
	.dwattr $C$DW$1743, DW_AT_type(*$C$DW$T$179)
	.dwattr $C$DW$1743, DW_AT_name("pubKeySize")
	.dwattr $C$DW$1743, DW_AT_TI_symbol_name("pubKeySize")
	.dwattr $C$DW$1743, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1743, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1743, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1743, DW_AT_decl_line(0x142)
	.dwattr $C$DW$1743, DW_AT_decl_column(0x0d)
$C$DW$1744	.dwtag  DW_TAG_member
	.dwattr $C$DW$1744, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1744, DW_AT_name("pubKeyStored")
	.dwattr $C$DW$1744, DW_AT_TI_symbol_name("pubKeyStored")
	.dwattr $C$DW$1744, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1744, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1744, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1744, DW_AT_decl_line(0x143)
	.dwattr $C$DW$1744, DW_AT_decl_column(0x0d)
$C$DW$1745	.dwtag  DW_TAG_member
	.dwattr $C$DW$1745, DW_AT_type(*$C$DW$T$179)
	.dwattr $C$DW$1745, DW_AT_name("certBegin")
	.dwattr $C$DW$1745, DW_AT_TI_symbol_name("certBegin")
	.dwattr $C$DW$1745, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1745, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1745, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1745, DW_AT_decl_line(0x144)
	.dwattr $C$DW$1745, DW_AT_decl_column(0x0d)
$C$DW$1746	.dwtag  DW_TAG_member
	.dwattr $C$DW$1746, DW_AT_type(*$C$DW$T$179)
	.dwattr $C$DW$1746, DW_AT_name("sigIndex")
	.dwattr $C$DW$1746, DW_AT_TI_symbol_name("sigIndex")
	.dwattr $C$DW$1746, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1746, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1746, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1746, DW_AT_decl_line(0x145)
	.dwattr $C$DW$1746, DW_AT_decl_column(0x0d)
$C$DW$1747	.dwtag  DW_TAG_member
	.dwattr $C$DW$1747, DW_AT_type(*$C$DW$T$179)
	.dwattr $C$DW$1747, DW_AT_name("sigLength")
	.dwattr $C$DW$1747, DW_AT_TI_symbol_name("sigLength")
	.dwattr $C$DW$1747, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1747, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1747, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1747, DW_AT_decl_line(0x146)
	.dwattr $C$DW$1747, DW_AT_decl_column(0x0d)
$C$DW$1748	.dwtag  DW_TAG_member
	.dwattr $C$DW$1748, DW_AT_type(*$C$DW$T$179)
	.dwattr $C$DW$1748, DW_AT_name("signatureOID")
	.dwattr $C$DW$1748, DW_AT_TI_symbol_name("signatureOID")
	.dwattr $C$DW$1748, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1748, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1748, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1748, DW_AT_decl_line(0x147)
	.dwattr $C$DW$1748, DW_AT_decl_column(0x0d)
$C$DW$1749	.dwtag  DW_TAG_member
	.dwattr $C$DW$1749, DW_AT_type(*$C$DW$T$179)
	.dwattr $C$DW$1749, DW_AT_name("keyOID")
	.dwattr $C$DW$1749, DW_AT_TI_symbol_name("keyOID")
	.dwattr $C$DW$1749, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1749, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1749, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1749, DW_AT_decl_line(0x148)
	.dwattr $C$DW$1749, DW_AT_decl_column(0x0d)
$C$DW$1750	.dwtag  DW_TAG_member
	.dwattr $C$DW$1750, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1750, DW_AT_name("version")
	.dwattr $C$DW$1750, DW_AT_TI_symbol_name("version")
	.dwattr $C$DW$1750, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1750, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1750, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1750, DW_AT_decl_line(0x149)
	.dwattr $C$DW$1750, DW_AT_decl_column(0x0d)
$C$DW$1751	.dwtag  DW_TAG_member
	.dwattr $C$DW$1751, DW_AT_type(*$C$DW$T$176)
	.dwattr $C$DW$1751, DW_AT_name("altNames")
	.dwattr $C$DW$1751, DW_AT_TI_symbol_name("altNames")
	.dwattr $C$DW$1751, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$1751, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1751, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1751, DW_AT_decl_line(0x14a)
	.dwattr $C$DW$1751, DW_AT_decl_column(0x10)
$C$DW$1752	.dwtag  DW_TAG_member
	.dwattr $C$DW$1752, DW_AT_type(*$C$DW$T$176)
	.dwattr $C$DW$1752, DW_AT_name("altEmailNames")
	.dwattr $C$DW$1752, DW_AT_TI_symbol_name("altEmailNames")
	.dwattr $C$DW$1752, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$1752, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1752, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1752, DW_AT_decl_line(0x14c)
	.dwattr $C$DW$1752, DW_AT_decl_column(0x10)
$C$DW$1753	.dwtag  DW_TAG_member
	.dwattr $C$DW$1753, DW_AT_type(*$C$DW$T$172)
	.dwattr $C$DW$1753, DW_AT_name("permittedNames")
	.dwattr $C$DW$1753, DW_AT_TI_symbol_name("permittedNames")
	.dwattr $C$DW$1753, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$1753, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1753, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1753, DW_AT_decl_line(0x14d)
	.dwattr $C$DW$1753, DW_AT_decl_column(0x11)
$C$DW$1754	.dwtag  DW_TAG_member
	.dwattr $C$DW$1754, DW_AT_type(*$C$DW$T$172)
	.dwattr $C$DW$1754, DW_AT_name("excludedNames")
	.dwattr $C$DW$1754, DW_AT_TI_symbol_name("excludedNames")
	.dwattr $C$DW$1754, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$1754, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1754, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1754, DW_AT_decl_line(0x14e)
	.dwattr $C$DW$1754, DW_AT_decl_column(0x11)
$C$DW$1755	.dwtag  DW_TAG_member
	.dwattr $C$DW$1755, DW_AT_type(*$C$DW$T$180)
	.dwattr $C$DW$1755, DW_AT_name("subjectHash")
	.dwattr $C$DW$1755, DW_AT_TI_symbol_name("subjectHash")
	.dwattr $C$DW$1755, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$1755, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1755, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1755, DW_AT_decl_line(0x150)
	.dwattr $C$DW$1755, DW_AT_decl_column(0x0d)
$C$DW$1756	.dwtag  DW_TAG_member
	.dwattr $C$DW$1756, DW_AT_type(*$C$DW$T$180)
	.dwattr $C$DW$1756, DW_AT_name("issuerHash")
	.dwattr $C$DW$1756, DW_AT_TI_symbol_name("issuerHash")
	.dwattr $C$DW$1756, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$1756, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1756, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1756, DW_AT_decl_line(0x151)
	.dwattr $C$DW$1756, DW_AT_decl_column(0x0d)
$C$DW$1757	.dwtag  DW_TAG_member
	.dwattr $C$DW$1757, DW_AT_type(*$C$DW$T$178)
	.dwattr $C$DW$1757, DW_AT_name("signature")
	.dwattr $C$DW$1757, DW_AT_TI_symbol_name("signature")
	.dwattr $C$DW$1757, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
	.dwattr $C$DW$1757, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1757, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1757, DW_AT_decl_line(0x155)
	.dwattr $C$DW$1757, DW_AT_decl_column(0x0d)
$C$DW$1758	.dwtag  DW_TAG_member
	.dwattr $C$DW$1758, DW_AT_type(*$C$DW$T$173)
	.dwattr $C$DW$1758, DW_AT_name("subjectCN")
	.dwattr $C$DW$1758, DW_AT_TI_symbol_name("subjectCN")
	.dwattr $C$DW$1758, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
	.dwattr $C$DW$1758, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1758, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1758, DW_AT_decl_line(0x156)
	.dwattr $C$DW$1758, DW_AT_decl_column(0x0d)
$C$DW$1759	.dwtag  DW_TAG_member
	.dwattr $C$DW$1759, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1759, DW_AT_name("subjectCNLen")
	.dwattr $C$DW$1759, DW_AT_TI_symbol_name("subjectCNLen")
	.dwattr $C$DW$1759, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
	.dwattr $C$DW$1759, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1759, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1759, DW_AT_decl_line(0x157)
	.dwattr $C$DW$1759, DW_AT_decl_column(0x0d)
$C$DW$1760	.dwtag  DW_TAG_member
	.dwattr $C$DW$1760, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$1760, DW_AT_name("subjectCNEnc")
	.dwattr $C$DW$1760, DW_AT_TI_symbol_name("subjectCNEnc")
	.dwattr $C$DW$1760, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
	.dwattr $C$DW$1760, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1760, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1760, DW_AT_decl_line(0x158)
	.dwattr $C$DW$1760, DW_AT_decl_column(0x0d)
$C$DW$1761	.dwtag  DW_TAG_member
	.dwattr $C$DW$1761, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1761, DW_AT_name("subjectCNStored")
	.dwattr $C$DW$1761, DW_AT_TI_symbol_name("subjectCNStored")
	.dwattr $C$DW$1761, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
	.dwattr $C$DW$1761, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1761, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1761, DW_AT_decl_line(0x159)
	.dwattr $C$DW$1761, DW_AT_decl_column(0x0d)
$C$DW$1762	.dwtag  DW_TAG_member
	.dwattr $C$DW$1762, DW_AT_type(*$C$DW$T$181)
	.dwattr $C$DW$1762, DW_AT_name("issuer")
	.dwattr $C$DW$1762, DW_AT_TI_symbol_name("issuer")
	.dwattr $C$DW$1762, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
	.dwattr $C$DW$1762, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1762, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1762, DW_AT_decl_line(0x15a)
	.dwattr $C$DW$1762, DW_AT_decl_column(0x0d)
$C$DW$1763	.dwtag  DW_TAG_member
	.dwattr $C$DW$1763, DW_AT_type(*$C$DW$T$181)
	.dwattr $C$DW$1763, DW_AT_name("subject")
	.dwattr $C$DW$1763, DW_AT_TI_symbol_name("subject")
	.dwattr $C$DW$1763, DW_AT_data_member_location[DW_OP_plus_uconst 0x170]
	.dwattr $C$DW$1763, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1763, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1763, DW_AT_decl_line(0x15b)
	.dwattr $C$DW$1763, DW_AT_decl_column(0x0d)
$C$DW$1764	.dwtag  DW_TAG_member
	.dwattr $C$DW$1764, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1764, DW_AT_name("verify")
	.dwattr $C$DW$1764, DW_AT_TI_symbol_name("verify")
	.dwattr $C$DW$1764, DW_AT_data_member_location[DW_OP_plus_uconst 0x270]
	.dwattr $C$DW$1764, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1764, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1764, DW_AT_decl_line(0x15c)
	.dwattr $C$DW$1764, DW_AT_decl_column(0x0d)
$C$DW$1765	.dwtag  DW_TAG_member
	.dwattr $C$DW$1765, DW_AT_type(*$C$DW$T$178)
	.dwattr $C$DW$1765, DW_AT_name("source")
	.dwattr $C$DW$1765, DW_AT_TI_symbol_name("source")
	.dwattr $C$DW$1765, DW_AT_data_member_location[DW_OP_plus_uconst 0x274]
	.dwattr $C$DW$1765, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1765, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1765, DW_AT_decl_line(0x15d)
	.dwattr $C$DW$1765, DW_AT_decl_column(0x0d)
$C$DW$1766	.dwtag  DW_TAG_member
	.dwattr $C$DW$1766, DW_AT_type(*$C$DW$T$179)
	.dwattr $C$DW$1766, DW_AT_name("srcIdx")
	.dwattr $C$DW$1766, DW_AT_TI_symbol_name("srcIdx")
	.dwattr $C$DW$1766, DW_AT_data_member_location[DW_OP_plus_uconst 0x278]
	.dwattr $C$DW$1766, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1766, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1766, DW_AT_decl_line(0x15e)
	.dwattr $C$DW$1766, DW_AT_decl_column(0x0d)
$C$DW$1767	.dwtag  DW_TAG_member
	.dwattr $C$DW$1767, DW_AT_type(*$C$DW$T$179)
	.dwattr $C$DW$1767, DW_AT_name("maxIdx")
	.dwattr $C$DW$1767, DW_AT_TI_symbol_name("maxIdx")
	.dwattr $C$DW$1767, DW_AT_data_member_location[DW_OP_plus_uconst 0x27c]
	.dwattr $C$DW$1767, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1767, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1767, DW_AT_decl_line(0x15f)
	.dwattr $C$DW$1767, DW_AT_decl_column(0x0d)
$C$DW$1768	.dwtag  DW_TAG_member
	.dwattr $C$DW$1768, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$1768, DW_AT_name("heap")
	.dwattr $C$DW$1768, DW_AT_TI_symbol_name("heap")
	.dwattr $C$DW$1768, DW_AT_data_member_location[DW_OP_plus_uconst 0x280]
	.dwattr $C$DW$1768, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1768, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1768, DW_AT_decl_line(0x160)
	.dwattr $C$DW$1768, DW_AT_decl_column(0x0d)
$C$DW$1769	.dwtag  DW_TAG_member
	.dwattr $C$DW$1769, DW_AT_type(*$C$DW$T$182)
	.dwattr $C$DW$1769, DW_AT_name("serial")
	.dwattr $C$DW$1769, DW_AT_TI_symbol_name("serial")
	.dwattr $C$DW$1769, DW_AT_data_member_location[DW_OP_plus_uconst 0x284]
	.dwattr $C$DW$1769, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1769, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1769, DW_AT_decl_line(0x161)
	.dwattr $C$DW$1769, DW_AT_decl_column(0x0d)
$C$DW$1770	.dwtag  DW_TAG_member
	.dwattr $C$DW$1770, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1770, DW_AT_name("serialSz")
	.dwattr $C$DW$1770, DW_AT_TI_symbol_name("serialSz")
	.dwattr $C$DW$1770, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a4]
	.dwattr $C$DW$1770, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1770, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1770, DW_AT_decl_line(0x162)
	.dwattr $C$DW$1770, DW_AT_decl_column(0x0d)
$C$DW$1771	.dwtag  DW_TAG_member
	.dwattr $C$DW$1771, DW_AT_type(*$C$DW$T$178)
	.dwattr $C$DW$1771, DW_AT_name("extensions")
	.dwattr $C$DW$1771, DW_AT_TI_symbol_name("extensions")
	.dwattr $C$DW$1771, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a8]
	.dwattr $C$DW$1771, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1771, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1771, DW_AT_decl_line(0x163)
	.dwattr $C$DW$1771, DW_AT_decl_column(0x0d)
$C$DW$1772	.dwtag  DW_TAG_member
	.dwattr $C$DW$1772, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1772, DW_AT_name("extensionsSz")
	.dwattr $C$DW$1772, DW_AT_TI_symbol_name("extensionsSz")
	.dwattr $C$DW$1772, DW_AT_data_member_location[DW_OP_plus_uconst 0x2ac]
	.dwattr $C$DW$1772, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1772, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1772, DW_AT_decl_line(0x164)
	.dwattr $C$DW$1772, DW_AT_decl_column(0x0d)
$C$DW$1773	.dwtag  DW_TAG_member
	.dwattr $C$DW$1773, DW_AT_type(*$C$DW$T$179)
	.dwattr $C$DW$1773, DW_AT_name("extensionsIdx")
	.dwattr $C$DW$1773, DW_AT_TI_symbol_name("extensionsIdx")
	.dwattr $C$DW$1773, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b0]
	.dwattr $C$DW$1773, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1773, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1773, DW_AT_decl_line(0x165)
	.dwattr $C$DW$1773, DW_AT_decl_column(0x0d)
$C$DW$1774	.dwtag  DW_TAG_member
	.dwattr $C$DW$1774, DW_AT_type(*$C$DW$T$178)
	.dwattr $C$DW$1774, DW_AT_name("extAuthInfo")
	.dwattr $C$DW$1774, DW_AT_TI_symbol_name("extAuthInfo")
	.dwattr $C$DW$1774, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b4]
	.dwattr $C$DW$1774, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1774, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1774, DW_AT_decl_line(0x166)
	.dwattr $C$DW$1774, DW_AT_decl_column(0x0d)
$C$DW$1775	.dwtag  DW_TAG_member
	.dwattr $C$DW$1775, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1775, DW_AT_name("extAuthInfoSz")
	.dwattr $C$DW$1775, DW_AT_TI_symbol_name("extAuthInfoSz")
	.dwattr $C$DW$1775, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b8]
	.dwattr $C$DW$1775, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1775, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1775, DW_AT_decl_line(0x167)
	.dwattr $C$DW$1775, DW_AT_decl_column(0x0d)
$C$DW$1776	.dwtag  DW_TAG_member
	.dwattr $C$DW$1776, DW_AT_type(*$C$DW$T$178)
	.dwattr $C$DW$1776, DW_AT_name("extCrlInfo")
	.dwattr $C$DW$1776, DW_AT_TI_symbol_name("extCrlInfo")
	.dwattr $C$DW$1776, DW_AT_data_member_location[DW_OP_plus_uconst 0x2bc]
	.dwattr $C$DW$1776, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1776, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1776, DW_AT_decl_line(0x168)
	.dwattr $C$DW$1776, DW_AT_decl_column(0x0d)
$C$DW$1777	.dwtag  DW_TAG_member
	.dwattr $C$DW$1777, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1777, DW_AT_name("extCrlInfoSz")
	.dwattr $C$DW$1777, DW_AT_TI_symbol_name("extCrlInfoSz")
	.dwattr $C$DW$1777, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c0]
	.dwattr $C$DW$1777, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1777, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1777, DW_AT_decl_line(0x169)
	.dwattr $C$DW$1777, DW_AT_decl_column(0x0d)
$C$DW$1778	.dwtag  DW_TAG_member
	.dwattr $C$DW$1778, DW_AT_type(*$C$DW$T$180)
	.dwattr $C$DW$1778, DW_AT_name("extSubjKeyId")
	.dwattr $C$DW$1778, DW_AT_TI_symbol_name("extSubjKeyId")
	.dwattr $C$DW$1778, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c4]
	.dwattr $C$DW$1778, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1778, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1778, DW_AT_decl_line(0x16a)
	.dwattr $C$DW$1778, DW_AT_decl_column(0x0d)
$C$DW$1779	.dwtag  DW_TAG_member
	.dwattr $C$DW$1779, DW_AT_type(*$C$DW$T$168)
	.dwattr $C$DW$1779, DW_AT_name("extSubjKeyIdSet")
	.dwattr $C$DW$1779, DW_AT_TI_symbol_name("extSubjKeyIdSet")
	.dwattr $C$DW$1779, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d8]
	.dwattr $C$DW$1779, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1779, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1779, DW_AT_decl_line(0x16b)
	.dwattr $C$DW$1779, DW_AT_decl_column(0x0d)
$C$DW$1780	.dwtag  DW_TAG_member
	.dwattr $C$DW$1780, DW_AT_type(*$C$DW$T$180)
	.dwattr $C$DW$1780, DW_AT_name("extAuthKeyId")
	.dwattr $C$DW$1780, DW_AT_TI_symbol_name("extAuthKeyId")
	.dwattr $C$DW$1780, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d9]
	.dwattr $C$DW$1780, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1780, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1780, DW_AT_decl_line(0x16c)
	.dwattr $C$DW$1780, DW_AT_decl_column(0x0d)
$C$DW$1781	.dwtag  DW_TAG_member
	.dwattr $C$DW$1781, DW_AT_type(*$C$DW$T$168)
	.dwattr $C$DW$1781, DW_AT_name("extAuthKeyIdSet")
	.dwattr $C$DW$1781, DW_AT_TI_symbol_name("extAuthKeyIdSet")
	.dwattr $C$DW$1781, DW_AT_data_member_location[DW_OP_plus_uconst 0x2ed]
	.dwattr $C$DW$1781, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1781, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1781, DW_AT_decl_line(0x16d)
	.dwattr $C$DW$1781, DW_AT_decl_column(0x0d)
$C$DW$1782	.dwtag  DW_TAG_member
	.dwattr $C$DW$1782, DW_AT_type(*$C$DW$T$168)
	.dwattr $C$DW$1782, DW_AT_name("extNameConstraintSet")
	.dwattr $C$DW$1782, DW_AT_TI_symbol_name("extNameConstraintSet")
	.dwattr $C$DW$1782, DW_AT_data_member_location[DW_OP_plus_uconst 0x2ee]
	.dwattr $C$DW$1782, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1782, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1782, DW_AT_decl_line(0x16f)
	.dwattr $C$DW$1782, DW_AT_decl_column(0x0d)
$C$DW$1783	.dwtag  DW_TAG_member
	.dwattr $C$DW$1783, DW_AT_type(*$C$DW$T$168)
	.dwattr $C$DW$1783, DW_AT_name("isCA")
	.dwattr $C$DW$1783, DW_AT_TI_symbol_name("isCA")
	.dwattr $C$DW$1783, DW_AT_data_member_location[DW_OP_plus_uconst 0x2ef]
	.dwattr $C$DW$1783, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1783, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1783, DW_AT_decl_line(0x171)
	.dwattr $C$DW$1783, DW_AT_decl_column(0x0d)
$C$DW$1784	.dwtag  DW_TAG_member
	.dwattr $C$DW$1784, DW_AT_type(*$C$DW$T$168)
	.dwattr $C$DW$1784, DW_AT_name("extKeyUsageSet")
	.dwattr $C$DW$1784, DW_AT_TI_symbol_name("extKeyUsageSet")
	.dwattr $C$DW$1784, DW_AT_data_member_location[DW_OP_plus_uconst 0x2f0]
	.dwattr $C$DW$1784, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1784, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1784, DW_AT_decl_line(0x172)
	.dwattr $C$DW$1784, DW_AT_decl_column(0x0d)
$C$DW$1785	.dwtag  DW_TAG_member
	.dwattr $C$DW$1785, DW_AT_type(*$C$DW$T$183)
	.dwattr $C$DW$1785, DW_AT_name("extKeyUsage")
	.dwattr $C$DW$1785, DW_AT_TI_symbol_name("extKeyUsage")
	.dwattr $C$DW$1785, DW_AT_data_member_location[DW_OP_plus_uconst 0x2f2]
	.dwattr $C$DW$1785, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1785, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1785, DW_AT_decl_line(0x173)
	.dwattr $C$DW$1785, DW_AT_decl_column(0x0d)
$C$DW$1786	.dwtag  DW_TAG_member
	.dwattr $C$DW$1786, DW_AT_type(*$C$DW$T$168)
	.dwattr $C$DW$1786, DW_AT_name("extExtKeyUsageSet")
	.dwattr $C$DW$1786, DW_AT_TI_symbol_name("extExtKeyUsageSet")
	.dwattr $C$DW$1786, DW_AT_data_member_location[DW_OP_plus_uconst 0x2f4]
	.dwattr $C$DW$1786, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1786, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1786, DW_AT_decl_line(0x174)
	.dwattr $C$DW$1786, DW_AT_decl_column(0x0d)
$C$DW$1787	.dwtag  DW_TAG_member
	.dwattr $C$DW$1787, DW_AT_type(*$C$DW$T$168)
	.dwattr $C$DW$1787, DW_AT_name("extExtKeyUsage")
	.dwattr $C$DW$1787, DW_AT_TI_symbol_name("extExtKeyUsage")
	.dwattr $C$DW$1787, DW_AT_data_member_location[DW_OP_plus_uconst 0x2f5]
	.dwattr $C$DW$1787, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1787, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1787, DW_AT_decl_line(0x175)
	.dwattr $C$DW$1787, DW_AT_decl_column(0x0d)
$C$DW$1788	.dwtag  DW_TAG_member
	.dwattr $C$DW$1788, DW_AT_type(*$C$DW$T$179)
	.dwattr $C$DW$1788, DW_AT_name("pkCurveOID")
	.dwattr $C$DW$1788, DW_AT_TI_symbol_name("pkCurveOID")
	.dwattr $C$DW$1788, DW_AT_data_member_location[DW_OP_plus_uconst 0x2f8]
	.dwattr $C$DW$1788, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1788, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1788, DW_AT_decl_line(0x18d)
	.dwattr $C$DW$1788, DW_AT_decl_column(0x0d)
$C$DW$1789	.dwtag  DW_TAG_member
	.dwattr $C$DW$1789, DW_AT_type(*$C$DW$T$178)
	.dwattr $C$DW$1789, DW_AT_name("beforeDate")
	.dwattr $C$DW$1789, DW_AT_TI_symbol_name("beforeDate")
	.dwattr $C$DW$1789, DW_AT_data_member_location[DW_OP_plus_uconst 0x2fc]
	.dwattr $C$DW$1789, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1789, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1789, DW_AT_decl_line(0x18f)
	.dwattr $C$DW$1789, DW_AT_decl_column(0x0d)
$C$DW$1790	.dwtag  DW_TAG_member
	.dwattr $C$DW$1790, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1790, DW_AT_name("beforeDateLen")
	.dwattr $C$DW$1790, DW_AT_TI_symbol_name("beforeDateLen")
	.dwattr $C$DW$1790, DW_AT_data_member_location[DW_OP_plus_uconst 0x300]
	.dwattr $C$DW$1790, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1790, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1790, DW_AT_decl_line(0x190)
	.dwattr $C$DW$1790, DW_AT_decl_column(0x0d)
$C$DW$1791	.dwtag  DW_TAG_member
	.dwattr $C$DW$1791, DW_AT_type(*$C$DW$T$178)
	.dwattr $C$DW$1791, DW_AT_name("afterDate")
	.dwattr $C$DW$1791, DW_AT_TI_symbol_name("afterDate")
	.dwattr $C$DW$1791, DW_AT_data_member_location[DW_OP_plus_uconst 0x304]
	.dwattr $C$DW$1791, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1791, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1791, DW_AT_decl_line(0x191)
	.dwattr $C$DW$1791, DW_AT_decl_column(0x0d)
$C$DW$1792	.dwtag  DW_TAG_member
	.dwattr $C$DW$1792, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1792, DW_AT_name("afterDateLen")
	.dwattr $C$DW$1792, DW_AT_TI_symbol_name("afterDateLen")
	.dwattr $C$DW$1792, DW_AT_data_member_location[DW_OP_plus_uconst 0x308]
	.dwattr $C$DW$1792, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1792, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1792, DW_AT_decl_line(0x192)
	.dwattr $C$DW$1792, DW_AT_decl_column(0x0d)
$C$DW$1793	.dwtag  DW_TAG_member
	.dwattr $C$DW$1793, DW_AT_type(*$C$DW$T$178)
	.dwattr $C$DW$1793, DW_AT_name("subjectRaw")
	.dwattr $C$DW$1793, DW_AT_TI_symbol_name("subjectRaw")
	.dwattr $C$DW$1793, DW_AT_data_member_location[DW_OP_plus_uconst 0x30c]
	.dwattr $C$DW$1793, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1793, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1793, DW_AT_decl_line(0x198)
	.dwattr $C$DW$1793, DW_AT_decl_column(0x0d)
$C$DW$1794	.dwtag  DW_TAG_member
	.dwattr $C$DW$1794, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1794, DW_AT_name("subjectRawLen")
	.dwattr $C$DW$1794, DW_AT_TI_symbol_name("subjectRawLen")
	.dwattr $C$DW$1794, DW_AT_data_member_location[DW_OP_plus_uconst 0x310]
	.dwattr $C$DW$1794, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1794, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1794, DW_AT_decl_line(0x199)
	.dwattr $C$DW$1794, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$184

	.dwattr $C$DW$T$184, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$T$184, DW_AT_decl_line(0x140)
	.dwattr $C$DW$T$184, DW_AT_decl_column(0x08)
$C$DW$T$626	.dwtag  DW_TAG_typedef, DW_AT_name("DecodedCert")
	.dwattr $C$DW$T$626, DW_AT_type(*$C$DW$T$184)
	.dwattr $C$DW$T$626, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$626, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$T$626, DW_AT_decl_line(0x13b)
	.dwattr $C$DW$T$626, DW_AT_decl_column(0x1c)
$C$DW$T$627	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$627, DW_AT_type(*$C$DW$T$626)
	.dwattr $C$DW$T$627, DW_AT_address_class(0x20)
$C$DW$T$628	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$628, DW_AT_type(*$C$DW$T$627)

$C$DW$T$185	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$185, DW_AT_name("DecodedName")
	.dwattr $C$DW$T$185, DW_AT_byte_size(0x5c)
$C$DW$1795	.dwtag  DW_TAG_member
	.dwattr $C$DW$1795, DW_AT_type(*$C$DW$T$173)
	.dwattr $C$DW$1795, DW_AT_name("fullName")
	.dwattr $C$DW$1795, DW_AT_TI_symbol_name("fullName")
	.dwattr $C$DW$1795, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1795, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1795, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1795, DW_AT_decl_line(0x121)
	.dwattr $C$DW$1795, DW_AT_decl_column(0x0d)
$C$DW$1796	.dwtag  DW_TAG_member
	.dwattr $C$DW$1796, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1796, DW_AT_name("fullNameLen")
	.dwattr $C$DW$1796, DW_AT_TI_symbol_name("fullNameLen")
	.dwattr $C$DW$1796, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1796, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1796, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1796, DW_AT_decl_line(0x122)
	.dwattr $C$DW$1796, DW_AT_decl_column(0x0d)
$C$DW$1797	.dwtag  DW_TAG_member
	.dwattr $C$DW$1797, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1797, DW_AT_name("entryCount")
	.dwattr $C$DW$1797, DW_AT_TI_symbol_name("entryCount")
	.dwattr $C$DW$1797, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1797, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1797, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1797, DW_AT_decl_line(0x123)
	.dwattr $C$DW$1797, DW_AT_decl_column(0x0d)
$C$DW$1798	.dwtag  DW_TAG_member
	.dwattr $C$DW$1798, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1798, DW_AT_name("cnIdx")
	.dwattr $C$DW$1798, DW_AT_TI_symbol_name("cnIdx")
	.dwattr $C$DW$1798, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1798, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1798, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1798, DW_AT_decl_line(0x124)
	.dwattr $C$DW$1798, DW_AT_decl_column(0x0d)
$C$DW$1799	.dwtag  DW_TAG_member
	.dwattr $C$DW$1799, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1799, DW_AT_name("cnLen")
	.dwattr $C$DW$1799, DW_AT_TI_symbol_name("cnLen")
	.dwattr $C$DW$1799, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1799, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1799, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1799, DW_AT_decl_line(0x125)
	.dwattr $C$DW$1799, DW_AT_decl_column(0x0d)
$C$DW$1800	.dwtag  DW_TAG_member
	.dwattr $C$DW$1800, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1800, DW_AT_name("snIdx")
	.dwattr $C$DW$1800, DW_AT_TI_symbol_name("snIdx")
	.dwattr $C$DW$1800, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1800, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1800, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1800, DW_AT_decl_line(0x126)
	.dwattr $C$DW$1800, DW_AT_decl_column(0x0d)
$C$DW$1801	.dwtag  DW_TAG_member
	.dwattr $C$DW$1801, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1801, DW_AT_name("snLen")
	.dwattr $C$DW$1801, DW_AT_TI_symbol_name("snLen")
	.dwattr $C$DW$1801, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1801, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1801, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1801, DW_AT_decl_line(0x127)
	.dwattr $C$DW$1801, DW_AT_decl_column(0x0d)
$C$DW$1802	.dwtag  DW_TAG_member
	.dwattr $C$DW$1802, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1802, DW_AT_name("cIdx")
	.dwattr $C$DW$1802, DW_AT_TI_symbol_name("cIdx")
	.dwattr $C$DW$1802, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1802, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1802, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1802, DW_AT_decl_line(0x128)
	.dwattr $C$DW$1802, DW_AT_decl_column(0x0d)
$C$DW$1803	.dwtag  DW_TAG_member
	.dwattr $C$DW$1803, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1803, DW_AT_name("cLen")
	.dwattr $C$DW$1803, DW_AT_TI_symbol_name("cLen")
	.dwattr $C$DW$1803, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1803, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1803, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1803, DW_AT_decl_line(0x129)
	.dwattr $C$DW$1803, DW_AT_decl_column(0x0d)
$C$DW$1804	.dwtag  DW_TAG_member
	.dwattr $C$DW$1804, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1804, DW_AT_name("lIdx")
	.dwattr $C$DW$1804, DW_AT_TI_symbol_name("lIdx")
	.dwattr $C$DW$1804, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$1804, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1804, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1804, DW_AT_decl_line(0x12a)
	.dwattr $C$DW$1804, DW_AT_decl_column(0x0d)
$C$DW$1805	.dwtag  DW_TAG_member
	.dwattr $C$DW$1805, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1805, DW_AT_name("lLen")
	.dwattr $C$DW$1805, DW_AT_TI_symbol_name("lLen")
	.dwattr $C$DW$1805, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$1805, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1805, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1805, DW_AT_decl_line(0x12b)
	.dwattr $C$DW$1805, DW_AT_decl_column(0x0d)
$C$DW$1806	.dwtag  DW_TAG_member
	.dwattr $C$DW$1806, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1806, DW_AT_name("stIdx")
	.dwattr $C$DW$1806, DW_AT_TI_symbol_name("stIdx")
	.dwattr $C$DW$1806, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$1806, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1806, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1806, DW_AT_decl_line(0x12c)
	.dwattr $C$DW$1806, DW_AT_decl_column(0x0d)
$C$DW$1807	.dwtag  DW_TAG_member
	.dwattr $C$DW$1807, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1807, DW_AT_name("stLen")
	.dwattr $C$DW$1807, DW_AT_TI_symbol_name("stLen")
	.dwattr $C$DW$1807, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$1807, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1807, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1807, DW_AT_decl_line(0x12d)
	.dwattr $C$DW$1807, DW_AT_decl_column(0x0d)
$C$DW$1808	.dwtag  DW_TAG_member
	.dwattr $C$DW$1808, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1808, DW_AT_name("oIdx")
	.dwattr $C$DW$1808, DW_AT_TI_symbol_name("oIdx")
	.dwattr $C$DW$1808, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$1808, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1808, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1808, DW_AT_decl_line(0x12e)
	.dwattr $C$DW$1808, DW_AT_decl_column(0x0d)
$C$DW$1809	.dwtag  DW_TAG_member
	.dwattr $C$DW$1809, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1809, DW_AT_name("oLen")
	.dwattr $C$DW$1809, DW_AT_TI_symbol_name("oLen")
	.dwattr $C$DW$1809, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$1809, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1809, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1809, DW_AT_decl_line(0x12f)
	.dwattr $C$DW$1809, DW_AT_decl_column(0x0d)
$C$DW$1810	.dwtag  DW_TAG_member
	.dwattr $C$DW$1810, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1810, DW_AT_name("ouIdx")
	.dwattr $C$DW$1810, DW_AT_TI_symbol_name("ouIdx")
	.dwattr $C$DW$1810, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$1810, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1810, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1810, DW_AT_decl_line(0x130)
	.dwattr $C$DW$1810, DW_AT_decl_column(0x0d)
$C$DW$1811	.dwtag  DW_TAG_member
	.dwattr $C$DW$1811, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1811, DW_AT_name("ouLen")
	.dwattr $C$DW$1811, DW_AT_TI_symbol_name("ouLen")
	.dwattr $C$DW$1811, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$1811, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1811, DW_AT_decl_file("C:/wolfssl/wolfssl/ctaocrypt/asn.h")
	.dwattr $C$DW$1811, DW_AT_decl_line(0x131)
	.dwattr $C$DW$1811, DW_AT_decl_column(0x0d)
$C$DW$1812	.dwtag  DW_TAG_member
