;******************************************************************************
;* TI ARM C/C++ Codegen                                             PC v5.1.6 *
;* Date/Time created: Wed Aug 13 10:20:05 2014                                *
;******************************************************************************
	.compiler_opts --abi=eabi --arm_vmrs_si_workaround=on --code_state=16 --diag_wrap=off --disable_dual_state --embedded_constants=on --endian=little --float_support=FPv4SPD16 --hll_source=on --object_format=elf --silicon_version=7M4 --symdebug:dwarf --symdebug:dwarf_version=3 --unaligned_access=on 
	.thumb

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("C:/cyassl/ctaocrypt/src/ecc.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v5.1.6 Copyright (c) 1996-2014 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\khimes\workspace_v6_0\cyassl_tirtos_benchmark\Debug")

$C$DW$1	.dwtag  DW_TAG_subprogram, DW_AT_name("memcpy")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("memcpy")
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("c:/ti/ccsv6/tools/compiler/arm_5.1.6/include/string.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0x5e)
	.dwattr $C$DW$1, DW_AT_decl_column(0x16)
$C$DW$2	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$2, DW_AT_type(*$C$DW$T$3)

	.dwattr $C$DW$899, DW_AT_decl_column(0x05)
$C$DW$900	.dwtag  DW_TAG_enumerator, DW_AT_name("CAVIUM_INIT_E"), DW_AT_const_value(-182)
	.dwattr $C$DW$900, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/error-crypt.h")
	.dwattr $C$DW$900, DW_AT_decl_line(0x69)
	.dwattr $C$DW$900, DW_AT_decl_column(0x05)
$C$DW$901	.dwtag  DW_TAG_enumerator, DW_AT_name("COMPRESS_INIT_E"), DW_AT_const_value(-183)
	.dwattr $C$DW$901, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/error-crypt.h")
	.dwattr $C$DW$901, DW_AT_decl_line(0x6b)
	.dwattr $C$DW$901, DW_AT_decl_column(0x05)
$C$DW$902	.dwtag  DW_TAG_enumerator, DW_AT_name("COMPRESS_E"), DW_AT_const_value(-184)
	.dwattr $C$DW$902, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/error-crypt.h")
	.dwattr $C$DW$902, DW_AT_decl_line(0x6c)
	.dwattr $C$DW$902, DW_AT_decl_column(0x05)
$C$DW$903	.dwtag  DW_TAG_enumerator, DW_AT_name("DECOMPRESS_INIT_E"), DW_AT_const_value(-185)
	.dwattr $C$DW$903, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/error-crypt.h")
	.dwattr $C$DW$903, DW_AT_decl_line(0x6d)
	.dwattr $C$DW$903, DW_AT_decl_column(0x05)
$C$DW$904	.dwtag  DW_TAG_enumerator, DW_AT_name("DECOMPRESS_E"), DW_AT_const_value(-186)
	.dwattr $C$DW$904, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/error-crypt.h")
	.dwattr $C$DW$904, DW_AT_decl_line(0x6e)
	.dwattr $C$DW$904, DW_AT_decl_column(0x05)
$C$DW$905	.dwtag  DW_TAG_enumerator, DW_AT_name("BAD_ALIGN_E"), DW_AT_const_value(-187)
	.dwattr $C$DW$905, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/error-crypt.h")
	.dwattr $C$DW$905, DW_AT_decl_line(0x70)
	.dwattr $C$DW$905, DW_AT_decl_column(0x05)
$C$DW$906	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_NO_SIGNER_E"), DW_AT_const_value(-188)
	.dwattr $C$DW$906, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/error-crypt.h")
	.dwattr $C$DW$906, DW_AT_decl_line(0x71)
	.dwattr $C$DW$906, DW_AT_decl_column(0x05)
$C$DW$907	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_CRL_CONFIRM_E"), DW_AT_const_value(-189)
	.dwattr $C$DW$907, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/error-crypt.h")
	.dwattr $C$DW$907, DW_AT_decl_line(0x72)
	.dwattr $C$DW$907, DW_AT_decl_column(0x05)
$C$DW$908	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_CRL_NO_SIGNER_E"), DW_AT_const_value(-190)
	.dwattr $C$DW$908, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/error-crypt.h")
	.dwattr $C$DW$908, DW_AT_decl_line(0x73)
	.dwattr $C$DW$908, DW_AT_decl_column(0x05)
$C$DW$909	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_OCSP_CONFIRM_E"), DW_AT_const_value(-191)
	.dwattr $C$DW$909, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/error-crypt.h")
	.dwattr $C$DW$909, DW_AT_decl_line(0x74)
	.dwattr $C$DW$909, DW_AT_decl_column(0x05)
$C$DW$910	.dwtag  DW_TAG_enumerator, DW_AT_name("BAD_ENC_STATE_E"), DW_AT_const_value(-192)
	.dwattr $C$DW$910, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/error-crypt.h")
	.dwattr $C$DW$910, DW_AT_decl_line(0x76)
	.dwattr $C$DW$910, DW_AT_decl_column(0x05)
$C$DW$911	.dwtag  DW_TAG_enumerator, DW_AT_name("BAD_PADDING_E"), DW_AT_const_value(-193)
	.dwattr $C$DW$911, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/error-crypt.h")
	.dwattr $C$DW$911, DW_AT_decl_line(0x77)
	.dwattr $C$DW$911, DW_AT_decl_column(0x05)
$C$DW$912	.dwtag  DW_TAG_enumerator, DW_AT_name("REQ_ATTRIBUTE_E"), DW_AT_const_value(-194)
	.dwattr $C$DW$912, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/error-crypt.h")
	.dwattr $C$DW$912, DW_AT_decl_line(0x79)
	.dwattr $C$DW$912, DW_AT_decl_column(0x05)
$C$DW$913	.dwtag  DW_TAG_enumerator, DW_AT_name("PKCS7_OID_E"), DW_AT_const_value(-195)
	.dwattr $C$DW$913, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/error-crypt.h")
	.dwattr $C$DW$913, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$913, DW_AT_decl_column(0x05)
$C$DW$914	.dwtag  DW_TAG_enumerator, DW_AT_name("PKCS7_RECIP_E"), DW_AT_const_value(-196)
	.dwattr $C$DW$914, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/error-crypt.h")
	.dwattr $C$DW$914, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$914, DW_AT_decl_column(0x05)
$C$DW$915	.dwtag  DW_TAG_enumerator, DW_AT_name("FIPS_NOT_ALLOWED_E"), DW_AT_const_value(-197)
	.dwattr $C$DW$915, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/error-crypt.h")
	.dwattr $C$DW$915, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$915, DW_AT_decl_column(0x05)
$C$DW$916	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_NAME_INVALID_E"), DW_AT_const_value(-198)
	.dwattr $C$DW$916, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/error-crypt.h")
	.dwattr $C$DW$916, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$916, DW_AT_decl_column(0x05)
$C$DW$917	.dwtag  DW_TAG_enumerator, DW_AT_name("RNG_FAILURE_E"), DW_AT_const_value(-199)
	.dwattr $C$DW$917, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/error-crypt.h")
	.dwattr $C$DW$917, DW_AT_decl_line(0x80)
	.dwattr $C$DW$917, DW_AT_decl_column(0x05)
$C$DW$918	.dwtag  DW_TAG_enumerator, DW_AT_name("HMAC_MIN_KEYLEN_E"), DW_AT_const_value(-200)
	.dwattr $C$DW$918, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/error-crypt.h")
	.dwattr $C$DW$918, DW_AT_decl_line(0x81)
	.dwattr $C$DW$918, DW_AT_decl_column(0x05)
$C$DW$919	.dwtag  DW_TAG_enumerator, DW_AT_name("RSA_PAD_E"), DW_AT_const_value(-201)
	.dwattr $C$DW$919, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/error-crypt.h")
	.dwattr $C$DW$919, DW_AT_decl_line(0x82)
	.dwattr $C$DW$919, DW_AT_decl_column(0x05)
$C$DW$920	.dwtag  DW_TAG_enumerator, DW_AT_name("MIN_CODE_E"), DW_AT_const_value(-300)
	.dwattr $C$DW$920, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/error-crypt.h")
	.dwattr $C$DW$920, DW_AT_decl_line(0x84)
	.dwattr $C$DW$920, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$538

	.dwattr $C$DW$T$538, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/error-crypt.h")
	.dwattr $C$DW$T$538, DW_AT_decl_line(0x23)
	.dwattr $C$DW$T$538, DW_AT_decl_column(0x06)

$C$DW$T$126	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$126, DW_AT_byte_size(0x228)
$C$DW$921	.dwtag  DW_TAG_member
	.dwattr $C$DW$921, DW_AT_type(*$C$DW$T$125)
	.dwattr $C$DW$921, DW_AT_name("dp")
	.dwattr $C$DW$921, DW_AT_TI_symbol_name("dp")
	.dwattr $C$DW$921, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$921, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$921, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/tfm.h")
	.dwattr $C$DW$921, DW_AT_decl_line(0x110)
	.dwattr $C$DW$921, DW_AT_decl_column(0x0e)
$C$DW$922	.dwtag  DW_TAG_member
	.dwattr $C$DW$922, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$922, DW_AT_name("used")
	.dwattr $C$DW$922, DW_AT_TI_symbol_name("used")
	.dwattr $C$DW$922, DW_AT_data_member_location[DW_OP_plus_uconst 0x220]
	.dwattr $C$DW$922, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$922, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/tfm.h")
	.dwattr $C$DW$922, DW_AT_decl_line(0x111)
	.dwattr $C$DW$922, DW_AT_decl_column(0x0e)
$C$DW$923	.dwtag  DW_TAG_member
	.dwattr $C$DW$923, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$923, DW_AT_name("sign")
	.dwattr $C$DW$923, DW_AT_TI_symbol_name("sign")
	.dwattr $C$DW$923, DW_AT_data_member_location[DW_OP_plus_uconst 0x224]
	.dwattr $C$DW$923, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$923, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/tfm.h")
	.dwattr $C$DW$923, DW_AT_decl_line(0x112)
	.dwattr $C$DW$923, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$126

	.dwattr $C$DW$T$126, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/tfm.h")
	.dwattr $C$DW$T$126, DW_AT_decl_line(0x10f)
	.dwattr $C$DW$T$126, DW_AT_decl_column(0x10)
$C$DW$T$539	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$539, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$T$539, DW_AT_address_class(0x20)
$C$DW$T$127	.dwtag  DW_TAG_typedef, DW_AT_name("fp_int")
	.dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$T$127, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$127, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/tfm.h")
	.dwattr $C$DW$T$127, DW_AT_decl_line(0x113)
	.dwattr $C$DW$T$127, DW_AT_decl_column(0x03)
$C$DW$T$541	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$541, DW_AT_type(*$C$DW$T$127)
	.dwattr $C$DW$T$541, DW_AT_address_class(0x20)
$C$DW$T$128	.dwtag  DW_TAG_typedef, DW_AT_name("mp_int")
	.dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$127)
	.dwattr $C$DW$T$128, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$128, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/tfm.h")
	.dwattr $C$DW$T$128, DW_AT_decl_line(0x273)
	.dwattr $C$DW$T$128, DW_AT_decl_column(0x14)
$C$DW$T$542	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$542, DW_AT_type(*$C$DW$T$128)
	.dwattr $C$DW$T$542, DW_AT_address_class(0x20)
$C$DW$T$543	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$543, DW_AT_type(*$C$DW$T$542)

$C$DW$T$129	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$129, DW_AT_byte_size(0x678)
$C$DW$924	.dwtag  DW_TAG_member
	.dwattr $C$DW$924, DW_AT_type(*$C$DW$T$128)
	.dwattr $C$DW$924, DW_AT_name("x")
	.dwattr $C$DW$924, DW_AT_TI_symbol_name("x")
	.dwattr $C$DW$924, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$924, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$924, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/ecc.h")
	.dwattr $C$DW$924, DW_AT_decl_line(0x3e)
	.dwattr $C$DW$924, DW_AT_decl_column(0x0c)
$C$DW$925	.dwtag  DW_TAG_member
	.dwattr $C$DW$925, DW_AT_type(*$C$DW$T$128)
	.dwattr $C$DW$925, DW_AT_name("y")
	.dwattr $C$DW$925, DW_AT_TI_symbol_name("y")
	.dwattr $C$DW$925, DW_AT_data_member_location[DW_OP_plus_uconst 0x228]
	.dwattr $C$DW$925, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$925, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/ecc.h")
	.dwattr $C$DW$925, DW_AT_decl_line(0x3f)
	.dwattr $C$DW$925, DW_AT_decl_column(0x0c)
$C$DW$926	.dwtag  DW_TAG_member
	.dwattr $C$DW$926, DW_AT_type(*$C$DW$T$128)
	.dwattr $C$DW$926, DW_AT_name("z")
	.dwattr $C$DW$926, DW_AT_TI_symbol_name("z")
	.dwattr $C$DW$926, DW_AT_data_member_location[DW_OP_plus_uconst 0x450]
	.dwattr $C$DW$926, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$926, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/ecc.h")
	.dwattr $C$DW$926, DW_AT_decl_line(0x40)
	.dwattr $C$DW$926, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$129

	.dwattr $C$DW$T$129, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/ecc.h")
	.dwattr $C$DW$T$129, DW_AT_decl_line(0x3d)
	.dwattr $C$DW$T$129, DW_AT_decl_column(0x10)
$C$DW$T$544	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$544, DW_AT_type(*$C$DW$T$129)
	.dwattr $C$DW$T$544, DW_AT_address_class(0x20)
$C$DW$T$548	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$548, DW_AT_type(*$C$DW$T$544)
	.dwattr $C$DW$T$548, DW_AT_address_class(0x20)
$C$DW$T$137	.dwtag  DW_TAG_typedef, DW_AT_name("ecc_point")
	.dwattr $C$DW$T$137, DW_AT_type(*$C$DW$T$129)
	.dwattr $C$DW$T$137, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$137, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/ecc.h")
	.dwattr $C$DW$T$137, DW_AT_decl_line(0x41)
	.dwattr $C$DW$T$137, DW_AT_decl_column(0x03)
$C$DW$T$550	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$550, DW_AT_type(*$C$DW$T$137)
	.dwattr $C$DW$T$550, DW_AT_address_class(0x20)

$C$DW$T$552	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$552, DW_AT_type(*$C$DW$T$550)
	.dwattr $C$DW$T$552, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$552, DW_AT_byte_size(0x20)
$C$DW$927	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$927, DW_AT_upper_bound(0x07)
	.dwendtag $C$DW$T$552

$C$DW$T$553	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$553, DW_AT_type(*$C$DW$T$550)

$C$DW$T$133	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$133, DW_AT_byte_size(0x1c)
$C$DW$928	.dwtag  DW_TAG_member
	.dwattr $C$DW$928, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$928, DW_AT_name("size")
	.dwattr $C$DW$928, DW_AT_TI_symbol_name("size")
	.dwattr $C$DW$928, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$928, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$928, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/ecc.h")
	.dwattr $C$DW$928, DW_AT_decl_line(0x31)
	.dwattr $C$DW$928, DW_AT_decl_column(0x09)
$C$DW$929	.dwtag  DW_TAG_member
	.dwattr $C$DW$929, DW_AT_type(*$C$DW$T$132)
	.dwattr $C$DW$929, DW_AT_name("name")
	.dwattr $C$DW$929, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$929, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$929, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$929, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/ecc.h")
	.dwattr $C$DW$929, DW_AT_decl_line(0x32)
	.dwattr $C$DW$929, DW_AT_decl_column(0x11)
$C$DW$930	.dwtag  DW_TAG_member
	.dwattr $C$DW$930, DW_AT_type(*$C$DW$T$132)
	.dwattr $C$DW$930, DW_AT_name("prime")
	.dwattr $C$DW$930, DW_AT_TI_symbol_name("prime")
	.dwattr $C$DW$930, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$930, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$930, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/ecc.h")
	.dwattr $C$DW$930, DW_AT_decl_line(0x33)
	.dwattr $C$DW$930, DW_AT_decl_column(0x11)
$C$DW$931	.dwtag  DW_TAG_member
	.dwattr $C$DW$931, DW_AT_type(*$C$DW$T$132)
	.dwattr $C$DW$931, DW_AT_name("Bf")
	.dwattr $C$DW$931, DW_AT_TI_symbol_name("Bf")
	.dwattr $C$DW$931, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$931, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$931, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/ecc.h")
	.dwattr $C$DW$931, DW_AT_decl_line(0x34)
	.dwattr $C$DW$931, DW_AT_decl_column(0x11)
$C$DW$932	.dwtag  DW_TAG_member
	.dwattr $C$DW$932, DW_AT_type(*$C$DW$T$132)
	.dwattr $C$DW$932, DW_AT_name("order")
	.dwattr $C$DW$932, DW_AT_TI_symbol_name("order")
	.dwattr $C$DW$932, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$932, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$932, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/ecc.h")
	.dwattr $C$DW$932, DW_AT_decl_line(0x35)
	.dwattr $C$DW$932, DW_AT_decl_column(0x11)
$C$DW$933	.dwtag  DW_TAG_member
	.dwattr $C$DW$933, DW_AT_type(*$C$DW$T$132)
	.dwattr $C$DW$933, DW_AT_name("Gx")
	.dwattr $C$DW$933, DW_AT_TI_symbol_name("Gx")
	.dwattr $C$DW$933, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$933, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$933, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/ecc.h")
	.dwattr $C$DW$933, DW_AT_decl_line(0x36)
	.dwattr $C$DW$933, DW_AT_decl_column(0x11)
$C$DW$934	.dwtag  DW_TAG_member
	.dwattr $C$DW$934, DW_AT_type(*$C$DW$T$132)
	.dwattr $C$DW$934, DW_AT_name("Gy")
	.dwattr $C$DW$934, DW_AT_TI_symbol_name("Gy")
	.dwattr $C$DW$934, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$934, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$934, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/ecc.h")
	.dwattr $C$DW$934, DW_AT_decl_line(0x37)
	.dwattr $C$DW$934, DW_AT_decl_column(0x11)
	.dwendtag $C$DW$T$133

	.dwattr $C$DW$T$133, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/ecc.h")
	.dwattr $C$DW$T$133, DW_AT_decl_line(0x30)
	.dwattr $C$DW$T$133, DW_AT_decl_column(0x10)
$C$DW$T$554	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$554, DW_AT_type(*$C$DW$T$133)
$C$DW$T$556	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$556, DW_AT_type(*$C$DW$T$554)
	.dwattr $C$DW$T$556, DW_AT_address_class(0x20)
$C$DW$T$134	.dwtag  DW_TAG_typedef, DW_AT_name("ecc_set_type")
	.dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$133)
	.dwattr $C$DW$T$134, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$134, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/ecc.h")
	.dwattr $C$DW$T$134, DW_AT_decl_line(0x38)
	.dwattr $C$DW$T$134, DW_AT_decl_column(0x03)
$C$DW$T$135	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$134)
$C$DW$T$136	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$136, DW_AT_type(*$C$DW$T$135)
	.dwattr $C$DW$T$136, DW_AT_address_class(0x20)
$C$DW$T$558	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$558, DW_AT_type(*$C$DW$T$136)

$C$DW$T$559	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$559, DW_AT_type(*$C$DW$T$135)
	.dwattr $C$DW$T$559, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$559, DW_AT_byte_size(0xfc)
$C$DW$935	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$935, DW_AT_upper_bound(0x08)
	.dwendtag $C$DW$T$559


$C$DW$T$138	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$138, DW_AT_byte_size(0x8ac)
$C$DW$936	.dwtag  DW_TAG_member
	.dwattr $C$DW$936, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$936, DW_AT_name("type")
	.dwattr $C$DW$936, DW_AT_TI_symbol_name("type")
	.dwattr $C$DW$936, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$936, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$936, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/ecc.h")
	.dwattr $C$DW$936, DW_AT_decl_line(0x46)
	.dwattr $C$DW$936, DW_AT_decl_column(0x09)
$C$DW$937	.dwtag  DW_TAG_member
	.dwattr $C$DW$937, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$937, DW_AT_name("idx")
	.dwattr $C$DW$937, DW_AT_TI_symbol_name("idx")
	.dwattr $C$DW$937, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$937, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$937, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/ecc.h")
	.dwattr $C$DW$937, DW_AT_decl_line(0x47)
	.dwattr $C$DW$937, DW_AT_decl_column(0x09)
$C$DW$938	.dwtag  DW_TAG_member
	.dwattr $C$DW$938, DW_AT_type(*$C$DW$T$136)
	.dwattr $C$DW$938, DW_AT_name("dp")
	.dwattr $C$DW$938, DW_AT_TI_symbol_name("dp")
	.dwattr $C$DW$938, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$938, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$938, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/ecc.h")
	.dwattr $C$DW$938, DW_AT_decl_line(0x4a)
	.dwattr $C$DW$938, DW_AT_decl_column(0x19)
$C$DW$939	.dwtag  DW_TAG_member
	.dwattr $C$DW$939, DW_AT_type(*$C$DW$T$137)
	.dwattr $C$DW$939, DW_AT_name("pubkey")
	.dwattr $C$DW$939, DW_AT_TI_symbol_name("pubkey")
	.dwattr $C$DW$939, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$939, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$939, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/ecc.h")
	.dwattr $C$DW$939, DW_AT_decl_line(0x4c)
	.dwattr $C$DW$939, DW_AT_decl_column(0x0f)
$C$DW$940	.dwtag  DW_TAG_member
	.dwattr $C$DW$940, DW_AT_type(*$C$DW$T$128)
	.dwattr $C$DW$940, DW_AT_name("k")
	.dwattr $C$DW$940, DW_AT_TI_symbol_name("k")
	.dwattr $C$DW$940, DW_AT_data_member_location[DW_OP_plus_uconst 0x684]
	.dwattr $C$DW$940, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$940, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/ecc.h")
	.dwattr $C$DW$940, DW_AT_decl_line(0x4d)
	.dwattr $C$DW$940, DW_AT_decl_column(0x0f)
	.dwendtag $C$DW$T$138

	.dwattr $C$DW$T$138, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/ecc.h")
	.dwattr $C$DW$T$138, DW_AT_decl_line(0x45)
	.dwattr $C$DW$T$138, DW_AT_decl_column(0x10)
$C$DW$T$562	.dwtag  DW_TAG_typedef, DW_AT_name("ecc_key")
	.dwattr $C$DW$T$562, DW_AT_type(*$C$DW$T$138)
	.dwattr $C$DW$T$562, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$562, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/ecc.h")
	.dwattr $C$DW$T$562, DW_AT_decl_line(0x4e)
	.dwattr $C$DW$T$562, DW_AT_decl_column(0x03)
$C$DW$T$563	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$563, DW_AT_type(*$C$DW$T$562)
	.dwattr $C$DW$T$563, DW_AT_address_class(0x20)
$C$DW$T$564	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$564, DW_AT_type(*$C$DW$T$563)

$C$DW$T$141	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$141, DW_AT_byte_size(0x08)
$C$DW$941	.dwtag  DW_TAG_member
	.dwattr $C$DW$941, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$941, DW_AT_name("length")
	.dwattr $C$DW$941, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$941, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$941, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$941, DW_AT_decl_file("C:/ti/tirtos_tivac_2_00_02_36/products/bios_6_40_02_27/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$941, DW_AT_decl_line(0xe2)
	.dwattr $C$DW$941, DW_AT_decl_column(0x16)
$C$DW$942	.dwtag  DW_TAG_member
	.dwattr $C$DW$942, DW_AT_type(*$C$DW$T$140)
	.dwattr $C$DW$942, DW_AT_name("elem")
	.dwattr $C$DW$942, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$942, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$942, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$942, DW_AT_decl_file("C:/ti/tirtos_tivac_2_00_02_36/products/bios_6_40_02_27/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$942, DW_AT_decl_line(0xe2)
	.dwattr $C$DW$942, DW_AT_decl_column(0x3a)
	.dwendtag $C$DW$T$141

	.dwattr $C$DW$T$141, DW_AT_decl_file("C:/ti/tirtos_tivac_2_00_02_36/products/bios_6_40_02_27/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$141, DW_AT_decl_line(0xe2)
	.dwattr $C$DW$T$141, DW_AT_decl_column(0x10)
$C$DW$T$565	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$565, DW_AT_type(*$C$DW$T$141)
	.dwattr $C$DW$T$565, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$565, DW_AT_decl_file("C:/ti/tirtos_tivac_2_00_02_36/products/bios_6_40_02_27/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$565, DW_AT_decl_line(0xe2)
	.dwattr $C$DW$T$565, DW_AT_decl_column(0x42)
$C$DW$T$566	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$566, DW_AT_type(*$C$DW$T$565)
	.dwattr $C$DW$T$566, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$566, DW_AT_decl_file("C:/ti/tirtos_tivac_2_00_02_36/products/bios_6_40_02_27/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$566, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$T$566, DW_AT_decl_column(0x2b)
$C$DW$T$567	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$567, DW_AT_type(*$C$DW$T$566)
	.dwattr $C$DW$T$567, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$567, DW_AT_decl_file("C:/ti/tirtos_tivac_2_00_02_36/products/bios_6_40_02_27/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$567, DW_AT_decl_line(0xe4)
	.dwattr $C$DW$T$567, DW_AT_decl_column(0x27)

$C$DW$T$144	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$144, DW_AT_byte_size(0x08)
$C$DW$943	.dwtag  DW_TAG_member
	.dwattr $C$DW$943, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$943, DW_AT_name("length")
	.dwattr $C$DW$943, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$943, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$943, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$943, DW_AT_decl_file("C:/ti/tirtos_tivac_2_00_02_36/products/bios_6_40_02_27/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$943, DW_AT_decl_line(0x19f)
	.dwattr $C$DW$943, DW_AT_decl_column(0x16)
$C$DW$944	.dwtag  DW_TAG_member
	.dwattr $C$DW$944, DW_AT_type(*$C$DW$T$143)
	.dwattr $C$DW$944, DW_AT_name("elem")
	.dwattr $C$DW$944, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$944, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$944, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$944, DW_AT_decl_file("C:/ti/tirtos_tivac_2_00_02_36/products/bios_6_40_02_27/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$944, DW_AT_decl_line(0x19f)
	.dwattr $C$DW$944, DW_AT_decl_column(0x3b)
	.dwendtag $C$DW$T$144

	.dwattr $C$DW$T$144, DW_AT_decl_file("C:/ti/tirtos_tivac_2_00_02_36/products/bios_6_40_02_27/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$144, DW_AT_decl_line(0x19f)
	.dwattr $C$DW$T$144, DW_AT_decl_column(0x10)
$C$DW$T$568	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$568, DW_AT_type(*$C$DW$T$144)
	.dwattr $C$DW$T$568, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$568, DW_AT_decl_file("C:/ti/tirtos_tivac_2_00_02_36/products/bios_6_40_02_27/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$568, DW_AT_decl_line(0x19f)
	.dwattr $C$DW$T$568, DW_AT_decl_column(0x43)
$C$DW$T$569	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$569, DW_AT_type(*$C$DW$T$568)
	.dwattr $C$DW$T$569, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$569, DW_AT_decl_file("C:/ti/tirtos_tivac_2_00_02_36/products/bios_6_40_02_27/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$569, DW_AT_decl_line(0x1a0)
	.dwattr $C$DW$T$569, DW_AT_decl_column(0x2c)
$C$DW$T$570	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$570, DW_AT_type(*$C$DW$T$569)
	.dwattr $C$DW$T$570, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$570, DW_AT_decl_file("C:/ti/tirtos_tivac_2_00_02_36/products/bios_6_40_02_27/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$570, DW_AT_decl_line(0x1a1)
	.dwattr $C$DW$T$570, DW_AT_decl_column(0x28)

$C$DW$T$145	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$145, DW_AT_byte_size(0x08)
$C$DW$945	.dwtag  DW_TAG_member
	.dwattr $C$DW$945, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$945, DW_AT_name("quot")
	.dwattr $C$DW$945, DW_AT_TI_symbol_name("quot")
	.dwattr $C$DW$945, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$945, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$945, DW_AT_decl_file("c:/ti/ccsv6/tools/compiler/arm_5.1.6/include/stdlib.h")
	.dwattr $C$DW$945, DW_AT_decl_line(0x50)
	.dwattr $C$DW$945, DW_AT_decl_column(0x16)
$C$DW$946	.dwtag  DW_TAG_member
	.dwattr $C$DW$946, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$946, DW_AT_name("rem")
	.dwattr $C$DW$946, DW_AT_TI_symbol_name("rem")
	.dwattr $C$DW$946, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$946, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$946, DW_AT_decl_file("c:/ti/ccsv6/tools/compiler/arm_5.1.6/include/stdlib.h")
	.dwattr $C$DW$946, DW_AT_decl_line(0x50)
	.dwattr $C$DW$946, DW_AT_decl_column(0x1c)
	.dwendtag $C$DW$T$145

	.dwattr $C$DW$T$145, DW_AT_decl_file("c:/ti/ccsv6/tools/compiler/arm_5.1.6/include/stdlib.h")
	.dwattr $C$DW$T$145, DW_AT_decl_line(0x50)
	.dwattr $C$DW$T$145, DW_AT_decl_column(0x10)
$C$DW$T$571	.dwtag  DW_TAG_typedef, DW_AT_name("div_t")
	.dwattr $C$DW$T$571, DW_AT_type(*$C$DW$T$145)
	.dwattr $C$DW$T$571, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$571, DW_AT_decl_file("c:/ti/ccsv6/tools/compiler/arm_5.1.6/include/stdlib.h")
	.dwattr $C$DW$T$571, DW_AT_decl_line(0x50)
	.dwattr $C$DW$T$571, DW_AT_decl_column(0x23)

$C$DW$T$146	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$146, DW_AT_byte_size(0x08)
$C$DW$947	.dwtag  DW_TAG_member
	.dwattr $C$DW$947, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$947, DW_AT_name("quot")
	.dwattr $C$DW$947, DW_AT_TI_symbol_name("quot")
	.dwattr $C$DW$947, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$947, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$947, DW_AT_decl_file("c:/ti/ccsv6/tools/compiler/arm_5.1.6/include/stdlib.h")
	.dwattr $C$DW$947, DW_AT_decl_line(0x52)
	.dwattr $C$DW$947, DW_AT_decl_column(0x16)
$C$DW$948	.dwtag  DW_TAG_member
	.dwattr $C$DW$948, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$948, DW_AT_name("rem")
	.dwattr $C$DW$948, DW_AT_TI_symbol_name("rem")
	.dwattr $C$DW$948, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$948, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$948, DW_AT_decl_file("c:/ti/ccsv6/tools/compiler/arm_5.1.6/include/stdlib.h")
	.dwattr $C$DW$948, DW_AT_decl_line(0x52)
	.dwattr $C$DW$948, DW_AT_decl_column(0x1c)
	.dwendtag $C$DW$T$146

	.dwattr $C$DW$T$146, DW_AT_decl_file("c:/ti/ccsv6/tools/compiler/arm_5.1.6/include/stdlib.h")
	.dwattr $C$DW$T$146, DW_AT_decl_line(0x52)
	.dwattr $C$DW$T$146, DW_AT_decl_column(0x10)
$C$DW$T$572	.dwtag  DW_TAG_typedef, DW_AT_name("ldiv_t")
	.dwattr $C$DW$T$572, DW_AT_type(*$C$DW$T$146)
	.dwattr $C$DW$T$572, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$572, DW_AT_decl_file("c:/ti/ccsv6/tools/compiler/arm_5.1.6/include/stdlib.h")
	.dwattr $C$DW$T$572, DW_AT_decl_line(0x52)
	.dwattr $C$DW$T$572, DW_AT_decl_column(0x23)

$C$DW$T$147	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$147, DW_AT_byte_size(0x10)
$C$DW$949	.dwtag  DW_TAG_member
	.dwattr $C$DW$949, DW_AT_type(*$C$DW$T$14)
	.dwattr $C$DW$949, DW_AT_name("quot")
	.dwattr $C$DW$949, DW_AT_TI_symbol_name("quot")
	.dwattr $C$DW$949, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$949, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$949, DW_AT_decl_file("c:/ti/ccsv6/tools/compiler/arm_5.1.6/include/stdlib.h")
	.dwattr $C$DW$949, DW_AT_decl_line(0x55)
	.dwattr $C$DW$949, DW_AT_decl_column(0x1c)
$C$DW$950	.dwtag  DW_TAG_member
	.dwattr $C$DW$950, DW_AT_type(*$C$DW$T$14)
	.dwattr $C$DW$950, DW_AT_name("rem")
	.dwattr $C$DW$950, DW_AT_TI_symbol_name("rem")
	.dwattr $C$DW$950, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$950, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$950, DW_AT_decl_file("c:/ti/ccsv6/tools/compiler/arm_5.1.6/include/stdlib.h")
	.dwattr $C$DW$950, DW_AT_decl_line(0x55)
	.dwattr $C$DW$950, DW_AT_decl_column(0x22)
	.dwendtag $C$DW$T$147

	.dwattr $C$DW$T$147, DW_AT_decl_file("c:/ti/ccsv6/tools/compiler/arm_5.1.6/include/stdlib.h")
	.dwattr $C$DW$T$147, DW_AT_decl_line(0x55)
	.dwattr $C$DW$T$147, DW_AT_decl_column(0x10)
$C$DW$T$573	.dwtag  DW_TAG_typedef, DW_AT_name("lldiv_t")
	.dwattr $C$DW$T$573, DW_AT_type(*$C$DW$T$147)
	.dwattr $C$DW$T$573, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$573, DW_AT_decl_file("c:/ti/ccsv6/tools/compiler/arm_5.1.6/include/stdlib.h")
	.dwattr $C$DW$T$573, DW_AT_decl_line(0x55)
	.dwattr $C$DW$T$573, DW_AT_decl_column(0x29)

$C$DW$T$151	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$151, DW_AT_byte_size(0x04)
$C$DW$951	.dwtag  DW_TAG_member
	.dwattr $C$DW$951, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$951, DW_AT_name("f")
	.dwattr $C$DW$951, DW_AT_TI_symbol_name("f")
	.dwattr $C$DW$951, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$951, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$951, DW_AT_decl_file("c:/ti/xdctools_3_30_01_25_core/packages/xdc/std.h")
	.dwattr $C$DW$951, DW_AT_decl_line(0xac)
	.dwattr $C$DW$951, DW_AT_decl_column(0x0f)
$C$DW$952	.dwtag  DW_TAG_member
	.dwattr $C$DW$952, DW_AT_type(*$C$DW$T$150)
	.dwattr $C$DW$952, DW_AT_name("a")
	.dwattr $C$DW$952, DW_AT_TI_symbol_name("a")
	.dwattr $C$DW$952, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$952, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$952, DW_AT_decl_file("c:/ti/xdctools_3_30_01_25_core/packages/xdc/std.h")
	.dwattr $C$DW$952, DW_AT_decl_line(0xad)
	.dwattr $C$DW$952, DW_AT_decl_column(0x0f)
	.dwendtag $C$DW$T$151

	.dwattr $C$DW$T$151, DW_AT_decl_file("c:/ti/xdctools_3_30_01_25_core/packages/xdc/std.h")
	.dwattr $C$DW$T$151, DW_AT_decl_line(0xab)
	.dwattr $C$DW$T$151, DW_AT_decl_column(0x0f)
$C$DW$T$574	.dwtag  DW_TAG_typedef, DW_AT_name("xdc_FloatData")
	.dwattr $C$DW$T$574, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$T$574, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$574, DW_AT_decl_file("c:/ti/xdctools_3_30_01_25_core/packages/xdc/std.h")
	.dwattr $C$DW$T$574, DW_AT_decl_line(0xae)
	.dwattr $C$DW$T$574, DW_AT_decl_column(0x03)

$C$DW$T$575	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$575, DW_AT_name("ASN_Flags")
	.dwattr $C$DW$T$575, DW_AT_byte_size(0x01)
$C$DW$953	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_CONSTRUCTED"), DW_AT_const_value(0x20)
	.dwattr $C$DW$953, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$953, DW_AT_decl_line(0x4d)
	.dwattr $C$DW$953, DW_AT_decl_column(0x05)
$C$DW$954	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_CONTEXT_SPECIFIC"), DW_AT_const_value(0x80)
	.dwattr $C$DW$954, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$954, DW_AT_decl_line(0x4e)
	.dwattr $C$DW$954, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$575

	.dwattr $C$DW$T$575, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$T$575, DW_AT_decl_line(0x4c)
	.dwattr $C$DW$T$575, DW_AT_decl_column(0x07)

$C$DW$T$576	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$576, DW_AT_name("ASN_Tags")
	.dwattr $C$DW$T$576, DW_AT_byte_size(0x01)
$C$DW$955	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_BOOLEAN"), DW_AT_const_value(0x01)
	.dwattr $C$DW$955, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$955, DW_AT_decl_line(0x37)
	.dwattr $C$DW$955, DW_AT_decl_column(0x05)
$C$DW$956	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_INTEGER"), DW_AT_const_value(0x02)
	.dwattr $C$DW$956, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$956, DW_AT_decl_line(0x38)
	.dwattr $C$DW$956, DW_AT_decl_column(0x05)
$C$DW$957	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_BIT_STRING"), DW_AT_const_value(0x03)
	.dwattr $C$DW$957, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$957, DW_AT_decl_line(0x39)
	.dwattr $C$DW$957, DW_AT_decl_column(0x05)
$C$DW$958	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_OCTET_STRING"), DW_AT_const_value(0x04)
	.dwattr $C$DW$958, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$958, DW_AT_decl_line(0x3a)
	.dwattr $C$DW$958, DW_AT_decl_column(0x05)
$C$DW$959	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_TAG_NULL"), DW_AT_const_value(0x05)
	.dwattr $C$DW$959, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$959, DW_AT_decl_line(0x3b)
	.dwattr $C$DW$959, DW_AT_decl_column(0x05)
$C$DW$960	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_OBJECT_ID"), DW_AT_const_value(0x06)
	.dwattr $C$DW$960, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$960, DW_AT_decl_line(0x3c)
	.dwattr $C$DW$960, DW_AT_decl_column(0x05)
$C$DW$961	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_ENUMERATED"), DW_AT_const_value(0x0a)
	.dwattr $C$DW$961, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$961, DW_AT_decl_line(0x3d)
	.dwattr $C$DW$961, DW_AT_decl_column(0x05)
$C$DW$962	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_UTF8STRING"), DW_AT_const_value(0x0c)
	.dwattr $C$DW$962, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$962, DW_AT_decl_line(0x3e)
	.dwattr $C$DW$962, DW_AT_decl_column(0x05)
$C$DW$963	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_SEQUENCE"), DW_AT_const_value(0x10)
	.dwattr $C$DW$963, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$963, DW_AT_decl_line(0x3f)
	.dwattr $C$DW$963, DW_AT_decl_column(0x05)
$C$DW$964	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_SET"), DW_AT_const_value(0x11)
	.dwattr $C$DW$964, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$964, DW_AT_decl_line(0x40)
	.dwattr $C$DW$964, DW_AT_decl_column(0x05)
$C$DW$965	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_UTC_TIME"), DW_AT_const_value(0x17)
	.dwattr $C$DW$965, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$965, DW_AT_decl_line(0x41)
	.dwattr $C$DW$965, DW_AT_decl_column(0x05)
$C$DW$966	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_OTHER_TYPE"), DW_AT_const_value(0x00)
	.dwattr $C$DW$966, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$966, DW_AT_decl_line(0x42)
	.dwattr $C$DW$966, DW_AT_decl_column(0x05)
$C$DW$967	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_RFC822_TYPE"), DW_AT_const_value(0x01)
	.dwattr $C$DW$967, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$967, DW_AT_decl_line(0x43)
	.dwattr $C$DW$967, DW_AT_decl_column(0x05)
$C$DW$968	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_DNS_TYPE"), DW_AT_const_value(0x02)
	.dwattr $C$DW$968, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$968, DW_AT_decl_line(0x44)
	.dwattr $C$DW$968, DW_AT_decl_column(0x05)
$C$DW$969	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_DIR_TYPE"), DW_AT_const_value(0x04)
	.dwattr $C$DW$969, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$969, DW_AT_decl_line(0x45)
	.dwattr $C$DW$969, DW_AT_decl_column(0x05)
$C$DW$970	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_GENERALIZED_TIME"), DW_AT_const_value(0x18)
	.dwattr $C$DW$970, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$970, DW_AT_decl_line(0x46)
	.dwattr $C$DW$970, DW_AT_decl_column(0x05)
$C$DW$971	.dwtag  DW_TAG_enumerator, DW_AT_name("CRL_EXTENSIONS"), DW_AT_const_value(0xa0)
	.dwattr $C$DW$971, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$971, DW_AT_decl_line(0x47)
	.dwattr $C$DW$971, DW_AT_decl_column(0x05)
$C$DW$972	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_EXTENSIONS"), DW_AT_const_value(0xa3)
	.dwattr $C$DW$972, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$972, DW_AT_decl_line(0x48)
	.dwattr $C$DW$972, DW_AT_decl_column(0x05)
$C$DW$973	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_LONG_LENGTH"), DW_AT_const_value(0x80)
	.dwattr $C$DW$973, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$973, DW_AT_decl_line(0x49)
	.dwattr $C$DW$973, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$576

	.dwattr $C$DW$T$576, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$T$576, DW_AT_decl_line(0x36)
	.dwattr $C$DW$T$576, DW_AT_decl_column(0x06)

$C$DW$T$154	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$154, DW_AT_name("Arc4")
	.dwattr $C$DW$T$154, DW_AT_byte_size(0x102)
$C$DW$974	.dwtag  DW_TAG_member
	.dwattr $C$DW$974, DW_AT_type(*$C$DW$T$152)
	.dwattr $C$DW$974, DW_AT_name("x")
	.dwattr $C$DW$974, DW_AT_TI_symbol_name("x")
	.dwattr $C$DW$974, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$974, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$974, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/arc4.h")
	.dwattr $C$DW$974, DW_AT_decl_line(0x2c)
	.dwattr $C$DW$974, DW_AT_decl_column(0x0a)
$C$DW$975	.dwtag  DW_TAG_member
	.dwattr $C$DW$975, DW_AT_type(*$C$DW$T$152)
	.dwattr $C$DW$975, DW_AT_name("y")
	.dwattr $C$DW$975, DW_AT_TI_symbol_name("y")
	.dwattr $C$DW$975, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$975, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$975, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/arc4.h")
	.dwattr $C$DW$975, DW_AT_decl_line(0x2d)
	.dwattr $C$DW$975, DW_AT_decl_column(0x0a)
$C$DW$976	.dwtag  DW_TAG_member
	.dwattr $C$DW$976, DW_AT_type(*$C$DW$T$153)
	.dwattr $C$DW$976, DW_AT_name("state")
	.dwattr $C$DW$976, DW_AT_TI_symbol_name("state")
	.dwattr $C$DW$976, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$976, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$976, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/arc4.h")
	.dwattr $C$DW$976, DW_AT_decl_line(0x2e)
	.dwattr $C$DW$976, DW_AT_decl_column(0x0a)
	.dwendtag $C$DW$T$154

	.dwattr $C$DW$T$154, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/arc4.h")
	.dwattr $C$DW$T$154, DW_AT_decl_line(0x2b)
	.dwattr $C$DW$T$154, DW_AT_decl_column(0x10)
$C$DW$T$177	.dwtag  DW_TAG_typedef, DW_AT_name("Arc4")
	.dwattr $C$DW$T$177, DW_AT_type(*$C$DW$T$154)
	.dwattr $C$DW$T$177, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$177, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/arc4.h")
	.dwattr $C$DW$T$177, DW_AT_decl_line(0x34)
	.dwattr $C$DW$T$177, DW_AT_decl_column(0x03)

$C$DW$T$577	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$577, DW_AT_name("AuthInfo_Sum")
	.dwattr $C$DW$T$577, DW_AT_byte_size(0x01)
$C$DW$977	.dwtag  DW_TAG_enumerator, DW_AT_name("AIA_OCSP_OID"), DW_AT_const_value(0x74)
	.dwattr $C$DW$977, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$977, DW_AT_decl_line(0xec)
	.dwattr $C$DW$977, DW_AT_decl_column(0x05)
$C$DW$978	.dwtag  DW_TAG_enumerator, DW_AT_name("AIA_CA_ISSUER_OID"), DW_AT_const_value(0x75)
	.dwattr $C$DW$978, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$978, DW_AT_decl_line(0xed)
	.dwattr $C$DW$978, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$577

	.dwattr $C$DW$T$577, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$T$577, DW_AT_decl_line(0xeb)
	.dwattr $C$DW$T$577, DW_AT_decl_column(0x06)

$C$DW$T$158	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$158, DW_AT_name("Base_entry")
	.dwattr $C$DW$T$158, DW_AT_byte_size(0x10)
$C$DW$979	.dwtag  DW_TAG_member
	.dwattr $C$DW$979, DW_AT_type(*$C$DW$T$156)
	.dwattr $C$DW$979, DW_AT_name("next")
	.dwattr $C$DW$979, DW_AT_TI_symbol_name("next")
	.dwattr $C$DW$979, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$979, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$979, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$979, DW_AT_decl_line(0x119)
	.dwattr $C$DW$979, DW_AT_decl_column(0x11)
$C$DW$980	.dwtag  DW_TAG_member
	.dwattr $C$DW$980, DW_AT_type(*$C$DW$T$157)
	.dwattr $C$DW$980, DW_AT_name("name")
	.dwattr $C$DW$980, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$980, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$980, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$980, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$980, DW_AT_decl_line(0x11a)
	.dwattr $C$DW$980, DW_AT_decl_column(0x11)
$C$DW$981	.dwtag  DW_TAG_member
	.dwattr $C$DW$981, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$981, DW_AT_name("nameSz")
	.dwattr $C$DW$981, DW_AT_TI_symbol_name("nameSz")
	.dwattr $C$DW$981, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$981, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$981, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$981, DW_AT_decl_line(0x11b)
	.dwattr $C$DW$981, DW_AT_decl_column(0x11)
$C$DW$982	.dwtag  DW_TAG_member
	.dwattr $C$DW$982, DW_AT_type(*$C$DW$T$152)
	.dwattr $C$DW$982, DW_AT_name("type")
	.dwattr $C$DW$982, DW_AT_TI_symbol_name("type")
	.dwattr $C$DW$982, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$982, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$982, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$982, DW_AT_decl_line(0x11c)
	.dwattr $C$DW$982, DW_AT_decl_column(0x11)
	.dwendtag $C$DW$T$158

	.dwattr $C$DW$T$158, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$T$158, DW_AT_decl_line(0x118)
	.dwattr $C$DW$T$158, DW_AT_decl_column(0x08)
$C$DW$T$155	.dwtag  DW_TAG_typedef, DW_AT_name("Base_entry")
	.dwattr $C$DW$T$155, DW_AT_type(*$C$DW$T$158)
	.dwattr $C$DW$T$155, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$155, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$T$155, DW_AT_decl_line(0x116)
	.dwattr $C$DW$T$155, DW_AT_decl_column(0x1c)
$C$DW$T$156	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$156, DW_AT_type(*$C$DW$T$155)
	.dwattr $C$DW$T$156, DW_AT_address_class(0x20)

$C$DW$T$578	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$578, DW_AT_name("Block_Sum")
	.dwattr $C$DW$T$578, DW_AT_byte_size(0x02)
$C$DW$983	.dwtag  DW_TAG_enumerator, DW_AT_name("DESb"), DW_AT_const_value(0x45)
	.dwattr $C$DW$983, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$983, DW_AT_decl_line(0xb8)
	.dwattr $C$DW$983, DW_AT_decl_column(0x05)
$C$DW$984	.dwtag  DW_TAG_enumerator, DW_AT_name("DES3b"), DW_AT_const_value(0x28c)
	.dwattr $C$DW$984, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$984, DW_AT_decl_line(0xb9)
	.dwattr $C$DW$984, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$578

	.dwattr $C$DW$T$578, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$T$578, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$T$578, DW_AT_decl_column(0x06)

$C$DW$T$19	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$19, DW_AT_name("CertStatus")
	.dwattr $C$DW$T$19, DW_AT_declaration
	.dwendtag $C$DW$T$19

	.dwattr $C$DW$T$19, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$T$19, DW_AT_decl_line(0x233)
	.dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
$C$DW$T$579	.dwtag  DW_TAG_typedef, DW_AT_name("CertStatus")
	.dwattr $C$DW$T$579, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$579, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$579, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$T$579, DW_AT_decl_line(0x233)
	.dwattr $C$DW$T$579, DW_AT_decl_column(0x1b)

$C$DW$T$580	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$580, DW_AT_name("CertType")
	.dwattr $C$DW$T$580, DW_AT_byte_size(0x01)
$C$DW$985	.dwtag  DW_TAG_enumerator, DW_AT_name("CERT_TYPE"), DW_AT_const_value(0x00)
	.dwattr $C$DW$985, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn_public.h")
	.dwattr $C$DW$985, DW_AT_decl_line(0x28)
	.dwattr $C$DW$985, DW_AT_decl_column(0x05)
$C$DW$986	.dwtag  DW_TAG_enumerator, DW_AT_name("PRIVATEKEY_TYPE"), DW_AT_const_value(0x01)
	.dwattr $C$DW$986, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn_public.h")
	.dwattr $C$DW$986, DW_AT_decl_line(0x29)
	.dwattr $C$DW$986, DW_AT_decl_column(0x05)
$C$DW$987	.dwtag  DW_TAG_enumerator, DW_AT_name("DH_PARAM_TYPE"), DW_AT_const_value(0x02)
	.dwattr $C$DW$987, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn_public.h")
	.dwattr $C$DW$987, DW_AT_decl_line(0x2a)
	.dwattr $C$DW$987, DW_AT_decl_column(0x05)
$C$DW$988	.dwtag  DW_TAG_enumerator, DW_AT_name("CRL_TYPE"), DW_AT_const_value(0x03)
	.dwattr $C$DW$988, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn_public.h")
	.dwattr $C$DW$988, DW_AT_decl_line(0x2b)
	.dwattr $C$DW$988, DW_AT_decl_column(0x05)
$C$DW$989	.dwtag  DW_TAG_enumerator, DW_AT_name("CA_TYPE"), DW_AT_const_value(0x04)
	.dwattr $C$DW$989, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn_public.h")
	.dwattr $C$DW$989, DW_AT_decl_line(0x2c)
	.dwattr $C$DW$989, DW_AT_decl_column(0x05)
$C$DW$990	.dwtag  DW_TAG_enumerator, DW_AT_name("ECC_PRIVATEKEY_TYPE"), DW_AT_const_value(0x05)
	.dwattr $C$DW$990, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn_public.h")
	.dwattr $C$DW$990, DW_AT_decl_line(0x2d)
	.dwattr $C$DW$990, DW_AT_decl_column(0x05)
$C$DW$991	.dwtag  DW_TAG_enumerator, DW_AT_name("CERTREQ_TYPE"), DW_AT_const_value(0x06)
	.dwattr $C$DW$991, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn_public.h")
	.dwattr $C$DW$991, DW_AT_decl_line(0x2e)
	.dwattr $C$DW$991, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$580

	.dwattr $C$DW$T$580, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn_public.h")
	.dwattr $C$DW$T$580, DW_AT_decl_line(0x27)
	.dwattr $C$DW$T$580, DW_AT_decl_column(0x06)

$C$DW$T$581	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$581, DW_AT_name("CertificatePolicy_Sum")
	.dwattr $C$DW$T$581, DW_AT_byte_size(0x01)
$C$DW$992	.dwtag  DW_TAG_enumerator, DW_AT_name("CP_ANY_OID"), DW_AT_const_value(0x92)
	.dwattr $C$DW$992, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$992, DW_AT_decl_line(0xe4)
	.dwattr $C$DW$992, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$581

	.dwattr $C$DW$T$581, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$T$581, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$T$581, DW_AT_decl_column(0x06)

$C$DW$T$582	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$582, DW_AT_name("Ctc_Encoding")
	.dwattr $C$DW$T$582, DW_AT_byte_size(0x01)
$C$DW$993	.dwtag  DW_TAG_enumerator, DW_AT_name("CTC_UTF8"), DW_AT_const_value(0x0c)
	.dwattr $C$DW$993, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn_public.h")
	.dwattr $C$DW$993, DW_AT_decl_line(0x42)
	.dwattr $C$DW$993, DW_AT_decl_column(0x05)
$C$DW$994	.dwtag  DW_TAG_enumerator, DW_AT_name("CTC_PRINTABLE"), DW_AT_const_value(0x13)
	.dwattr $C$DW$994, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn_public.h")
	.dwattr $C$DW$994, DW_AT_decl_line(0x43)
	.dwattr $C$DW$994, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$582

	.dwattr $C$DW$T$582, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn_public.h")
	.dwattr $C$DW$T$582, DW_AT_decl_line(0x41)
	.dwattr $C$DW$T$582, DW_AT_decl_column(0x06)

$C$DW$T$583	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$583, DW_AT_name("Ctc_SigType")
	.dwattr $C$DW$T$583, DW_AT_byte_size(0x02)
$C$DW$995	.dwtag  DW_TAG_enumerator, DW_AT_name("CTC_SHAwDSA"), DW_AT_const_value(0x205)
	.dwattr $C$DW$995, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn_public.h")
	.dwattr $C$DW$995, DW_AT_decl_line(0x34)
	.dwattr $C$DW$995, DW_AT_decl_column(0x05)
$C$DW$996	.dwtag  DW_TAG_enumerator, DW_AT_name("CTC_MD2wRSA"), DW_AT_const_value(0x286)
	.dwattr $C$DW$996, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn_public.h")
	.dwattr $C$DW$996, DW_AT_decl_line(0x35)
	.dwattr $C$DW$996, DW_AT_decl_column(0x05)
$C$DW$997	.dwtag  DW_TAG_enumerator, DW_AT_name("CTC_MD5wRSA"), DW_AT_const_value(0x288)
	.dwattr $C$DW$997, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn_public.h")
	.dwattr $C$DW$997, DW_AT_decl_line(0x36)
	.dwattr $C$DW$997, DW_AT_decl_column(0x05)
$C$DW$998	.dwtag  DW_TAG_enumerator, DW_AT_name("CTC_SHAwRSA"), DW_AT_const_value(0x289)
	.dwattr $C$DW$998, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn_public.h")
	.dwattr $C$DW$998, DW_AT_decl_line(0x37)
	.dwattr $C$DW$998, DW_AT_decl_column(0x05)
$C$DW$999	.dwtag  DW_TAG_enumerator, DW_AT_name("CTC_SHAwECDSA"), DW_AT_const_value(0x208)
	.dwattr $C$DW$999, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn_public.h")
	.dwattr $C$DW$999, DW_AT_decl_line(0x38)
	.dwattr $C$DW$999, DW_AT_decl_column(0x05)
$C$DW$1000	.dwtag  DW_TAG_enumerator, DW_AT_name("CTC_SHA256wRSA"), DW_AT_const_value(0x28f)
	.dwattr $C$DW$1000, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn_public.h")
	.dwattr $C$DW$1000, DW_AT_decl_line(0x39)
	.dwattr $C$DW$1000, DW_AT_decl_column(0x05)
$C$DW$1001	.dwtag  DW_TAG_enumerator, DW_AT_name("CTC_SHA256wECDSA"), DW_AT_const_value(0x20c)
	.dwattr $C$DW$1001, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn_public.h")
	.dwattr $C$DW$1001, DW_AT_decl_line(0x3a)
	.dwattr $C$DW$1001, DW_AT_decl_column(0x05)
$C$DW$1002	.dwtag  DW_TAG_enumerator, DW_AT_name("CTC_SHA384wRSA"), DW_AT_const_value(0x290)
	.dwattr $C$DW$1002, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn_public.h")
	.dwattr $C$DW$1002, DW_AT_decl_line(0x3b)
	.dwattr $C$DW$1002, DW_AT_decl_column(0x05)
$C$DW$1003	.dwtag  DW_TAG_enumerator, DW_AT_name("CTC_SHA384wECDSA"), DW_AT_const_value(0x20d)
	.dwattr $C$DW$1003, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn_public.h")
	.dwattr $C$DW$1003, DW_AT_decl_line(0x3c)
	.dwattr $C$DW$1003, DW_AT_decl_column(0x05)
$C$DW$1004	.dwtag  DW_TAG_enumerator, DW_AT_name("CTC_SHA512wRSA"), DW_AT_const_value(0x291)
	.dwattr $C$DW$1004, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn_public.h")
	.dwattr $C$DW$1004, DW_AT_decl_line(0x3d)
	.dwattr $C$DW$1004, DW_AT_decl_column(0x05)
$C$DW$1005	.dwtag  DW_TAG_enumerator, DW_AT_name("CTC_SHA512wECDSA"), DW_AT_const_value(0x20e)
	.dwattr $C$DW$1005, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn_public.h")
	.dwattr $C$DW$1005, DW_AT_decl_line(0x3e)
	.dwattr $C$DW$1005, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$583

	.dwattr $C$DW$T$583, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn_public.h")
	.dwattr $C$DW$T$583, DW_AT_decl_line(0x33)
	.dwattr $C$DW$T$583, DW_AT_decl_column(0x06)

$C$DW$T$161	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$161, DW_AT_name("DNS_entry")
	.dwattr $C$DW$T$161, DW_AT_byte_size(0x08)
$C$DW$1006	.dwtag  DW_TAG_member
	.dwattr $C$DW$1006, DW_AT_type(*$C$DW$T$160)
	.dwattr $C$DW$1006, DW_AT_name("next")
	.dwattr $C$DW$1006, DW_AT_TI_symbol_name("next")
	.dwattr $C$DW$1006, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1006, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1006, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1006, DW_AT_decl_line(0x111)
	.dwattr $C$DW$1006, DW_AT_decl_column(0x10)
$C$DW$1007	.dwtag  DW_TAG_member
	.dwattr $C$DW$1007, DW_AT_type(*$C$DW$T$157)
	.dwattr $C$DW$1007, DW_AT_name("name")
	.dwattr $C$DW$1007, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$1007, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1007, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1007, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1007, DW_AT_decl_line(0x112)
	.dwattr $C$DW$1007, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$161

	.dwattr $C$DW$T$161, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$T$161, DW_AT_decl_line(0x110)
	.dwattr $C$DW$T$161, DW_AT_decl_column(0x08)
$C$DW$T$159	.dwtag  DW_TAG_typedef, DW_AT_name("DNS_entry")
	.dwattr $C$DW$T$159, DW_AT_type(*$C$DW$T$161)
	.dwattr $C$DW$T$159, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$159, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$T$159, DW_AT_decl_line(0x10e)
	.dwattr $C$DW$T$159, DW_AT_decl_column(0x1c)
$C$DW$T$160	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$160, DW_AT_type(*$C$DW$T$159)
	.dwattr $C$DW$T$160, DW_AT_address_class(0x20)

$C$DW$T$584	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$584, DW_AT_name("DN_Tags")
	.dwattr $C$DW$T$584, DW_AT_byte_size(0x01)
$C$DW$1008	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_COMMON_NAME"), DW_AT_const_value(0x03)
	.dwattr $C$DW$1008, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1008, DW_AT_decl_line(0x52)
	.dwattr $C$DW$1008, DW_AT_decl_column(0x05)
$C$DW$1009	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_SUR_NAME"), DW_AT_const_value(0x04)
	.dwattr $C$DW$1009, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1009, DW_AT_decl_line(0x53)
	.dwattr $C$DW$1009, DW_AT_decl_column(0x05)
$C$DW$1010	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_SERIAL_NUMBER"), DW_AT_const_value(0x05)
	.dwattr $C$DW$1010, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1010, DW_AT_decl_line(0x54)
	.dwattr $C$DW$1010, DW_AT_decl_column(0x05)
$C$DW$1011	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_COUNTRY_NAME"), DW_AT_const_value(0x06)
	.dwattr $C$DW$1011, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1011, DW_AT_decl_line(0x55)
	.dwattr $C$DW$1011, DW_AT_decl_column(0x05)
$C$DW$1012	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_LOCALITY_NAME"), DW_AT_const_value(0x07)
	.dwattr $C$DW$1012, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1012, DW_AT_decl_line(0x56)
	.dwattr $C$DW$1012, DW_AT_decl_column(0x05)
$C$DW$1013	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_STATE_NAME"), DW_AT_const_value(0x08)
	.dwattr $C$DW$1013, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1013, DW_AT_decl_line(0x57)
	.dwattr $C$DW$1013, DW_AT_decl_column(0x05)
$C$DW$1014	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_ORG_NAME"), DW_AT_const_value(0x0a)
	.dwattr $C$DW$1014, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1014, DW_AT_decl_line(0x58)
	.dwattr $C$DW$1014, DW_AT_decl_column(0x05)
$C$DW$1015	.dwtag  DW_TAG_enumerator, DW_AT_name("ASN_ORGUNIT_NAME"), DW_AT_const_value(0x0b)
	.dwattr $C$DW$1015, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1015, DW_AT_decl_line(0x59)
	.dwattr $C$DW$1015, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$584

	.dwattr $C$DW$T$584, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$T$584, DW_AT_decl_line(0x51)
	.dwattr $C$DW$T$584, DW_AT_decl_column(0x06)

$C$DW$T$168	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$168, DW_AT_name("DecodedCert")
	.dwattr $C$DW$T$168, DW_AT_byte_size(0x314)
$C$DW$1016	.dwtag  DW_TAG_member
	.dwattr $C$DW$1016, DW_AT_type(*$C$DW$T$162)
	.dwattr $C$DW$1016, DW_AT_name("publicKey")
	.dwattr $C$DW$1016, DW_AT_TI_symbol_name("publicKey")
	.dwattr $C$DW$1016, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1016, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1016, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1016, DW_AT_decl_line(0x141)
	.dwattr $C$DW$1016, DW_AT_decl_column(0x0d)
$C$DW$1017	.dwtag  DW_TAG_member
	.dwattr $C$DW$1017, DW_AT_type(*$C$DW$T$163)
	.dwattr $C$DW$1017, DW_AT_name("pubKeySize")
	.dwattr $C$DW$1017, DW_AT_TI_symbol_name("pubKeySize")
	.dwattr $C$DW$1017, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1017, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1017, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1017, DW_AT_decl_line(0x142)
	.dwattr $C$DW$1017, DW_AT_decl_column(0x0d)
$C$DW$1018	.dwtag  DW_TAG_member
	.dwattr $C$DW$1018, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1018, DW_AT_name("pubKeyStored")
	.dwattr $C$DW$1018, DW_AT_TI_symbol_name("pubKeyStored")
	.dwattr $C$DW$1018, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1018, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1018, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1018, DW_AT_decl_line(0x143)
	.dwattr $C$DW$1018, DW_AT_decl_column(0x0d)
$C$DW$1019	.dwtag  DW_TAG_member
	.dwattr $C$DW$1019, DW_AT_type(*$C$DW$T$163)
	.dwattr $C$DW$1019, DW_AT_name("certBegin")
	.dwattr $C$DW$1019, DW_AT_TI_symbol_name("certBegin")
	.dwattr $C$DW$1019, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1019, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1019, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1019, DW_AT_decl_line(0x144)
	.dwattr $C$DW$1019, DW_AT_decl_column(0x0d)
$C$DW$1020	.dwtag  DW_TAG_member
	.dwattr $C$DW$1020, DW_AT_type(*$C$DW$T$163)
	.dwattr $C$DW$1020, DW_AT_name("sigIndex")
	.dwattr $C$DW$1020, DW_AT_TI_symbol_name("sigIndex")
	.dwattr $C$DW$1020, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1020, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1020, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1020, DW_AT_decl_line(0x145)
	.dwattr $C$DW$1020, DW_AT_decl_column(0x0d)
$C$DW$1021	.dwtag  DW_TAG_member
	.dwattr $C$DW$1021, DW_AT_type(*$C$DW$T$163)
	.dwattr $C$DW$1021, DW_AT_name("sigLength")
	.dwattr $C$DW$1021, DW_AT_TI_symbol_name("sigLength")
	.dwattr $C$DW$1021, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1021, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1021, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1021, DW_AT_decl_line(0x146)
	.dwattr $C$DW$1021, DW_AT_decl_column(0x0d)
$C$DW$1022	.dwtag  DW_TAG_member
	.dwattr $C$DW$1022, DW_AT_type(*$C$DW$T$163)
	.dwattr $C$DW$1022, DW_AT_name("signatureOID")
	.dwattr $C$DW$1022, DW_AT_TI_symbol_name("signatureOID")
	.dwattr $C$DW$1022, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1022, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1022, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1022, DW_AT_decl_line(0x147)
	.dwattr $C$DW$1022, DW_AT_decl_column(0x0d)
$C$DW$1023	.dwtag  DW_TAG_member
	.dwattr $C$DW$1023, DW_AT_type(*$C$DW$T$163)
	.dwattr $C$DW$1023, DW_AT_name("keyOID")
	.dwattr $C$DW$1023, DW_AT_TI_symbol_name("keyOID")
	.dwattr $C$DW$1023, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1023, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1023, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1023, DW_AT_decl_line(0x148)
	.dwattr $C$DW$1023, DW_AT_decl_column(0x0d)
$C$DW$1024	.dwtag  DW_TAG_member
	.dwattr $C$DW$1024, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1024, DW_AT_name("version")
	.dwattr $C$DW$1024, DW_AT_TI_symbol_name("version")
	.dwattr $C$DW$1024, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1024, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1024, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1024, DW_AT_decl_line(0x149)
	.dwattr $C$DW$1024, DW_AT_decl_column(0x0d)
$C$DW$1025	.dwtag  DW_TAG_member
	.dwattr $C$DW$1025, DW_AT_type(*$C$DW$T$160)
	.dwattr $C$DW$1025, DW_AT_name("altNames")
	.dwattr $C$DW$1025, DW_AT_TI_symbol_name("altNames")
	.dwattr $C$DW$1025, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$1025, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1025, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1025, DW_AT_decl_line(0x14a)
	.dwattr $C$DW$1025, DW_AT_decl_column(0x10)
$C$DW$1026	.dwtag  DW_TAG_member
	.dwattr $C$DW$1026, DW_AT_type(*$C$DW$T$160)
	.dwattr $C$DW$1026, DW_AT_name("altEmailNames")
	.dwattr $C$DW$1026, DW_AT_TI_symbol_name("altEmailNames")
	.dwattr $C$DW$1026, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$1026, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1026, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1026, DW_AT_decl_line(0x14c)
	.dwattr $C$DW$1026, DW_AT_decl_column(0x10)
$C$DW$1027	.dwtag  DW_TAG_member
	.dwattr $C$DW$1027, DW_AT_type(*$C$DW$T$156)
	.dwattr $C$DW$1027, DW_AT_name("permittedNames")
	.dwattr $C$DW$1027, DW_AT_TI_symbol_name("permittedNames")
	.dwattr $C$DW$1027, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$1027, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1027, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1027, DW_AT_decl_line(0x14d)
	.dwattr $C$DW$1027, DW_AT_decl_column(0x11)
$C$DW$1028	.dwtag  DW_TAG_member
	.dwattr $C$DW$1028, DW_AT_type(*$C$DW$T$156)
	.dwattr $C$DW$1028, DW_AT_name("excludedNames")
	.dwattr $C$DW$1028, DW_AT_TI_symbol_name("excludedNames")
	.dwattr $C$DW$1028, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$1028, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1028, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1028, DW_AT_decl_line(0x14e)
	.dwattr $C$DW$1028, DW_AT_decl_column(0x11)
$C$DW$1029	.dwtag  DW_TAG_member
	.dwattr $C$DW$1029, DW_AT_type(*$C$DW$T$164)
	.dwattr $C$DW$1029, DW_AT_name("subjectHash")
	.dwattr $C$DW$1029, DW_AT_TI_symbol_name("subjectHash")
	.dwattr $C$DW$1029, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$1029, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1029, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1029, DW_AT_decl_line(0x150)
	.dwattr $C$DW$1029, DW_AT_decl_column(0x0d)
$C$DW$1030	.dwtag  DW_TAG_member
	.dwattr $C$DW$1030, DW_AT_type(*$C$DW$T$164)
	.dwattr $C$DW$1030, DW_AT_name("issuerHash")
	.dwattr $C$DW$1030, DW_AT_TI_symbol_name("issuerHash")
	.dwattr $C$DW$1030, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$1030, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1030, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1030, DW_AT_decl_line(0x151)
	.dwattr $C$DW$1030, DW_AT_decl_column(0x0d)
$C$DW$1031	.dwtag  DW_TAG_member
	.dwattr $C$DW$1031, DW_AT_type(*$C$DW$T$162)
	.dwattr $C$DW$1031, DW_AT_name("signature")
	.dwattr $C$DW$1031, DW_AT_TI_symbol_name("signature")
	.dwattr $C$DW$1031, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
	.dwattr $C$DW$1031, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1031, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1031, DW_AT_decl_line(0x155)
	.dwattr $C$DW$1031, DW_AT_decl_column(0x0d)
$C$DW$1032	.dwtag  DW_TAG_member
	.dwattr $C$DW$1032, DW_AT_type(*$C$DW$T$157)
	.dwattr $C$DW$1032, DW_AT_name("subjectCN")
	.dwattr $C$DW$1032, DW_AT_TI_symbol_name("subjectCN")
	.dwattr $C$DW$1032, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
	.dwattr $C$DW$1032, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1032, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1032, DW_AT_decl_line(0x156)
	.dwattr $C$DW$1032, DW_AT_decl_column(0x0d)
$C$DW$1033	.dwtag  DW_TAG_member
	.dwattr $C$DW$1033, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1033, DW_AT_name("subjectCNLen")
	.dwattr $C$DW$1033, DW_AT_TI_symbol_name("subjectCNLen")
	.dwattr $C$DW$1033, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
	.dwattr $C$DW$1033, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1033, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1033, DW_AT_decl_line(0x157)
	.dwattr $C$DW$1033, DW_AT_decl_column(0x0d)
$C$DW$1034	.dwtag  DW_TAG_member
	.dwattr $C$DW$1034, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$1034, DW_AT_name("subjectCNEnc")
	.dwattr $C$DW$1034, DW_AT_TI_symbol_name("subjectCNEnc")
	.dwattr $C$DW$1034, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
	.dwattr $C$DW$1034, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1034, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1034, DW_AT_decl_line(0x158)
	.dwattr $C$DW$1034, DW_AT_decl_column(0x0d)
$C$DW$1035	.dwtag  DW_TAG_member
	.dwattr $C$DW$1035, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1035, DW_AT_name("subjectCNStored")
	.dwattr $C$DW$1035, DW_AT_TI_symbol_name("subjectCNStored")
	.dwattr $C$DW$1035, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
	.dwattr $C$DW$1035, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1035, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1035, DW_AT_decl_line(0x159)
	.dwattr $C$DW$1035, DW_AT_decl_column(0x0d)
$C$DW$1036	.dwtag  DW_TAG_member
	.dwattr $C$DW$1036, DW_AT_type(*$C$DW$T$165)
	.dwattr $C$DW$1036, DW_AT_name("issuer")
	.dwattr $C$DW$1036, DW_AT_TI_symbol_name("issuer")
	.dwattr $C$DW$1036, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
	.dwattr $C$DW$1036, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1036, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1036, DW_AT_decl_line(0x15a)
	.dwattr $C$DW$1036, DW_AT_decl_column(0x0d)
$C$DW$1037	.dwtag  DW_TAG_member
	.dwattr $C$DW$1037, DW_AT_type(*$C$DW$T$165)
	.dwattr $C$DW$1037, DW_AT_name("subject")
	.dwattr $C$DW$1037, DW_AT_TI_symbol_name("subject")
	.dwattr $C$DW$1037, DW_AT_data_member_location[DW_OP_plus_uconst 0x170]
	.dwattr $C$DW$1037, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1037, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1037, DW_AT_decl_line(0x15b)
	.dwattr $C$DW$1037, DW_AT_decl_column(0x0d)
$C$DW$1038	.dwtag  DW_TAG_member
	.dwattr $C$DW$1038, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1038, DW_AT_name("verify")
	.dwattr $C$DW$1038, DW_AT_TI_symbol_name("verify")
	.dwattr $C$DW$1038, DW_AT_data_member_location[DW_OP_plus_uconst 0x270]
	.dwattr $C$DW$1038, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1038, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1038, DW_AT_decl_line(0x15c)
	.dwattr $C$DW$1038, DW_AT_decl_column(0x0d)
$C$DW$1039	.dwtag  DW_TAG_member
	.dwattr $C$DW$1039, DW_AT_type(*$C$DW$T$162)
	.dwattr $C$DW$1039, DW_AT_name("source")
	.dwattr $C$DW$1039, DW_AT_TI_symbol_name("source")
	.dwattr $C$DW$1039, DW_AT_data_member_location[DW_OP_plus_uconst 0x274]
	.dwattr $C$DW$1039, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1039, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1039, DW_AT_decl_line(0x15d)
	.dwattr $C$DW$1039, DW_AT_decl_column(0x0d)
$C$DW$1040	.dwtag  DW_TAG_member
	.dwattr $C$DW$1040, DW_AT_type(*$C$DW$T$163)
	.dwattr $C$DW$1040, DW_AT_name("srcIdx")
	.dwattr $C$DW$1040, DW_AT_TI_symbol_name("srcIdx")
	.dwattr $C$DW$1040, DW_AT_data_member_location[DW_OP_plus_uconst 0x278]
	.dwattr $C$DW$1040, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1040, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1040, DW_AT_decl_line(0x15e)
	.dwattr $C$DW$1040, DW_AT_decl_column(0x0d)
$C$DW$1041	.dwtag  DW_TAG_member
	.dwattr $C$DW$1041, DW_AT_type(*$C$DW$T$163)
	.dwattr $C$DW$1041, DW_AT_name("maxIdx")
	.dwattr $C$DW$1041, DW_AT_TI_symbol_name("maxIdx")
	.dwattr $C$DW$1041, DW_AT_data_member_location[DW_OP_plus_uconst 0x27c]
	.dwattr $C$DW$1041, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1041, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1041, DW_AT_decl_line(0x15f)
	.dwattr $C$DW$1041, DW_AT_decl_column(0x0d)
$C$DW$1042	.dwtag  DW_TAG_member
	.dwattr $C$DW$1042, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$1042, DW_AT_name("heap")
	.dwattr $C$DW$1042, DW_AT_TI_symbol_name("heap")
	.dwattr $C$DW$1042, DW_AT_data_member_location[DW_OP_plus_uconst 0x280]
	.dwattr $C$DW$1042, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1042, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1042, DW_AT_decl_line(0x160)
	.dwattr $C$DW$1042, DW_AT_decl_column(0x0d)
$C$DW$1043	.dwtag  DW_TAG_member
	.dwattr $C$DW$1043, DW_AT_type(*$C$DW$T$166)
	.dwattr $C$DW$1043, DW_AT_name("serial")
	.dwattr $C$DW$1043, DW_AT_TI_symbol_name("serial")
	.dwattr $C$DW$1043, DW_AT_data_member_location[DW_OP_plus_uconst 0x284]
	.dwattr $C$DW$1043, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1043, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1043, DW_AT_decl_line(0x161)
	.dwattr $C$DW$1043, DW_AT_decl_column(0x0d)
$C$DW$1044	.dwtag  DW_TAG_member
	.dwattr $C$DW$1044, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1044, DW_AT_name("serialSz")
	.dwattr $C$DW$1044, DW_AT_TI_symbol_name("serialSz")
	.dwattr $C$DW$1044, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a4]
	.dwattr $C$DW$1044, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1044, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1044, DW_AT_decl_line(0x162)
	.dwattr $C$DW$1044, DW_AT_decl_column(0x0d)
$C$DW$1045	.dwtag  DW_TAG_member
	.dwattr $C$DW$1045, DW_AT_type(*$C$DW$T$162)
	.dwattr $C$DW$1045, DW_AT_name("extensions")
	.dwattr $C$DW$1045, DW_AT_TI_symbol_name("extensions")
	.dwattr $C$DW$1045, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a8]
	.dwattr $C$DW$1045, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1045, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1045, DW_AT_decl_line(0x163)
	.dwattr $C$DW$1045, DW_AT_decl_column(0x0d)
$C$DW$1046	.dwtag  DW_TAG_member
	.dwattr $C$DW$1046, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1046, DW_AT_name("extensionsSz")
	.dwattr $C$DW$1046, DW_AT_TI_symbol_name("extensionsSz")
	.dwattr $C$DW$1046, DW_AT_data_member_location[DW_OP_plus_uconst 0x2ac]
	.dwattr $C$DW$1046, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1046, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1046, DW_AT_decl_line(0x164)
	.dwattr $C$DW$1046, DW_AT_decl_column(0x0d)
$C$DW$1047	.dwtag  DW_TAG_member
	.dwattr $C$DW$1047, DW_AT_type(*$C$DW$T$163)
	.dwattr $C$DW$1047, DW_AT_name("extensionsIdx")
	.dwattr $C$DW$1047, DW_AT_TI_symbol_name("extensionsIdx")
	.dwattr $C$DW$1047, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b0]
	.dwattr $C$DW$1047, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1047, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1047, DW_AT_decl_line(0x165)
	.dwattr $C$DW$1047, DW_AT_decl_column(0x0d)
$C$DW$1048	.dwtag  DW_TAG_member
	.dwattr $C$DW$1048, DW_AT_type(*$C$DW$T$162)
	.dwattr $C$DW$1048, DW_AT_name("extAuthInfo")
	.dwattr $C$DW$1048, DW_AT_TI_symbol_name("extAuthInfo")
	.dwattr $C$DW$1048, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b4]
	.dwattr $C$DW$1048, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1048, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1048, DW_AT_decl_line(0x166)
	.dwattr $C$DW$1048, DW_AT_decl_column(0x0d)
$C$DW$1049	.dwtag  DW_TAG_member
	.dwattr $C$DW$1049, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1049, DW_AT_name("extAuthInfoSz")
	.dwattr $C$DW$1049, DW_AT_TI_symbol_name("extAuthInfoSz")
	.dwattr $C$DW$1049, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b8]
	.dwattr $C$DW$1049, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1049, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1049, DW_AT_decl_line(0x167)
	.dwattr $C$DW$1049, DW_AT_decl_column(0x0d)
$C$DW$1050	.dwtag  DW_TAG_member
	.dwattr $C$DW$1050, DW_AT_type(*$C$DW$T$162)
	.dwattr $C$DW$1050, DW_AT_name("extCrlInfo")
	.dwattr $C$DW$1050, DW_AT_TI_symbol_name("extCrlInfo")
	.dwattr $C$DW$1050, DW_AT_data_member_location[DW_OP_plus_uconst 0x2bc]
	.dwattr $C$DW$1050, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1050, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1050, DW_AT_decl_line(0x168)
	.dwattr $C$DW$1050, DW_AT_decl_column(0x0d)
$C$DW$1051	.dwtag  DW_TAG_member
	.dwattr $C$DW$1051, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1051, DW_AT_name("extCrlInfoSz")
	.dwattr $C$DW$1051, DW_AT_TI_symbol_name("extCrlInfoSz")
	.dwattr $C$DW$1051, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c0]
	.dwattr $C$DW$1051, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1051, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1051, DW_AT_decl_line(0x169)
	.dwattr $C$DW$1051, DW_AT_decl_column(0x0d)
$C$DW$1052	.dwtag  DW_TAG_member
	.dwattr $C$DW$1052, DW_AT_type(*$C$DW$T$164)
	.dwattr $C$DW$1052, DW_AT_name("extSubjKeyId")
	.dwattr $C$DW$1052, DW_AT_TI_symbol_name("extSubjKeyId")
	.dwattr $C$DW$1052, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c4]
	.dwattr $C$DW$1052, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1052, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1052, DW_AT_decl_line(0x16a)
	.dwattr $C$DW$1052, DW_AT_decl_column(0x0d)
$C$DW$1053	.dwtag  DW_TAG_member
	.dwattr $C$DW$1053, DW_AT_type(*$C$DW$T$152)
	.dwattr $C$DW$1053, DW_AT_name("extSubjKeyIdSet")
	.dwattr $C$DW$1053, DW_AT_TI_symbol_name("extSubjKeyIdSet")
	.dwattr $C$DW$1053, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d8]
	.dwattr $C$DW$1053, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1053, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1053, DW_AT_decl_line(0x16b)
	.dwattr $C$DW$1053, DW_AT_decl_column(0x0d)
$C$DW$1054	.dwtag  DW_TAG_member
	.dwattr $C$DW$1054, DW_AT_type(*$C$DW$T$164)
	.dwattr $C$DW$1054, DW_AT_name("extAuthKeyId")
	.dwattr $C$DW$1054, DW_AT_TI_symbol_name("extAuthKeyId")
	.dwattr $C$DW$1054, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d9]
	.dwattr $C$DW$1054, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1054, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1054, DW_AT_decl_line(0x16c)
	.dwattr $C$DW$1054, DW_AT_decl_column(0x0d)
$C$DW$1055	.dwtag  DW_TAG_member
	.dwattr $C$DW$1055, DW_AT_type(*$C$DW$T$152)
	.dwattr $C$DW$1055, DW_AT_name("extAuthKeyIdSet")
	.dwattr $C$DW$1055, DW_AT_TI_symbol_name("extAuthKeyIdSet")
	.dwattr $C$DW$1055, DW_AT_data_member_location[DW_OP_plus_uconst 0x2ed]
	.dwattr $C$DW$1055, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1055, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1055, DW_AT_decl_line(0x16d)
	.dwattr $C$DW$1055, DW_AT_decl_column(0x0d)
$C$DW$1056	.dwtag  DW_TAG_member
	.dwattr $C$DW$1056, DW_AT_type(*$C$DW$T$152)
	.dwattr $C$DW$1056, DW_AT_name("extNameConstraintSet")
	.dwattr $C$DW$1056, DW_AT_TI_symbol_name("extNameConstraintSet")
	.dwattr $C$DW$1056, DW_AT_data_member_location[DW_OP_plus_uconst 0x2ee]
	.dwattr $C$DW$1056, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1056, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1056, DW_AT_decl_line(0x16f)
	.dwattr $C$DW$1056, DW_AT_decl_column(0x0d)
$C$DW$1057	.dwtag  DW_TAG_member
	.dwattr $C$DW$1057, DW_AT_type(*$C$DW$T$152)
	.dwattr $C$DW$1057, DW_AT_name("isCA")
	.dwattr $C$DW$1057, DW_AT_TI_symbol_name("isCA")
	.dwattr $C$DW$1057, DW_AT_data_member_location[DW_OP_plus_uconst 0x2ef]
	.dwattr $C$DW$1057, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1057, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1057, DW_AT_decl_line(0x171)
	.dwattr $C$DW$1057, DW_AT_decl_column(0x0d)
$C$DW$1058	.dwtag  DW_TAG_member
	.dwattr $C$DW$1058, DW_AT_type(*$C$DW$T$152)
	.dwattr $C$DW$1058, DW_AT_name("extKeyUsageSet")
	.dwattr $C$DW$1058, DW_AT_TI_symbol_name("extKeyUsageSet")
	.dwattr $C$DW$1058, DW_AT_data_member_location[DW_OP_plus_uconst 0x2f0]
	.dwattr $C$DW$1058, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1058, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1058, DW_AT_decl_line(0x172)
	.dwattr $C$DW$1058, DW_AT_decl_column(0x0d)
$C$DW$1059	.dwtag  DW_TAG_member
	.dwattr $C$DW$1059, DW_AT_type(*$C$DW$T$167)
	.dwattr $C$DW$1059, DW_AT_name("extKeyUsage")
	.dwattr $C$DW$1059, DW_AT_TI_symbol_name("extKeyUsage")
	.dwattr $C$DW$1059, DW_AT_data_member_location[DW_OP_plus_uconst 0x2f2]
	.dwattr $C$DW$1059, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1059, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1059, DW_AT_decl_line(0x173)
	.dwattr $C$DW$1059, DW_AT_decl_column(0x0d)
$C$DW$1060	.dwtag  DW_TAG_member
	.dwattr $C$DW$1060, DW_AT_type(*$C$DW$T$152)
	.dwattr $C$DW$1060, DW_AT_name("extExtKeyUsageSet")
	.dwattr $C$DW$1060, DW_AT_TI_symbol_name("extExtKeyUsageSet")
	.dwattr $C$DW$1060, DW_AT_data_member_location[DW_OP_plus_uconst 0x2f4]
	.dwattr $C$DW$1060, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1060, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1060, DW_AT_decl_line(0x174)
	.dwattr $C$DW$1060, DW_AT_decl_column(0x0d)
$C$DW$1061	.dwtag  DW_TAG_member
	.dwattr $C$DW$1061, DW_AT_type(*$C$DW$T$152)
	.dwattr $C$DW$1061, DW_AT_name("extExtKeyUsage")
	.dwattr $C$DW$1061, DW_AT_TI_symbol_name("extExtKeyUsage")
	.dwattr $C$DW$1061, DW_AT_data_member_location[DW_OP_plus_uconst 0x2f5]
	.dwattr $C$DW$1061, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1061, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1061, DW_AT_decl_line(0x175)
	.dwattr $C$DW$1061, DW_AT_decl_column(0x0d)
$C$DW$1062	.dwtag  DW_TAG_member
	.dwattr $C$DW$1062, DW_AT_type(*$C$DW$T$163)
	.dwattr $C$DW$1062, DW_AT_name("pkCurveOID")
	.dwattr $C$DW$1062, DW_AT_TI_symbol_name("pkCurveOID")
	.dwattr $C$DW$1062, DW_AT_data_member_location[DW_OP_plus_uconst 0x2f8]
	.dwattr $C$DW$1062, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1062, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1062, DW_AT_decl_line(0x18d)
	.dwattr $C$DW$1062, DW_AT_decl_column(0x0d)
$C$DW$1063	.dwtag  DW_TAG_member
	.dwattr $C$DW$1063, DW_AT_type(*$C$DW$T$162)
	.dwattr $C$DW$1063, DW_AT_name("beforeDate")
	.dwattr $C$DW$1063, DW_AT_TI_symbol_name("beforeDate")
	.dwattr $C$DW$1063, DW_AT_data_member_location[DW_OP_plus_uconst 0x2fc]
	.dwattr $C$DW$1063, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1063, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1063, DW_AT_decl_line(0x18f)
	.dwattr $C$DW$1063, DW_AT_decl_column(0x0d)
$C$DW$1064	.dwtag  DW_TAG_member
	.dwattr $C$DW$1064, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1064, DW_AT_name("beforeDateLen")
	.dwattr $C$DW$1064, DW_AT_TI_symbol_name("beforeDateLen")
	.dwattr $C$DW$1064, DW_AT_data_member_location[DW_OP_plus_uconst 0x300]
	.dwattr $C$DW$1064, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1064, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1064, DW_AT_decl_line(0x190)
	.dwattr $C$DW$1064, DW_AT_decl_column(0x0d)
$C$DW$1065	.dwtag  DW_TAG_member
	.dwattr $C$DW$1065, DW_AT_type(*$C$DW$T$162)
	.dwattr $C$DW$1065, DW_AT_name("afterDate")
	.dwattr $C$DW$1065, DW_AT_TI_symbol_name("afterDate")
	.dwattr $C$DW$1065, DW_AT_data_member_location[DW_OP_plus_uconst 0x304]
	.dwattr $C$DW$1065, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1065, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1065, DW_AT_decl_line(0x191)
	.dwattr $C$DW$1065, DW_AT_decl_column(0x0d)
$C$DW$1066	.dwtag  DW_TAG_member
	.dwattr $C$DW$1066, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1066, DW_AT_name("afterDateLen")
	.dwattr $C$DW$1066, DW_AT_TI_symbol_name("afterDateLen")
	.dwattr $C$DW$1066, DW_AT_data_member_location[DW_OP_plus_uconst 0x308]
	.dwattr $C$DW$1066, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1066, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1066, DW_AT_decl_line(0x192)
	.dwattr $C$DW$1066, DW_AT_decl_column(0x0d)
$C$DW$1067	.dwtag  DW_TAG_member
	.dwattr $C$DW$1067, DW_AT_type(*$C$DW$T$162)
	.dwattr $C$DW$1067, DW_AT_name("subjectRaw")
	.dwattr $C$DW$1067, DW_AT_TI_symbol_name("subjectRaw")
	.dwattr $C$DW$1067, DW_AT_data_member_location[DW_OP_plus_uconst 0x30c]
	.dwattr $C$DW$1067, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1067, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1067, DW_AT_decl_line(0x198)
	.dwattr $C$DW$1067, DW_AT_decl_column(0x0d)
$C$DW$1068	.dwtag  DW_TAG_member
	.dwattr $C$DW$1068, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1068, DW_AT_name("subjectRawLen")
	.dwattr $C$DW$1068, DW_AT_TI_symbol_name("subjectRawLen")
	.dwattr $C$DW$1068, DW_AT_data_member_location[DW_OP_plus_uconst 0x310]
	.dwattr $C$DW$1068, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1068, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1068, DW_AT_decl_line(0x199)
	.dwattr $C$DW$1068, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$168

	.dwattr $C$DW$T$168, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$T$168, DW_AT_decl_line(0x140)
	.dwattr $C$DW$T$168, DW_AT_decl_column(0x08)
$C$DW$T$585	.dwtag  DW_TAG_typedef, DW_AT_name("DecodedCert")
	.dwattr $C$DW$T$585, DW_AT_type(*$C$DW$T$168)
	.dwattr $C$DW$T$585, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$585, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$T$585, DW_AT_decl_line(0x13b)
	.dwattr $C$DW$T$585, DW_AT_decl_column(0x1c)

$C$DW$T$169	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$169, DW_AT_name("DecodedName")
	.dwattr $C$DW$T$169, DW_AT_byte_size(0x5c)
$C$DW$1069	.dwtag  DW_TAG_member
	.dwattr $C$DW$1069, DW_AT_type(*$C$DW$T$157)
	.dwattr $C$DW$1069, DW_AT_name("fullName")
	.dwattr $C$DW$1069, DW_AT_TI_symbol_name("fullName")
	.dwattr $C$DW$1069, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1069, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1069, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1069, DW_AT_decl_line(0x121)
	.dwattr $C$DW$1069, DW_AT_decl_column(0x0d)
$C$DW$1070	.dwtag  DW_TAG_member
	.dwattr $C$DW$1070, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1070, DW_AT_name("fullNameLen")
	.dwattr $C$DW$1070, DW_AT_TI_symbol_name("fullNameLen")
	.dwattr $C$DW$1070, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1070, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1070, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1070, DW_AT_decl_line(0x122)
	.dwattr $C$DW$1070, DW_AT_decl_column(0x0d)
$C$DW$1071	.dwtag  DW_TAG_member
	.dwattr $C$DW$1071, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1071, DW_AT_name("entryCount")
	.dwattr $C$DW$1071, DW_AT_TI_symbol_name("entryCount")
	.dwattr $C$DW$1071, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1071, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1071, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1071, DW_AT_decl_line(0x123)
	.dwattr $C$DW$1071, DW_AT_decl_column(0x0d)
$C$DW$1072	.dwtag  DW_TAG_member
	.dwattr $C$DW$1072, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1072, DW_AT_name("cnIdx")
	.dwattr $C$DW$1072, DW_AT_TI_symbol_name("cnIdx")
	.dwattr $C$DW$1072, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1072, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1072, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1072, DW_AT_decl_line(0x124)
	.dwattr $C$DW$1072, DW_AT_decl_column(0x0d)
$C$DW$1073	.dwtag  DW_TAG_member
	.dwattr $C$DW$1073, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1073, DW_AT_name("cnLen")
	.dwattr $C$DW$1073, DW_AT_TI_symbol_name("cnLen")
	.dwattr $C$DW$1073, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1073, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1073, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1073, DW_AT_decl_line(0x125)
	.dwattr $C$DW$1073, DW_AT_decl_column(0x0d)
$C$DW$1074	.dwtag  DW_TAG_member
	.dwattr $C$DW$1074, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1074, DW_AT_name("snIdx")
	.dwattr $C$DW$1074, DW_AT_TI_symbol_name("snIdx")
	.dwattr $C$DW$1074, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1074, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1074, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1074, DW_AT_decl_line(0x126)
	.dwattr $C$DW$1074, DW_AT_decl_column(0x0d)
$C$DW$1075	.dwtag  DW_TAG_member
	.dwattr $C$DW$1075, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1075, DW_AT_name("snLen")
	.dwattr $C$DW$1075, DW_AT_TI_symbol_name("snLen")
	.dwattr $C$DW$1075, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1075, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1075, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1075, DW_AT_decl_line(0x127)
	.dwattr $C$DW$1075, DW_AT_decl_column(0x0d)
$C$DW$1076	.dwtag  DW_TAG_member
	.dwattr $C$DW$1076, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1076, DW_AT_name("cIdx")
	.dwattr $C$DW$1076, DW_AT_TI_symbol_name("cIdx")
	.dwattr $C$DW$1076, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1076, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1076, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1076, DW_AT_decl_line(0x128)
	.dwattr $C$DW$1076, DW_AT_decl_column(0x0d)
$C$DW$1077	.dwtag  DW_TAG_member
	.dwattr $C$DW$1077, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1077, DW_AT_name("cLen")
	.dwattr $C$DW$1077, DW_AT_TI_symbol_name("cLen")
	.dwattr $C$DW$1077, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1077, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1077, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1077, DW_AT_decl_line(0x129)
	.dwattr $C$DW$1077, DW_AT_decl_column(0x0d)
$C$DW$1078	.dwtag  DW_TAG_member
	.dwattr $C$DW$1078, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1078, DW_AT_name("lIdx")
	.dwattr $C$DW$1078, DW_AT_TI_symbol_name("lIdx")
	.dwattr $C$DW$1078, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$1078, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1078, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1078, DW_AT_decl_line(0x12a)
	.dwattr $C$DW$1078, DW_AT_decl_column(0x0d)
$C$DW$1079	.dwtag  DW_TAG_member
	.dwattr $C$DW$1079, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1079, DW_AT_name("lLen")
	.dwattr $C$DW$1079, DW_AT_TI_symbol_name("lLen")
	.dwattr $C$DW$1079, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$1079, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1079, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1079, DW_AT_decl_line(0x12b)
	.dwattr $C$DW$1079, DW_AT_decl_column(0x0d)
$C$DW$1080	.dwtag  DW_TAG_member
	.dwattr $C$DW$1080, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1080, DW_AT_name("stIdx")
	.dwattr $C$DW$1080, DW_AT_TI_symbol_name("stIdx")
	.dwattr $C$DW$1080, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$1080, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1080, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1080, DW_AT_decl_line(0x12c)
	.dwattr $C$DW$1080, DW_AT_decl_column(0x0d)
$C$DW$1081	.dwtag  DW_TAG_member
	.dwattr $C$DW$1081, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1081, DW_AT_name("stLen")
	.dwattr $C$DW$1081, DW_AT_TI_symbol_name("stLen")
	.dwattr $C$DW$1081, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$1081, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1081, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1081, DW_AT_decl_line(0x12d)
	.dwattr $C$DW$1081, DW_AT_decl_column(0x0d)
$C$DW$1082	.dwtag  DW_TAG_member
	.dwattr $C$DW$1082, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1082, DW_AT_name("oIdx")
	.dwattr $C$DW$1082, DW_AT_TI_symbol_name("oIdx")
	.dwattr $C$DW$1082, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$1082, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1082, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1082, DW_AT_decl_line(0x12e)
	.dwattr $C$DW$1082, DW_AT_decl_column(0x0d)
$C$DW$1083	.dwtag  DW_TAG_member
	.dwattr $C$DW$1083, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1083, DW_AT_name("oLen")
	.dwattr $C$DW$1083, DW_AT_TI_symbol_name("oLen")
	.dwattr $C$DW$1083, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$1083, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1083, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1083, DW_AT_decl_line(0x12f)
	.dwattr $C$DW$1083, DW_AT_decl_column(0x0d)
$C$DW$1084	.dwtag  DW_TAG_member
	.dwattr $C$DW$1084, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1084, DW_AT_name("ouIdx")
	.dwattr $C$DW$1084, DW_AT_TI_symbol_name("ouIdx")
	.dwattr $C$DW$1084, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$1084, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1084, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1084, DW_AT_decl_line(0x130)
	.dwattr $C$DW$1084, DW_AT_decl_column(0x0d)
$C$DW$1085	.dwtag  DW_TAG_member
	.dwattr $C$DW$1085, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1085, DW_AT_name("ouLen")
	.dwattr $C$DW$1085, DW_AT_TI_symbol_name("ouLen")
	.dwattr $C$DW$1085, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$1085, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1085, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1085, DW_AT_decl_line(0x131)
	.dwattr $C$DW$1085, DW_AT_decl_column(0x0d)
$C$DW$1086	.dwtag  DW_TAG_member
	.dwattr $C$DW$1086, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1086, DW_AT_name("emailIdx")
	.dwattr $C$DW$1086, DW_AT_TI_symbol_name("emailIdx")
	.dwattr $C$DW$1086, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$1086, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1086, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1086, DW_AT_decl_line(0x132)
	.dwattr $C$DW$1086, DW_AT_decl_column(0x0d)
$C$DW$1087	.dwtag  DW_TAG_member
	.dwattr $C$DW$1087, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1087, DW_AT_name("emailLen")
	.dwattr $C$DW$1087, DW_AT_TI_symbol_name("emailLen")
	.dwattr $C$DW$1087, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$1087, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1087, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1087, DW_AT_decl_line(0x133)
	.dwattr $C$DW$1087, DW_AT_decl_column(0x0d)
$C$DW$1088	.dwtag  DW_TAG_member
	.dwattr $C$DW$1088, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1088, DW_AT_name("uidIdx")
	.dwattr $C$DW$1088, DW_AT_TI_symbol_name("uidIdx")
	.dwattr $C$DW$1088, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr $C$DW$1088, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1088, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1088, DW_AT_decl_line(0x134)
	.dwattr $C$DW$1088, DW_AT_decl_column(0x0d)
$C$DW$1089	.dwtag  DW_TAG_member
	.dwattr $C$DW$1089, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1089, DW_AT_name("uidLen")
	.dwattr $C$DW$1089, DW_AT_TI_symbol_name("uidLen")
	.dwattr $C$DW$1089, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$1089, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1089, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1089, DW_AT_decl_line(0x135)
	.dwattr $C$DW$1089, DW_AT_decl_column(0x0d)
$C$DW$1090	.dwtag  DW_TAG_member
	.dwattr $C$DW$1090, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1090, DW_AT_name("serialIdx")
	.dwattr $C$DW$1090, DW_AT_TI_symbol_name("serialIdx")
	.dwattr $C$DW$1090, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
	.dwattr $C$DW$1090, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1090, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1090, DW_AT_decl_line(0x136)
	.dwattr $C$DW$1090, DW_AT_decl_column(0x0d)
$C$DW$1091	.dwtag  DW_TAG_member
	.dwattr $C$DW$1091, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1091, DW_AT_name("serialLen")
	.dwattr $C$DW$1091, DW_AT_TI_symbol_name("serialLen")
	.dwattr $C$DW$1091, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
	.dwattr $C$DW$1091, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1091, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1091, DW_AT_decl_line(0x137)
	.dwattr $C$DW$1091, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$169

	.dwattr $C$DW$T$169, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$T$169, DW_AT_decl_line(0x120)
	.dwattr $C$DW$T$169, DW_AT_decl_column(0x08)
$C$DW$T$586	.dwtag  DW_TAG_typedef, DW_AT_name("DecodedName")
	.dwattr $C$DW$T$586, DW_AT_type(*$C$DW$T$169)
	.dwattr $C$DW$T$586, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$586, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$T$586, DW_AT_decl_line(0x13c)
	.dwattr $C$DW$T$586, DW_AT_decl_column(0x1c)

$C$DW$T$170	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$170, DW_AT_name("DhKey")
	.dwattr $C$DW$T$170, DW_AT_byte_size(0x450)
$C$DW$1092	.dwtag  DW_TAG_member
	.dwattr $C$DW$1092, DW_AT_type(*$C$DW$T$128)
	.dwattr $C$DW$1092, DW_AT_name("p")
	.dwattr $C$DW$1092, DW_AT_TI_symbol_name("p")
	.dwattr $C$DW$1092, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1092, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1092, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/dh.h")
	.dwattr $C$DW$1092, DW_AT_decl_line(0x27)
	.dwattr $C$DW$1092, DW_AT_decl_column(0x0c)
$C$DW$1093	.dwtag  DW_TAG_member
	.dwattr $C$DW$1093, DW_AT_type(*$C$DW$T$128)
	.dwattr $C$DW$1093, DW_AT_name("g")
	.dwattr $C$DW$1093, DW_AT_TI_symbol_name("g")
	.dwattr $C$DW$1093, DW_AT_data_member_location[DW_OP_plus_uconst 0x228]
	.dwattr $C$DW$1093, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1093, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/dh.h")
	.dwattr $C$DW$1093, DW_AT_decl_line(0x27)
	.dwattr $C$DW$1093, DW_AT_decl_column(0x0f)
	.dwendtag $C$DW$T$170

	.dwattr $C$DW$T$170, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/dh.h")
	.dwattr $C$DW$T$170, DW_AT_decl_line(0x26)
	.dwattr $C$DW$T$170, DW_AT_decl_column(0x10)
$C$DW$T$587	.dwtag  DW_TAG_typedef, DW_AT_name("DhKey")
	.dwattr $C$DW$T$587, DW_AT_type(*$C$DW$T$170)
	.dwattr $C$DW$T$587, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$587, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/dh.h")
	.dwattr $C$DW$T$587, DW_AT_decl_line(0x28)
	.dwattr $C$DW$T$587, DW_AT_decl_column(0x03)

$C$DW$T$171	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$171, DW_AT_name("DsaKey")
	.dwattr $C$DW$T$171, DW_AT_byte_size(0xacc)
$C$DW$1094	.dwtag  DW_TAG_member
	.dwattr $C$DW$1094, DW_AT_type(*$C$DW$T$128)
	.dwattr $C$DW$1094, DW_AT_name("p")
	.dwattr $C$DW$1094, DW_AT_TI_symbol_name("p")
	.dwattr $C$DW$1094, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1094, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1094, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/dsa.h")
	.dwattr $C$DW$1094, DW_AT_decl_line(0x2c)
	.dwattr $C$DW$1094, DW_AT_decl_column(0x0c)
$C$DW$1095	.dwtag  DW_TAG_member
	.dwattr $C$DW$1095, DW_AT_type(*$C$DW$T$128)
	.dwattr $C$DW$1095, DW_AT_name("q")
	.dwattr $C$DW$1095, DW_AT_TI_symbol_name("q")
	.dwattr $C$DW$1095, DW_AT_data_member_location[DW_OP_plus_uconst 0x228]
	.dwattr $C$DW$1095, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1095, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/dsa.h")
	.dwattr $C$DW$1095, DW_AT_decl_line(0x2c)
	.dwattr $C$DW$1095, DW_AT_decl_column(0x0f)
$C$DW$1096	.dwtag  DW_TAG_member
	.dwattr $C$DW$1096, DW_AT_type(*$C$DW$T$128)
	.dwattr $C$DW$1096, DW_AT_name("g")
	.dwattr $C$DW$1096, DW_AT_TI_symbol_name("g")
	.dwattr $C$DW$1096, DW_AT_data_member_location[DW_OP_plus_uconst 0x450]
	.dwattr $C$DW$1096, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1096, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/dsa.h")
	.dwattr $C$DW$1096, DW_AT_decl_line(0x2c)
	.dwattr $C$DW$1096, DW_AT_decl_column(0x12)
$C$DW$1097	.dwtag  DW_TAG_member
	.dwattr $C$DW$1097, DW_AT_type(*$C$DW$T$128)
	.dwattr $C$DW$1097, DW_AT_name("y")
	.dwattr $C$DW$1097, DW_AT_TI_symbol_name("y")
	.dwattr $C$DW$1097, DW_AT_data_member_location[DW_OP_plus_uconst 0x678]
	.dwattr $C$DW$1097, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1097, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/dsa.h")
	.dwattr $C$DW$1097, DW_AT_decl_line(0x2c)
	.dwattr $C$DW$1097, DW_AT_decl_column(0x15)
$C$DW$1098	.dwtag  DW_TAG_member
	.dwattr $C$DW$1098, DW_AT_type(*$C$DW$T$128)
	.dwattr $C$DW$1098, DW_AT_name("x")
	.dwattr $C$DW$1098, DW_AT_TI_symbol_name("x")
	.dwattr $C$DW$1098, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a0]
	.dwattr $C$DW$1098, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1098, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/dsa.h")
	.dwattr $C$DW$1098, DW_AT_decl_line(0x2c)
	.dwattr $C$DW$1098, DW_AT_decl_column(0x18)
$C$DW$1099	.dwtag  DW_TAG_member
	.dwattr $C$DW$1099, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1099, DW_AT_name("type")
	.dwattr $C$DW$1099, DW_AT_TI_symbol_name("type")
	.dwattr $C$DW$1099, DW_AT_data_member_location[DW_OP_plus_uconst 0xac8]
	.dwattr $C$DW$1099, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1099, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/dsa.h")
	.dwattr $C$DW$1099, DW_AT_decl_line(0x2d)
	.dwattr $C$DW$1099, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$171

	.dwattr $C$DW$T$171, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/dsa.h")
	.dwattr $C$DW$T$171, DW_AT_decl_line(0x2b)
	.dwattr $C$DW$T$171, DW_AT_decl_column(0x10)
$C$DW$T$588	.dwtag  DW_TAG_typedef, DW_AT_name("DsaKey")
	.dwattr $C$DW$T$588, DW_AT_type(*$C$DW$T$171)
	.dwattr $C$DW$T$588, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$588, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/dsa.h")
	.dwattr $C$DW$T$588, DW_AT_decl_line(0x2e)
	.dwattr $C$DW$T$588, DW_AT_decl_column(0x03)

$C$DW$T$589	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$589, DW_AT_name("ECC_TYPES")
	.dwattr $C$DW$T$589, DW_AT_byte_size(0x01)
$C$DW$1100	.dwtag  DW_TAG_enumerator, DW_AT_name("ECC_PREFIX_0"), DW_AT_const_value(0xa0)
	.dwattr $C$DW$1100, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1100, DW_AT_decl_line(0x6b)
	.dwattr $C$DW$1100, DW_AT_decl_column(0x05)
$C$DW$1101	.dwtag  DW_TAG_enumerator, DW_AT_name("ECC_PREFIX_1"), DW_AT_const_value(0xa1)
	.dwattr $C$DW$1101, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$1101, DW_AT_decl_line(0x6c)
	.dwattr $C$DW$1101, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$589

	.dwattr $C$DW$T$589, DW_AT_decl_file("C:/cyassl/cyassl/ctaocrypt/asn.h")
	.dwattr $C$DW$T$589, DW_AT_decl_line(0x6a)
	.dwattr $C$DW$T$589, DW_AT_decl_column(0x06)

$C$DW$T$590	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$590, DW_AT_name("ENCRYPTION_TYPES")
	.dwattr $C$DW$T$590, DW_AT_byte_size(0x01)
$C$DW$1102	.dwtag  DW_TAG_enumerator, DW_AT_name("DES_TYPE"), DW_AT_const_value(0x00)
