;******************************************************************************
;* TI ARM C/C++ Codegen                                             PC v5.1.6 *
;* Date/Time created: Tue Aug 12 14:12:12 2014                                *
;******************************************************************************
	.compiler_opts --abi=eabi --arm_vmrs_si_workaround=on --code_state=16 --diag_wrap=off --disable_dual_state --embedded_constants=on --endian=little --float_support=FPv4SPD16 --hll_source=on --object_format=elf --silicon_version=7M4 --symdebug:dwarf --symdebug:dwarf_version=3 --unaligned_access=on 
	.thumb

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../EK_TM4C1294XL.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v5.1.6 Copyright (c) 1996-2014 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("C:\cyassl\tirtos\ccs_examples\benchmark\Debug")

$C$DW$1	.dwtag  DW_TAG_subprogram, DW_AT_name("GPIOIntTypeSet")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("GPIOIntTypeSet")
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("c:/ti/tirtos_tivac_2_00_02_36/products/TivaWare_C_Series-2.1.0.12573c/driverlib/gpio.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0x90)
	.dwattr $C$DW$1, DW_AT_decl_column(0x0d)
$C$DW$2	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$2, DW_AT_type(*$C$DW$T$135)

;* STRINGS                                                                    *
;******************************************************************************
	.sect	".text:EK_TM4C1294XL_usbBusFaultHwi"
	.align	4
||$C$SL1||:	.string	"USB bus fault detected.",0
	.align	4
||$C$SL2||:	.string	"USB error!!",0
;******************************************************************************
;* STRINGS                                                                    *
;******************************************************************************
	.sect	".text:EK_TM4C1294XL_initUSB"
	.align	4
||$C$SL3||:	.string	"Couldn't construct USB bus fault hwi",0
;******************************************************************************
;* STRINGS                                                                    *
;******************************************************************************
	.sect	".text:EK_TM4C1294XL_initEMAC"
	.align	4
||$C$SL4||:	.string	"Change the macAddress variable to match your boards MAC sti"
	.string	"cker",0
	.align	4
||$C$SL5||:	.string	"Using MAC address in flash",10,0
;******************************************************************************
;* STRINGS                                                                    *
;******************************************************************************
	.sect	".text:EK_TM4C1294XL_initDMA"
	.align	4
||$C$SL6||:	.string	"Couldn't construct DMA error hwi",0
;******************************************************************************
;* STRINGS                                                                    *
;******************************************************************************
	.sect	".text:EK_TM4C1294XL_errorDMAHwi"
	.align	4
||$C$SL7||:	.string	"DMA error code: %d",10,0
	.align	4
||$C$SL8||:	.string	"DMA error!!",0
;*****************************************************************************
;* UNDEFINED EXTERNAL REFERENCES                                             *
;*****************************************************************************
	.global	GPIOIntTypeSet
	.global	GPIOPadConfigSet
	.global	GPIOIntClear
	.global	GPIOPinConfigure
	.global	GPIOPinTypeEthernetLED
	.global	GPIOPinTypeGPIOInput
	.global	GPIOPinTypeGPIOOutput
	.global	GPIOPinTypeUSBAnalog
	.global	GPIOPinTypeUSBDigital
	.global	FlashUserGet
	.global	SysCtlPeripheralEnable
	.global	SysCtlUSBPLLEnable
	.global	uDMAEnable
	.global	uDMAErrorStatusGet
	.global	uDMAErrorStatusClear
	.global	uDMAControlBaseSet
	.global	xdc_runtime_Error_check__E
	.global	xdc_runtime_Error_init__E
	.global	xdc_runtime_System_abort__E
	.global	xdc_runtime_System_printf__E
	.global	ti_sysbios_family_arm_m3_Hwi_construct
	.global	ti_sysbios_family_arm_m3_Hwi_Params__init__S
	.global	ti_sysbios_family_arm_m3_Hwi_clearInterrupt__E
	.global	GPIO_init
	.global	EMAC_init
	.global	EMACSnow_NIMUInit
	.global	gpioButtonFxn0
	.global	gpioButtonFxn1
	.global	EMACSnow_fxnTable

;******************************************************************************
;* BUILD ATTRIBUTES                                                           *
;******************************************************************************
	.battr "aeabi", Tag_File, 1, Tag_ABI_PCS_wchar_t(2)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_rounding(0)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_denormal(0)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_exceptions(0)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_number_model(1)
	.battr "aeabi", Tag_File, 1, Tag_ABI_enum_size(1)
	.battr "aeabi", Tag_File, 1, Tag_ABI_optimization_goals(2)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_optimization_goals(0)
	.battr "TI", Tag_File, 1, Tag_Bitfield_layout(2)
	.battr "TI", Tag_File, 1, Tag_FP_interface(1)

;******************************************************************************
;* TYPE INFORMATION                                                           *
;******************************************************************************

$C$DW$T$790	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$790, DW_AT_byte_size(0x01)
$C$DW$170	.dwtag  DW_TAG_enumerator, DW_AT_name("FlashReadWrite"), DW_AT_const_value(0x00)
	.dwattr $C$DW$170, DW_AT_decl_file("c:/ti/tirtos_tivac_2_00_02_36/products/TivaWare_C_Series-2.1.0.12573c/driverlib/flash.h")
	.dwattr $C$DW$170, DW_AT_decl_line(0x3e)
	.dwattr $C$DW$170, DW_AT_decl_column(0x05)
$C$DW$171	.dwtag  DW_TAG_enumerator, DW_AT_name("FlashReadOnly"), DW_AT_const_value(0x01)
	.dwattr $C$DW$171, DW_AT_decl_file("c:/ti/tirtos_tivac_2_00_02_36/products/TivaWare_C_Series-2.1.0.12573c/driverlib/flash.h")
	.dwattr $C$DW$171, DW_AT_decl_line(0x3f)
	.dwattr $C$DW$171, DW_AT_decl_column(0x05)
$C$DW$172	.dwtag  DW_TAG_enumerator, DW_AT_name("FlashExecuteOnly"), DW_AT_const_value(0x02)
	.dwattr $C$DW$172, DW_AT_decl_file("c:/ti/tirtos_tivac_2_00_02_36/products/TivaWare_C_Series-2.1.0.12573c/driverlib/flash.h")
	.dwattr $C$DW$172, DW_AT_decl_line(0x40)
	.dwattr $C$DW$172, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$790

	.dwattr $C$DW$T$790, DW_AT_decl_file("c:/ti/tirtos_tivac_2_00_02_36/products/TivaWare_C_Series-2.1.0.12573c/driverlib/flash.h")
	.dwattr $C$DW$T$790, DW_AT_decl_line(0x3d)
	.dwattr $C$DW$T$790, DW_AT_decl_column(0x01)
$C$DW$T$791	.dwtag  DW_TAG_typedef, DW_AT_name("tFlashProtection")
	.dwattr $C$DW$T$791, DW_AT_type(*$C$DW$T$790)
	.dwattr $C$DW$T$791, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$791, DW_AT_decl_file("c:/ti/tirtos_tivac_2_00_02_36/products/TivaWare_C_Series-2.1.0.12573c/driverlib/flash.h")
	.dwattr $C$DW$T$791, DW_AT_decl_line(0x42)
	.dwattr $C$DW$T$791, DW_AT_decl_column(0x01)

$C$DW$T$137	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$137, DW_AT_byte_size(0x10)
$C$DW$173	.dwtag  DW_TAG_member
	.dwattr $C$DW$173, DW_AT_type(*$C$DW$T$134)
	.dwattr $C$DW$173, DW_AT_name("pvSrcEndAddr")
	.dwattr $C$DW$173, DW_AT_TI_symbol_name("pvSrcEndAddr")
	.dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$173, DW_AT_decl_file("c:/ti/tirtos_tivac_2_00_02_36/products/TivaWare_C_Series-2.1.0.12573c/driverlib/udma.h")
	.dwattr $C$DW$173, DW_AT_decl_line(0x49)
	.dwattr $C$DW$173, DW_AT_decl_column(0x14)
$C$DW$174	.dwtag  DW_TAG_member
	.dwattr $C$DW$174, DW_AT_type(*$C$DW$T$134)
	.dwattr $C$DW$174, DW_AT_name("pvDstEndAddr")
	.dwattr $C$DW$174, DW_AT_TI_symbol_name("pvDstEndAddr")
	.dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$174, DW_AT_decl_file("c:/ti/tirtos_tivac_2_00_02_36/products/TivaWare_C_Series-2.1.0.12573c/driverlib/udma.h")
	.dwattr $C$DW$174, DW_AT_decl_line(0x4e)
	.dwattr $C$DW$174, DW_AT_decl_column(0x14)
$C$DW$175	.dwtag  DW_TAG_member
	.dwattr $C$DW$175, DW_AT_type(*$C$DW$T$136)
	.dwattr $C$DW$175, DW_AT_name("ui32Control")
	.dwattr $C$DW$175, DW_AT_TI_symbol_name("ui32Control")
	.dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$175, DW_AT_decl_file("c:/ti/tirtos_tivac_2_00_02_36/products/TivaWare_C_Series-2.1.0.12573c/driverlib/udma.h")
	.dwattr $C$DW$175, DW_AT_decl_line(0x53)
	.dwattr $C$DW$175, DW_AT_decl_column(0x17)
$C$DW$176	.dwtag  DW_TAG_member
	.dwattr $C$DW$176, DW_AT_type(*$C$DW$T$136)
	.dwattr $C$DW$176, DW_AT_name("ui32Spare")
	.dwattr $C$DW$176, DW_AT_TI_symbol_name("ui32Spare")
	.dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$176, DW_AT_decl_file("c:/ti/tirtos_tivac_2_00_02_36/products/TivaWare_C_Series-2.1.0.12573c/driverlib/udma.h")
	.dwattr $C$DW$176, DW_AT_decl_line(0x58)
	.dwattr $C$DW$176, DW_AT_decl_column(0x17)
	.dwendtag $C$DW$T$137

	.dwattr $C$DW$T$137, DW_AT_decl_file("c:/ti/tirtos_tivac_2_00_02_36/products/TivaWare_C_Series-2.1.0.12573c/driverlib/udma.h")
	.dwattr $C$DW$T$137, DW_AT_decl_line(0x45)
	.dwattr $C$DW$T$137, DW_AT_decl_column(0x01)

$C$DW$T$204	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$204, DW_AT_type(*$C$DW$T$137)
	.dwattr $C$DW$T$204, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$204, DW_AT_byte_size(0x200)
$C$DW$177	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$177, DW_AT_upper_bound(0x1f)
	.dwendtag $C$DW$T$204

$C$DW$T$793	.dwtag  DW_TAG_typedef, DW_AT_name("tDMAControlTable")
	.dwattr $C$DW$T$793, DW_AT_type(*$C$DW$T$137)
	.dwattr $C$DW$T$793, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$793, DW_AT_decl_file("c:/ti/tirtos_tivac_2_00_02_36/products/TivaWare_C_Series-2.1.0.12573c/driverlib/udma.h")
	.dwattr $C$DW$T$793, DW_AT_decl_line(0x5a)
	.dwattr $C$DW$T$793, DW_AT_decl_column(0x01)

$C$DW$T$794	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$794, DW_AT_type(*$C$DW$T$793)
	.dwattr $C$DW$T$794, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$794, DW_AT_byte_size(0x200)
$C$DW$178	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$178, DW_AT_upper_bound(0x1f)
	.dwendtag $C$DW$T$794


$C$DW$T$140	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$140, DW_AT_byte_size(0x08)
$C$DW$179	.dwtag  DW_TAG_member
	.dwattr $C$DW$179, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$179, DW_AT_name("length")
	.dwattr $C$DW$179, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$179, DW_AT_decl_file("C:/ti/tirtos_tivac_2_00_02_36/products/bios_6_40_02_27/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$179, DW_AT_decl_line(0xe2)
	.dwattr $C$DW$179, DW_AT_decl_column(0x16)
$C$DW$180	.dwtag  DW_TAG_member
	.dwattr $C$DW$180, DW_AT_type(*$C$DW$T$139)
	.dwattr $C$DW$180, DW_AT_name("elem")
	.dwattr $C$DW$180, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$180, DW_AT_decl_file("C:/ti/tirtos_tivac_2_00_02_36/products/bios_6_40_02_27/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$180, DW_AT_decl_line(0xe2)
	.dwattr $C$DW$180, DW_AT_decl_column(0x3a)
	.dwendtag $C$DW$T$140

	.dwattr $C$DW$T$140, DW_AT_decl_file("C:/ti/tirtos_tivac_2_00_02_36/products/bios_6_40_02_27/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$140, DW_AT_decl_line(0xe2)
	.dwattr $C$DW$T$140, DW_AT_decl_column(0x10)
$C$DW$T$795	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$795, DW_AT_type(*$C$DW$T$140)
	.dwattr $C$DW$T$795, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$795, DW_AT_decl_file("C:/ti/tirtos_tivac_2_00_02_36/products/bios_6_40_02_27/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$795, DW_AT_decl_line(0xe2)
	.dwattr $C$DW$T$795, DW_AT_decl_column(0x42)
$C$DW$T$796	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$796, DW_AT_type(*$C$DW$T$795)
	.dwattr $C$DW$T$796, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$796, DW_AT_decl_file("C:/ti/tirtos_tivac_2_00_02_36/products/bios_6_40_02_27/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$796, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$T$796, DW_AT_decl_column(0x2b)
$C$DW$T$797	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$797, DW_AT_type(*$C$DW$T$796)
	.dwattr $C$DW$T$797, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$797, DW_AT_decl_file("C:/ti/tirtos_tivac_2_00_02_36/products/bios_6_40_02_27/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$797, DW_AT_decl_line(0xe4)
	.dwattr $C$DW$T$797, DW_AT_decl_column(0x27)

$C$DW$T$143	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$143, DW_AT_byte_size(0x08)
$C$DW$181	.dwtag  DW_TAG_member
	.dwattr $C$DW$181, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$181, DW_AT_name("length")
	.dwattr $C$DW$181, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$181, DW_AT_decl_file("C:/ti/tirtos_tivac_2_00_02_36/products/bios_6_40_02_27/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$181, DW_AT_decl_line(0x19f)
	.dwattr $C$DW$181, DW_AT_decl_column(0x16)
$C$DW$182	.dwtag  DW_TAG_member
	.dwattr $C$DW$182, DW_AT_type(*$C$DW$T$142)
	.dwattr $C$DW$182, DW_AT_name("elem")
	.dwattr $C$DW$182, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$182, DW_AT_decl_file("C:/ti/tirtos_tivac_2_00_02_36/products/bios_6_40_02_27/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$182, DW_AT_decl_line(0x19f)
	.dwattr $C$DW$182, DW_AT_decl_column(0x3b)
	.dwendtag $C$DW$T$143

	.dwattr $C$DW$T$143, DW_AT_decl_file("C:/ti/tirtos_tivac_2_00_02_36/products/bios_6_40_02_27/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$143, DW_AT_decl_line(0x19f)
	.dwattr $C$DW$T$143, DW_AT_decl_column(0x10)
$C$DW$T$798	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$798, DW_AT_type(*$C$DW$T$143)
	.dwattr $C$DW$T$798, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$798, DW_AT_decl_file("C:/ti/tirtos_tivac_2_00_02_36/products/bios_6_40_02_27/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$798, DW_AT_decl_line(0x19f)
	.dwattr $C$DW$T$798, DW_AT_decl_column(0x43)
$C$DW$T$799	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$799, DW_AT_type(*$C$DW$T$798)
	.dwattr $C$DW$T$799, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$799, DW_AT_decl_file("C:/ti/tirtos_tivac_2_00_02_36/products/bios_6_40_02_27/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$799, DW_AT_decl_line(0x1a0)
	.dwattr $C$DW$T$799, DW_AT_decl_column(0x2c)
$C$DW$T$800	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$800, DW_AT_type(*$C$DW$T$799)
	.dwattr $C$DW$T$800, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$800, DW_AT_decl_file("C:/ti/tirtos_tivac_2_00_02_36/products/bios_6_40_02_27/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$800, DW_AT_decl_line(0x1a1)
	.dwattr $C$DW$T$800, DW_AT_decl_column(0x28)

$C$DW$T$147	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$147, DW_AT_byte_size(0x08)
$C$DW$183	.dwtag  DW_TAG_member
	.dwattr $C$DW$183, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$183, DW_AT_name("length")
	.dwattr $C$DW$183, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$183, DW_AT_decl_file("C:/ti/tirtos_tivac_2_00_02_36/products/bios_6_40_02_27/packages/ti/sysbios/family/arm/m3/Hwi.h")
	.dwattr $C$DW$183, DW_AT_decl_line(0x273)
	.dwattr $C$DW$183, DW_AT_decl_column(0x16)
$C$DW$184	.dwtag  DW_TAG_member
	.dwattr $C$DW$184, DW_AT_type(*$C$DW$T$146)
	.dwattr $C$DW$184, DW_AT_name("elem")
	.dwattr $C$DW$184, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$184, DW_AT_decl_file("C:/ti/tirtos_tivac_2_00_02_36/products/bios_6_40_02_27/packages/ti/sysbios/family/arm/m3/Hwi.h")
	.dwattr $C$DW$184, DW_AT_decl_line(0x273)
	.dwattr $C$DW$184, DW_AT_decl_column(0x44)
	.dwendtag $C$DW$T$147

	.dwattr $C$DW$T$147, DW_AT_decl_file("C:/ti/tirtos_tivac_2_00_02_36/products/bios_6_40_02_27/packages/ti/sysbios/family/arm/m3/Hwi.h")
	.dwattr $C$DW$T$147, DW_AT_decl_line(0x273)
	.dwattr $C$DW$T$147, DW_AT_decl_column(0x10)
$C$DW$T$801	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_ti_sysbios_family_arm_m3_Hwi_hooks")
	.dwattr $C$DW$T$801, DW_AT_type(*$C$DW$T$147)
	.dwattr $C$DW$T$801, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$801, DW_AT_decl_file("C:/ti/tirtos_tivac_2_00_02_36/products/bios_6_40_02_27/packages/ti/sysbios/family/arm/m3/Hwi.h")
	.dwattr $C$DW$T$801, DW_AT_decl_line(0x273)
	.dwattr $C$DW$T$801, DW_AT_decl_column(0x4c)
$C$DW$T$802	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_ti_sysbios_family_arm_m3_Hwi_hooks")
	.dwattr $C$DW$T$802, DW_AT_type(*$C$DW$T$801)
	.dwattr $C$DW$T$802, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$802, DW_AT_decl_file("C:/ti/tirtos_tivac_2_00_02_36/products/bios_6_40_02_27/packages/ti/sysbios/family/arm/m3/Hwi.h")
	.dwattr $C$DW$T$802, DW_AT_decl_line(0x274)
	.dwattr $C$DW$T$802, DW_AT_decl_column(0x35)
$C$DW$T$803	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_family_arm_m3_Hwi_hooks")
	.dwattr $C$DW$T$803, DW_AT_type(*$C$DW$T$802)
	.dwattr $C$DW$T$803, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$803, DW_AT_decl_file("C:/ti/tirtos_tivac_2_00_02_36/products/bios_6_40_02_27/packages/ti/sysbios/family/arm/m3/Hwi.h")
	.dwattr $C$DW$T$803, DW_AT_decl_line(0x275)
	.dwattr $C$DW$T$803, DW_AT_decl_column(0x31)

$C$DW$T$151	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$151, DW_AT_byte_size(0x0e)
$C$DW$185	.dwtag  DW_TAG_member
	.dwattr $C$DW$185, DW_AT_type(*$C$DW$T$149)
	.dwattr $C$DW$185, DW_AT_name("DstMac")
	.dwattr $C$DW$185, DW_AT_TI_symbol_name("DstMac")
	.dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$185, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$185, DW_AT_decl_line(0x2f)
	.dwattr $C$DW$185, DW_AT_decl_column(0x19)
$C$DW$186	.dwtag  DW_TAG_member
	.dwattr $C$DW$186, DW_AT_type(*$C$DW$T$149)
	.dwattr $C$DW$186, DW_AT_name("SrcMac")
	.dwattr $C$DW$186, DW_AT_TI_symbol_name("SrcMac")
	.dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$186, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$186, DW_AT_decl_line(0x30)
	.dwattr $C$DW$186, DW_AT_decl_column(0x19)
$C$DW$187	.dwtag  DW_TAG_member
	.dwattr $C$DW$187, DW_AT_type(*$C$DW$T$150)
	.dwattr $C$DW$187, DW_AT_name("Type")
	.dwattr $C$DW$187, DW_AT_TI_symbol_name("Type")
	.dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$187, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$187, DW_AT_decl_line(0x31)
	.dwattr $C$DW$187, DW_AT_decl_column(0x19)
	.dwendtag $C$DW$T$151

	.dwattr $C$DW$T$151, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$T$151, DW_AT_decl_line(0x2e)
	.dwattr $C$DW$T$151, DW_AT_decl_column(0x10)
$C$DW$T$804	.dwtag  DW_TAG_typedef, DW_AT_name("ETHHDR")
	.dwattr $C$DW$T$804, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$T$804, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$804, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$T$804, DW_AT_decl_line(0x32)
	.dwattr $C$DW$T$804, DW_AT_decl_column(0x12)

$C$DW$T$152	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$152, DW_AT_byte_size(0x04)
$C$DW$188	.dwtag  DW_TAG_member
	.dwattr $C$DW$188, DW_AT_type(*$C$DW$T$150)
	.dwattr $C$DW$188, DW_AT_name("TCI")
	.dwattr $C$DW$188, DW_AT_TI_symbol_name("TCI")
	.dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$188, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$188, DW_AT_decl_line(0x39)
	.dwattr $C$DW$188, DW_AT_decl_column(0x19)
$C$DW$189	.dwtag  DW_TAG_member
	.dwattr $C$DW$189, DW_AT_type(*$C$DW$T$150)
	.dwattr $C$DW$189, DW_AT_name("EncapProtocol")
	.dwattr $C$DW$189, DW_AT_TI_symbol_name("EncapProtocol")
	.dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$189, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$189, DW_AT_decl_line(0x3a)
	.dwattr $C$DW$189, DW_AT_decl_column(0x19)
	.dwendtag $C$DW$T$152

	.dwattr $C$DW$T$152, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$T$152, DW_AT_decl_line(0x38)
	.dwattr $C$DW$T$152, DW_AT_decl_column(0x10)
$C$DW$T$805	.dwtag  DW_TAG_typedef, DW_AT_name("VLANHDR")
	.dwattr $C$DW$T$805, DW_AT_type(*$C$DW$T$152)
	.dwattr $C$DW$T$805, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$805, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$T$805, DW_AT_decl_line(0x3b)
	.dwattr $C$DW$T$805, DW_AT_decl_column(0x12)

$C$DW$T$154	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$154, DW_AT_byte_size(0x1c)
$C$DW$190	.dwtag  DW_TAG_member
	.dwattr $C$DW$190, DW_AT_type(*$C$DW$T$150)
	.dwattr $C$DW$190, DW_AT_name("HardType")
	.dwattr $C$DW$190, DW_AT_TI_symbol_name("HardType")
	.dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$190, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$190, DW_AT_decl_line(0x43)
	.dwattr $C$DW$190, DW_AT_decl_column(0x1a)
$C$DW$191	.dwtag  DW_TAG_member
	.dwattr $C$DW$191, DW_AT_type(*$C$DW$T$150)
	.dwattr $C$DW$191, DW_AT_name("ProtocolType")
	.dwattr $C$DW$191, DW_AT_TI_symbol_name("ProtocolType")
	.dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$191, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$191, DW_AT_decl_line(0x44)
	.dwattr $C$DW$191, DW_AT_decl_column(0x1a)
$C$DW$192	.dwtag  DW_TAG_member
	.dwattr $C$DW$192, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$192, DW_AT_name("HardSize")
	.dwattr $C$DW$192, DW_AT_TI_symbol_name("HardSize")
	.dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$192, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$192, DW_AT_decl_line(0x45)
	.dwattr $C$DW$192, DW_AT_decl_column(0x1a)
$C$DW$193	.dwtag  DW_TAG_member
	.dwattr $C$DW$193, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$193, DW_AT_name("ProtocolSize")
	.dwattr $C$DW$193, DW_AT_TI_symbol_name("ProtocolSize")
	.dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$193, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$193, DW_AT_decl_line(0x46)
	.dwattr $C$DW$193, DW_AT_decl_column(0x1a)
$C$DW$194	.dwtag  DW_TAG_member
	.dwattr $C$DW$194, DW_AT_type(*$C$DW$T$150)
	.dwattr $C$DW$194, DW_AT_name("Op")
	.dwattr $C$DW$194, DW_AT_TI_symbol_name("Op")
	.dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$194, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$194, DW_AT_decl_line(0x47)
	.dwattr $C$DW$194, DW_AT_decl_column(0x1a)
$C$DW$195	.dwtag  DW_TAG_member
	.dwattr $C$DW$195, DW_AT_type(*$C$DW$T$149)
	.dwattr $C$DW$195, DW_AT_name("SrcAddr")
	.dwattr $C$DW$195, DW_AT_TI_symbol_name("SrcAddr")
	.dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$195, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$195, DW_AT_decl_line(0x48)
	.dwattr $C$DW$195, DW_AT_decl_column(0x1a)
$C$DW$196	.dwtag  DW_TAG_member
	.dwattr $C$DW$196, DW_AT_type(*$C$DW$T$153)
	.dwattr $C$DW$196, DW_AT_name("IPSrc")
	.dwattr $C$DW$196, DW_AT_TI_symbol_name("IPSrc")
	.dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$196, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$196, DW_AT_decl_line(0x49)
	.dwattr $C$DW$196, DW_AT_decl_column(0x1a)
$C$DW$197	.dwtag  DW_TAG_member
	.dwattr $C$DW$197, DW_AT_type(*$C$DW$T$149)
	.dwattr $C$DW$197, DW_AT_name("DstAddr")
	.dwattr $C$DW$197, DW_AT_TI_symbol_name("DstAddr")
	.dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$197, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$197, DW_AT_decl_line(0x4a)
	.dwattr $C$DW$197, DW_AT_decl_column(0x1a)
$C$DW$198	.dwtag  DW_TAG_member
	.dwattr $C$DW$198, DW_AT_type(*$C$DW$T$153)
	.dwattr $C$DW$198, DW_AT_name("IPDst")
	.dwattr $C$DW$198, DW_AT_TI_symbol_name("IPDst")
	.dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$198, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$198, DW_AT_decl_line(0x4b)
	.dwattr $C$DW$198, DW_AT_decl_column(0x1a)
	.dwendtag $C$DW$T$154

	.dwattr $C$DW$T$154, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$T$154, DW_AT_decl_line(0x42)
	.dwattr $C$DW$T$154, DW_AT_decl_column(0x10)
$C$DW$T$806	.dwtag  DW_TAG_typedef, DW_AT_name("ARPHDR")
	.dwattr $C$DW$T$806, DW_AT_type(*$C$DW$T$154)
	.dwattr $C$DW$T$806, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$806, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$T$806, DW_AT_decl_line(0x4c)
	.dwattr $C$DW$T$806, DW_AT_decl_column(0x12)

$C$DW$T$158	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$158, DW_AT_byte_size(0x18)
$C$DW$199	.dwtag  DW_TAG_member
	.dwattr $C$DW$199, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$199, DW_AT_name("VerLen")
	.dwattr $C$DW$199, DW_AT_TI_symbol_name("VerLen")
	.dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$199, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$199, DW_AT_decl_line(0x54)
	.dwattr $C$DW$199, DW_AT_decl_column(0x1a)
$C$DW$200	.dwtag  DW_TAG_member
	.dwattr $C$DW$200, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$200, DW_AT_name("Tos")
	.dwattr $C$DW$200, DW_AT_TI_symbol_name("Tos")
	.dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$200, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$200, DW_AT_decl_line(0x55)
	.dwattr $C$DW$200, DW_AT_decl_column(0x1a)
$C$DW$201	.dwtag  DW_TAG_member
	.dwattr $C$DW$201, DW_AT_type(*$C$DW$T$150)
	.dwattr $C$DW$201, DW_AT_name("TotalLen")
	.dwattr $C$DW$201, DW_AT_TI_symbol_name("TotalLen")
	.dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$201, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$201, DW_AT_decl_line(0x56)
	.dwattr $C$DW$201, DW_AT_decl_column(0x1a)
$C$DW$202	.dwtag  DW_TAG_member
	.dwattr $C$DW$202, DW_AT_type(*$C$DW$T$150)
	.dwattr $C$DW$202, DW_AT_name("Id")
	.dwattr $C$DW$202, DW_AT_TI_symbol_name("Id")
	.dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$202, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$202, DW_AT_decl_line(0x57)
	.dwattr $C$DW$202, DW_AT_decl_column(0x1a)
$C$DW$203	.dwtag  DW_TAG_member
	.dwattr $C$DW$203, DW_AT_type(*$C$DW$T$150)
	.dwattr $C$DW$203, DW_AT_name("FlagOff")
	.dwattr $C$DW$203, DW_AT_TI_symbol_name("FlagOff")
	.dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$203, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$203, DW_AT_decl_line(0x58)
	.dwattr $C$DW$203, DW_AT_decl_column(0x1a)
$C$DW$204	.dwtag  DW_TAG_member
	.dwattr $C$DW$204, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$204, DW_AT_name("Ttl")
	.dwattr $C$DW$204, DW_AT_TI_symbol_name("Ttl")
	.dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$204, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$204, DW_AT_decl_line(0x59)
	.dwattr $C$DW$204, DW_AT_decl_column(0x1a)
$C$DW$205	.dwtag  DW_TAG_member
	.dwattr $C$DW$205, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$205, DW_AT_name("Protocol")
	.dwattr $C$DW$205, DW_AT_TI_symbol_name("Protocol")
	.dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$205, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$205, DW_AT_decl_line(0x5a)
	.dwattr $C$DW$205, DW_AT_decl_column(0x1a)
$C$DW$206	.dwtag  DW_TAG_member
	.dwattr $C$DW$206, DW_AT_type(*$C$DW$T$150)
	.dwattr $C$DW$206, DW_AT_name("Checksum")
	.dwattr $C$DW$206, DW_AT_TI_symbol_name("Checksum")
	.dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$206, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$206, DW_AT_decl_line(0x5b)
	.dwattr $C$DW$206, DW_AT_decl_column(0x1a)
$C$DW$207	.dwtag  DW_TAG_member
	.dwattr $C$DW$207, DW_AT_type(*$C$DW$T$156)
	.dwattr $C$DW$207, DW_AT_name("IPSrc")
	.dwattr $C$DW$207, DW_AT_TI_symbol_name("IPSrc")
	.dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$207, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$207, DW_AT_decl_line(0x5c)
	.dwattr $C$DW$207, DW_AT_decl_column(0x1a)
$C$DW$208	.dwtag  DW_TAG_member
	.dwattr $C$DW$208, DW_AT_type(*$C$DW$T$156)
	.dwattr $C$DW$208, DW_AT_name("IPDst")
	.dwattr $C$DW$208, DW_AT_TI_symbol_name("IPDst")
	.dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$208, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$208, DW_AT_decl_line(0x5d)
	.dwattr $C$DW$208, DW_AT_decl_column(0x1a)
$C$DW$209	.dwtag  DW_TAG_member
	.dwattr $C$DW$209, DW_AT_type(*$C$DW$T$157)
	.dwattr $C$DW$209, DW_AT_name("Options")
	.dwattr $C$DW$209, DW_AT_TI_symbol_name("Options")
	.dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$209, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$209, DW_AT_decl_line(0x5e)
	.dwattr $C$DW$209, DW_AT_decl_column(0x1a)
	.dwendtag $C$DW$T$158

	.dwattr $C$DW$T$158, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$T$158, DW_AT_decl_line(0x53)
	.dwattr $C$DW$T$158, DW_AT_decl_column(0x10)
$C$DW$T$807	.dwtag  DW_TAG_typedef, DW_AT_name("IPHDR")
	.dwattr $C$DW$T$807, DW_AT_type(*$C$DW$T$158)
	.dwattr $C$DW$T$807, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$807, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$T$807, DW_AT_decl_line(0x5f)
	.dwattr $C$DW$T$807, DW_AT_decl_column(0x12)

$C$DW$T$161	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$161, DW_AT_byte_size(0x28)
$C$DW$210	.dwtag  DW_TAG_member
	.dwattr $C$DW$210, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$210, DW_AT_name("VerTC")
	.dwattr $C$DW$210, DW_AT_TI_symbol_name("VerTC")
	.dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$210, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$210, DW_AT_decl_line(0x67)
	.dwattr $C$DW$210, DW_AT_decl_column(0x1a)
$C$DW$211	.dwtag  DW_TAG_member
	.dwattr $C$DW$211, DW_AT_type(*$C$DW$T$159)
	.dwattr $C$DW$211, DW_AT_name("FlowLabel")
	.dwattr $C$DW$211, DW_AT_TI_symbol_name("FlowLabel")
	.dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$211, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$211, DW_AT_decl_line(0x68)
	.dwattr $C$DW$211, DW_AT_decl_column(0x1a)
$C$DW$212	.dwtag  DW_TAG_member
	.dwattr $C$DW$212, DW_AT_type(*$C$DW$T$150)
	.dwattr $C$DW$212, DW_AT_name("PayloadLength")
	.dwattr $C$DW$212, DW_AT_TI_symbol_name("PayloadLength")
	.dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$212, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$212, DW_AT_decl_line(0x69)
	.dwattr $C$DW$212, DW_AT_decl_column(0x1a)
$C$DW$213	.dwtag  DW_TAG_member
	.dwattr $C$DW$213, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$213, DW_AT_name("NextHeader")
	.dwattr $C$DW$213, DW_AT_TI_symbol_name("NextHeader")
	.dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$213, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$213, DW_AT_decl_line(0x6a)
	.dwattr $C$DW$213, DW_AT_decl_column(0x1a)
$C$DW$214	.dwtag  DW_TAG_member
	.dwattr $C$DW$214, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$214, DW_AT_name("HopLimit")
	.dwattr $C$DW$214, DW_AT_TI_symbol_name("HopLimit")
	.dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$214, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$214, DW_AT_decl_line(0x6b)
	.dwattr $C$DW$214, DW_AT_decl_column(0x1a)
$C$DW$215	.dwtag  DW_TAG_member
	.dwattr $C$DW$215, DW_AT_type(*$C$DW$T$160)
	.dwattr $C$DW$215, DW_AT_name("SrcAddr")
	.dwattr $C$DW$215, DW_AT_TI_symbol_name("SrcAddr")
	.dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$215, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$215, DW_AT_decl_line(0x6c)
	.dwattr $C$DW$215, DW_AT_decl_column(0x1a)
$C$DW$216	.dwtag  DW_TAG_member
	.dwattr $C$DW$216, DW_AT_type(*$C$DW$T$160)
	.dwattr $C$DW$216, DW_AT_name("DstAddr")
	.dwattr $C$DW$216, DW_AT_TI_symbol_name("DstAddr")
	.dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$216, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$216, DW_AT_decl_line(0x6d)
	.dwattr $C$DW$216, DW_AT_decl_column(0x1a)
	.dwendtag $C$DW$T$161

	.dwattr $C$DW$T$161, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$T$161, DW_AT_decl_line(0x66)
	.dwattr $C$DW$T$161, DW_AT_decl_column(0x10)
$C$DW$T$808	.dwtag  DW_TAG_typedef, DW_AT_name("IPV6HDR")
	.dwattr $C$DW$T$808, DW_AT_type(*$C$DW$T$161)
	.dwattr $C$DW$T$808, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$808, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$T$808, DW_AT_decl_line(0x6e)
	.dwattr $C$DW$T$808, DW_AT_decl_column(0x12)

$C$DW$T$162	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$162, DW_AT_byte_size(0x06)
$C$DW$217	.dwtag  DW_TAG_member
	.dwattr $C$DW$217, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$217, DW_AT_name("Type")
	.dwattr $C$DW$217, DW_AT_TI_symbol_name("Type")
	.dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$217, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$217, DW_AT_decl_line(0x76)
	.dwattr $C$DW$217, DW_AT_decl_column(0x1a)
$C$DW$218	.dwtag  DW_TAG_member
	.dwattr $C$DW$218, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$218, DW_AT_name("Code")
	.dwattr $C$DW$218, DW_AT_TI_symbol_name("Code")
	.dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$218, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$218, DW_AT_decl_line(0x77)
	.dwattr $C$DW$218, DW_AT_decl_column(0x1a)
$C$DW$219	.dwtag  DW_TAG_member
	.dwattr $C$DW$219, DW_AT_type(*$C$DW$T$150)
	.dwattr $C$DW$219, DW_AT_name("Checksum")
	.dwattr $C$DW$219, DW_AT_TI_symbol_name("Checksum")
	.dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$219, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$219, DW_AT_decl_line(0x78)
	.dwattr $C$DW$219, DW_AT_decl_column(0x1a)
$C$DW$220	.dwtag  DW_TAG_member
	.dwattr $C$DW$220, DW_AT_type(*$C$DW$T$157)
	.dwattr $C$DW$220, DW_AT_name("Data")
	.dwattr $C$DW$220, DW_AT_TI_symbol_name("Data")
	.dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$220, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$220, DW_AT_decl_line(0x79)
	.dwattr $C$DW$220, DW_AT_decl_column(0x1a)
	.dwendtag $C$DW$T$162

	.dwattr $C$DW$T$162, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$T$162, DW_AT_decl_line(0x75)
	.dwattr $C$DW$T$162, DW_AT_decl_column(0x10)
$C$DW$T$809	.dwtag  DW_TAG_typedef, DW_AT_name("ICMPHDR")
	.dwattr $C$DW$T$809, DW_AT_type(*$C$DW$T$162)
	.dwattr $C$DW$T$809, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$809, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$T$809, DW_AT_decl_line(0x7a)
	.dwattr $C$DW$T$809, DW_AT_decl_column(0x12)

$C$DW$T$163	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$163, DW_AT_byte_size(0x06)
$C$DW$221	.dwtag  DW_TAG_member
	.dwattr $C$DW$221, DW_AT_type(*$C$DW$T$150)
	.dwattr $C$DW$221, DW_AT_name("Id")
	.dwattr $C$DW$221, DW_AT_TI_symbol_name("Id")
	.dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$221, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$221, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$221, DW_AT_decl_column(0x1b)
$C$DW$222	.dwtag  DW_TAG_member
	.dwattr $C$DW$222, DW_AT_type(*$C$DW$T$150)
	.dwattr $C$DW$222, DW_AT_name("Seq")
	.dwattr $C$DW$222, DW_AT_TI_symbol_name("Seq")
	.dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$222, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$222, DW_AT_decl_line(0x80)
	.dwattr $C$DW$222, DW_AT_decl_column(0x1b)
$C$DW$223	.dwtag  DW_TAG_member
	.dwattr $C$DW$223, DW_AT_type(*$C$DW$T$157)
	.dwattr $C$DW$223, DW_AT_name("Data")
	.dwattr $C$DW$223, DW_AT_TI_symbol_name("Data")
	.dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$223, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$223, DW_AT_decl_line(0x81)
	.dwattr $C$DW$223, DW_AT_decl_column(0x1b)
	.dwendtag $C$DW$T$163

	.dwattr $C$DW$T$163, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$T$163, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$T$163, DW_AT_decl_column(0x10)
$C$DW$T$810	.dwtag  DW_TAG_typedef, DW_AT_name("ICMPREQHDR")
	.dwattr $C$DW$T$810, DW_AT_type(*$C$DW$T$163)
	.dwattr $C$DW$T$810, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$810, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$T$810, DW_AT_decl_line(0x82)
	.dwattr $C$DW$T$810, DW_AT_decl_column(0x12)

$C$DW$T$165	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$165, DW_AT_byte_size(0x0c)
$C$DW$224	.dwtag  DW_TAG_member
	.dwattr $C$DW$224, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$224, DW_AT_name("NumAddr")
	.dwattr $C$DW$224, DW_AT_TI_symbol_name("NumAddr")
	.dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$224, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$224, DW_AT_decl_line(0x87)
	.dwattr $C$DW$224, DW_AT_decl_column(0x1a)
$C$DW$225	.dwtag  DW_TAG_member
	.dwattr $C$DW$225, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$225, DW_AT_name("Size")
	.dwattr $C$DW$225, DW_AT_TI_symbol_name("Size")
	.dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$225, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$225, DW_AT_decl_line(0x88)
	.dwattr $C$DW$225, DW_AT_decl_column(0x1a)
$C$DW$226	.dwtag  DW_TAG_member
	.dwattr $C$DW$226, DW_AT_type(*$C$DW$T$150)
	.dwattr $C$DW$226, DW_AT_name("Lifetime")
	.dwattr $C$DW$226, DW_AT_TI_symbol_name("Lifetime")
	.dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$226, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$226, DW_AT_decl_line(0x89)
	.dwattr $C$DW$226, DW_AT_decl_column(0x1a)
$C$DW$227	.dwtag  DW_TAG_member
	.dwattr $C$DW$227, DW_AT_type(*$C$DW$T$164)
	.dwattr $C$DW$227, DW_AT_name("rta")
	.dwattr $C$DW$227, DW_AT_TI_symbol_name("rta")
	.dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$227, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$227, DW_AT_decl_line(0x8d)
	.dwattr $C$DW$227, DW_AT_decl_column(0x1b)
	.dwendtag $C$DW$T$165

	.dwattr $C$DW$T$165, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$T$165, DW_AT_decl_line(0x86)
	.dwattr $C$DW$T$165, DW_AT_decl_column(0x10)
$C$DW$T$811	.dwtag  DW_TAG_typedef, DW_AT_name("ICMPRTAHDR")
	.dwattr $C$DW$T$811, DW_AT_type(*$C$DW$T$165)
	.dwattr $C$DW$T$811, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$811, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$T$811, DW_AT_decl_line(0x8e)
	.dwattr $C$DW$T$811, DW_AT_decl_column(0x12)

$C$DW$T$166	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$166, DW_AT_byte_size(0x04)
$C$DW$228	.dwtag  DW_TAG_member
	.dwattr $C$DW$228, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$228, DW_AT_name("Type")
	.dwattr $C$DW$228, DW_AT_TI_symbol_name("Type")
	.dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$228, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$228, DW_AT_decl_line(0x94)
	.dwattr $C$DW$228, DW_AT_decl_column(0x1a)
$C$DW$229	.dwtag  DW_TAG_member
	.dwattr $C$DW$229, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$229, DW_AT_name("Code")
	.dwattr $C$DW$229, DW_AT_TI_symbol_name("Code")
	.dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$229, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$229, DW_AT_decl_line(0x95)
	.dwattr $C$DW$229, DW_AT_decl_column(0x1a)
$C$DW$230	.dwtag  DW_TAG_member
	.dwattr $C$DW$230, DW_AT_type(*$C$DW$T$150)
	.dwattr $C$DW$230, DW_AT_name("Checksum")
	.dwattr $C$DW$230, DW_AT_TI_symbol_name("Checksum")
	.dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$230, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$230, DW_AT_decl_line(0x96)
	.dwattr $C$DW$230, DW_AT_decl_column(0x1a)
	.dwendtag $C$DW$T$166

	.dwattr $C$DW$T$166, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$T$166, DW_AT_decl_line(0x93)
	.dwattr $C$DW$T$166, DW_AT_decl_column(0x10)
$C$DW$T$812	.dwtag  DW_TAG_typedef, DW_AT_name("ICMPV6HDR")
	.dwattr $C$DW$T$812, DW_AT_type(*$C$DW$T$166)
	.dwattr $C$DW$T$812, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$812, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$T$812, DW_AT_decl_line(0x97)
	.dwattr $C$DW$T$812, DW_AT_decl_column(0x12)

$C$DW$T$167	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$167, DW_AT_byte_size(0x08)
$C$DW$231	.dwtag  DW_TAG_member
	.dwattr $C$DW$231, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$231, DW_AT_name("VerType")
	.dwattr $C$DW$231, DW_AT_TI_symbol_name("VerType")
	.dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$231, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$231, DW_AT_decl_line(0x9f)
	.dwattr $C$DW$231, DW_AT_decl_column(0x1a)
$C$DW$232	.dwtag  DW_TAG_member
	.dwattr $C$DW$232, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$232, DW_AT_name("MaxTime")
	.dwattr $C$DW$232, DW_AT_TI_symbol_name("MaxTime")
	.dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$232, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$232, DW_AT_decl_line(0xa0)
	.dwattr $C$DW$232, DW_AT_decl_column(0x1a)
$C$DW$233	.dwtag  DW_TAG_member
	.dwattr $C$DW$233, DW_AT_type(*$C$DW$T$150)
	.dwattr $C$DW$233, DW_AT_name("Checksum")
	.dwattr $C$DW$233, DW_AT_TI_symbol_name("Checksum")
	.dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$233, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$233, DW_AT_decl_line(0xa1)
	.dwattr $C$DW$233, DW_AT_decl_column(0x1a)
$C$DW$234	.dwtag  DW_TAG_member
	.dwattr $C$DW$234, DW_AT_type(*$C$DW$T$156)
	.dwattr $C$DW$234, DW_AT_name("IpAddr")
	.dwattr $C$DW$234, DW_AT_TI_symbol_name("IpAddr")
	.dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$234, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$234, DW_AT_decl_line(0xa2)
	.dwattr $C$DW$234, DW_AT_decl_column(0x1a)
	.dwendtag $C$DW$T$167

	.dwattr $C$DW$T$167, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$T$167, DW_AT_decl_line(0x9e)
	.dwattr $C$DW$T$167, DW_AT_decl_column(0x10)
$C$DW$T$813	.dwtag  DW_TAG_typedef, DW_AT_name("IGMPHDR")
	.dwattr $C$DW$T$813, DW_AT_type(*$C$DW$T$167)
	.dwattr $C$DW$T$813, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$813, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$T$813, DW_AT_decl_line(0xa3)
	.dwattr $C$DW$T$813, DW_AT_decl_column(0x12)

$C$DW$T$168	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$168, DW_AT_byte_size(0x18)
$C$DW$235	.dwtag  DW_TAG_member
	.dwattr $C$DW$235, DW_AT_type(*$C$DW$T$150)
	.dwattr $C$DW$235, DW_AT_name("SrcPort")
	.dwattr $C$DW$235, DW_AT_TI_symbol_name("SrcPort")
	.dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$235, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$235, DW_AT_decl_line(0xac)
	.dwattr $C$DW$235, DW_AT_decl_column(0x1a)
$C$DW$236	.dwtag  DW_TAG_member
	.dwattr $C$DW$236, DW_AT_type(*$C$DW$T$150)
	.dwattr $C$DW$236, DW_AT_name("DstPort")
	.dwattr $C$DW$236, DW_AT_TI_symbol_name("DstPort")
	.dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$236, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$236, DW_AT_decl_line(0xad)
	.dwattr $C$DW$236, DW_AT_decl_column(0x1a)
$C$DW$237	.dwtag  DW_TAG_member
	.dwattr $C$DW$237, DW_AT_type(*$C$DW$T$155)
	.dwattr $C$DW$237, DW_AT_name("Seq")
	.dwattr $C$DW$237, DW_AT_TI_symbol_name("Seq")
	.dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$237, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$237, DW_AT_decl_line(0xae)
	.dwattr $C$DW$237, DW_AT_decl_column(0x1a)
$C$DW$238	.dwtag  DW_TAG_member
	.dwattr $C$DW$238, DW_AT_type(*$C$DW$T$155)
	.dwattr $C$DW$238, DW_AT_name("Ack")
	.dwattr $C$DW$238, DW_AT_TI_symbol_name("Ack")
	.dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$238, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$238, DW_AT_decl_line(0xaf)
	.dwattr $C$DW$238, DW_AT_decl_column(0x1a)
$C$DW$239	.dwtag  DW_TAG_member
	.dwattr $C$DW$239, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$239, DW_AT_name("HdrLen")
	.dwattr $C$DW$239, DW_AT_TI_symbol_name("HdrLen")
	.dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$239, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$239, DW_AT_decl_line(0xb0)
	.dwattr $C$DW$239, DW_AT_decl_column(0x1a)
$C$DW$240	.dwtag  DW_TAG_member
	.dwattr $C$DW$240, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$240, DW_AT_name("Flags")
	.dwattr $C$DW$240, DW_AT_TI_symbol_name("Flags")
	.dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$240, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$240, DW_AT_decl_line(0xb1)
	.dwattr $C$DW$240, DW_AT_decl_column(0x1a)
$C$DW$241	.dwtag  DW_TAG_member
	.dwattr $C$DW$241, DW_AT_type(*$C$DW$T$150)
	.dwattr $C$DW$241, DW_AT_name("WindowSize")
	.dwattr $C$DW$241, DW_AT_TI_symbol_name("WindowSize")
	.dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$241, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$241, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$241, DW_AT_decl_column(0x1a)
$C$DW$242	.dwtag  DW_TAG_member
	.dwattr $C$DW$242, DW_AT_type(*$C$DW$T$150)
	.dwattr $C$DW$242, DW_AT_name("TCPChecksum")
	.dwattr $C$DW$242, DW_AT_TI_symbol_name("TCPChecksum")
	.dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$242, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$242, DW_AT_decl_line(0xb3)
	.dwattr $C$DW$242, DW_AT_decl_column(0x1a)
$C$DW$243	.dwtag  DW_TAG_member
	.dwattr $C$DW$243, DW_AT_type(*$C$DW$T$150)
	.dwattr $C$DW$243, DW_AT_name("UrgPtr")
	.dwattr $C$DW$243, DW_AT_TI_symbol_name("UrgPtr")
	.dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$243, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$243, DW_AT_decl_line(0xb4)
	.dwattr $C$DW$243, DW_AT_decl_column(0x1a)
$C$DW$244	.dwtag  DW_TAG_member
	.dwattr $C$DW$244, DW_AT_type(*$C$DW$T$157)
	.dwattr $C$DW$244, DW_AT_name("Options")
	.dwattr $C$DW$244, DW_AT_TI_symbol_name("Options")
	.dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$244, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$244, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$244, DW_AT_decl_column(0x1a)
	.dwendtag $C$DW$T$168

	.dwattr $C$DW$T$168, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$T$168, DW_AT_decl_line(0xab)
	.dwattr $C$DW$T$168, DW_AT_decl_column(0x10)
$C$DW$T$814	.dwtag  DW_TAG_typedef, DW_AT_name("TCPHDR")
	.dwattr $C$DW$T$814, DW_AT_type(*$C$DW$T$168)
	.dwattr $C$DW$T$814, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$814, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$T$814, DW_AT_decl_line(0xb6)
	.dwattr $C$DW$T$814, DW_AT_decl_column(0x12)

$C$DW$T$169	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$169, DW_AT_byte_size(0x08)
$C$DW$245	.dwtag  DW_TAG_member
	.dwattr $C$DW$245, DW_AT_type(*$C$DW$T$150)
	.dwattr $C$DW$245, DW_AT_name("SrcPort")
	.dwattr $C$DW$245, DW_AT_TI_symbol_name("SrcPort")
	.dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$245, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$245, DW_AT_decl_line(0xbd)
	.dwattr $C$DW$245, DW_AT_decl_column(0x1a)
$C$DW$246	.dwtag  DW_TAG_member
	.dwattr $C$DW$246, DW_AT_type(*$C$DW$T$150)
	.dwattr $C$DW$246, DW_AT_name("DstPort")
	.dwattr $C$DW$246, DW_AT_TI_symbol_name("DstPort")
	.dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$246, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$246, DW_AT_decl_line(0xbe)
	.dwattr $C$DW$246, DW_AT_decl_column(0x1a)
$C$DW$247	.dwtag  DW_TAG_member
	.dwattr $C$DW$247, DW_AT_type(*$C$DW$T$150)
	.dwattr $C$DW$247, DW_AT_name("Length")
	.dwattr $C$DW$247, DW_AT_TI_symbol_name("Length")
	.dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$247, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$247, DW_AT_decl_line(0xbf)
	.dwattr $C$DW$247, DW_AT_decl_column(0x1a)
$C$DW$248	.dwtag  DW_TAG_member
	.dwattr $C$DW$248, DW_AT_type(*$C$DW$T$150)
	.dwattr $C$DW$248, DW_AT_name("UDPChecksum")
	.dwattr $C$DW$248, DW_AT_TI_symbol_name("UDPChecksum")
	.dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$248, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$248, DW_AT_decl_line(0xc0)
	.dwattr $C$DW$248, DW_AT_decl_column(0x1a)
	.dwendtag $C$DW$T$169

	.dwattr $C$DW$T$169, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$T$169, DW_AT_decl_line(0xbc)
	.dwattr $C$DW$T$169, DW_AT_decl_column(0x10)
$C$DW$T$815	.dwtag  DW_TAG_typedef, DW_AT_name("UDPHDR")
	.dwattr $C$DW$T$815, DW_AT_type(*$C$DW$T$169)
	.dwattr $C$DW$T$815, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$815, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$T$815, DW_AT_decl_line(0xc1)
	.dwattr $C$DW$T$815, DW_AT_decl_column(0x12)

$C$DW$T$170	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$170, DW_AT_byte_size(0x0c)
$C$DW$249	.dwtag  DW_TAG_member
	.dwattr $C$DW$249, DW_AT_type(*$C$DW$T$156)
	.dwattr $C$DW$249, DW_AT_name("IPSrc")
	.dwattr $C$DW$249, DW_AT_TI_symbol_name("IPSrc")
	.dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$249, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$249, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$249, DW_AT_decl_column(0x19)
$C$DW$250	.dwtag  DW_TAG_member
	.dwattr $C$DW$250, DW_AT_type(*$C$DW$T$156)
	.dwattr $C$DW$250, DW_AT_name("IPDst")
	.dwattr $C$DW$250, DW_AT_TI_symbol_name("IPDst")
	.dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$250, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$250, DW_AT_decl_line(0xc6)
	.dwattr $C$DW$250, DW_AT_decl_column(0x19)
$C$DW$251	.dwtag  DW_TAG_member
	.dwattr $C$DW$251, DW_AT_type(*$C$DW$T$150)
	.dwattr $C$DW$251, DW_AT_name("Length")
	.dwattr $C$DW$251, DW_AT_TI_symbol_name("Length")
	.dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$251, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$251, DW_AT_decl_line(0xc7)
	.dwattr $C$DW$251, DW_AT_decl_column(0x19)
$C$DW$252	.dwtag  DW_TAG_member
	.dwattr $C$DW$252, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$252, DW_AT_name("Null")
	.dwattr $C$DW$252, DW_AT_TI_symbol_name("Null")
	.dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$252, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$252, DW_AT_decl_line(0xc8)
	.dwattr $C$DW$252, DW_AT_decl_column(0x19)
$C$DW$253	.dwtag  DW_TAG_member
	.dwattr $C$DW$253, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$253, DW_AT_name("Protocol")
	.dwattr $C$DW$253, DW_AT_TI_symbol_name("Protocol")
	.dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$253, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$253, DW_AT_decl_line(0xc9)
	.dwattr $C$DW$253, DW_AT_decl_column(0x19)
	.dwendtag $C$DW$T$170

	.dwattr $C$DW$T$170, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$T$170, DW_AT_decl_line(0xc4)
	.dwattr $C$DW$T$170, DW_AT_decl_column(0x10)
$C$DW$T$816	.dwtag  DW_TAG_typedef, DW_AT_name("PSEUDO")
	.dwattr $C$DW$T$816, DW_AT_type(*$C$DW$T$170)
	.dwattr $C$DW$T$816, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$816, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$T$816, DW_AT_decl_line(0xca)
	.dwattr $C$DW$T$816, DW_AT_decl_column(0x13)

$C$DW$T$171	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$171, DW_AT_byte_size(0x28)
$C$DW$254	.dwtag  DW_TAG_member
	.dwattr $C$DW$254, DW_AT_type(*$C$DW$T$160)
	.dwattr $C$DW$254, DW_AT_name("SrcAddr")
	.dwattr $C$DW$254, DW_AT_TI_symbol_name("SrcAddr")
	.dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$254, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$254, DW_AT_decl_line(0xd0)
	.dwattr $C$DW$254, DW_AT_decl_column(0x1a)
$C$DW$255	.dwtag  DW_TAG_member
	.dwattr $C$DW$255, DW_AT_type(*$C$DW$T$160)
	.dwattr $C$DW$255, DW_AT_name("DstAddr")
	.dwattr $C$DW$255, DW_AT_TI_symbol_name("DstAddr")
	.dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$255, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$255, DW_AT_decl_line(0xd1)
	.dwattr $C$DW$255, DW_AT_decl_column(0x1a)
$C$DW$256	.dwtag  DW_TAG_member
	.dwattr $C$DW$256, DW_AT_type(*$C$DW$T$155)
	.dwattr $C$DW$256, DW_AT_name("PktLen")
	.dwattr $C$DW$256, DW_AT_TI_symbol_name("PktLen")
	.dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$256, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$256, DW_AT_decl_line(0xd2)
	.dwattr $C$DW$256, DW_AT_decl_column(0x1a)
$C$DW$257	.dwtag  DW_TAG_member
	.dwattr $C$DW$257, DW_AT_type(*$C$DW$T$159)
	.dwattr $C$DW$257, DW_AT_name("Rsvd")
	.dwattr $C$DW$257, DW_AT_TI_symbol_name("Rsvd")
	.dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$257, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$257, DW_AT_decl_line(0xd3)
	.dwattr $C$DW$257, DW_AT_decl_column(0x1a)
$C$DW$258	.dwtag  DW_TAG_member
	.dwattr $C$DW$258, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$258, DW_AT_name("NxtHdr")
	.dwattr $C$DW$258, DW_AT_TI_symbol_name("NxtHdr")
	.dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
	.dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$258, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$258, DW_AT_decl_line(0xd4)
	.dwattr $C$DW$258, DW_AT_decl_column(0x1a)
	.dwendtag $C$DW$T$171

	.dwattr $C$DW$T$171, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$T$171, DW_AT_decl_line(0xcf)
	.dwattr $C$DW$T$171, DW_AT_decl_column(0x10)
$C$DW$T$817	.dwtag  DW_TAG_typedef, DW_AT_name("PSEUDOV6")
	.dwattr $C$DW$T$817, DW_AT_type(*$C$DW$T$171)
	.dwattr $C$DW$T$817, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$817, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$T$817, DW_AT_decl_line(0xd5)
	.dwattr $C$DW$T$817, DW_AT_decl_column(0x12)

$C$DW$T$172	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$172, DW_AT_byte_size(0x02)
$C$DW$259	.dwtag  DW_TAG_member
	.dwattr $C$DW$259, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$259, DW_AT_name("NextHeader")
	.dwattr $C$DW$259, DW_AT_TI_symbol_name("NextHeader")
	.dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$259, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$259, DW_AT_decl_line(0xdd)
	.dwattr $C$DW$259, DW_AT_decl_column(0x1a)
$C$DW$260	.dwtag  DW_TAG_member
	.dwattr $C$DW$260, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$260, DW_AT_name("HdrExtLen")
	.dwattr $C$DW$260, DW_AT_TI_symbol_name("HdrExtLen")
	.dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$260, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$260, DW_AT_decl_line(0xde)
	.dwattr $C$DW$260, DW_AT_decl_column(0x1a)
	.dwendtag $C$DW$T$172

	.dwattr $C$DW$T$172, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$T$172, DW_AT_decl_line(0xdc)
	.dwattr $C$DW$T$172, DW_AT_decl_column(0x10)
$C$DW$T$818	.dwtag  DW_TAG_typedef, DW_AT_name("IPV6_HOPOPTSHDR")
	.dwattr $C$DW$T$818, DW_AT_type(*$C$DW$T$172)
	.dwattr $C$DW$T$818, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$818, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$T$818, DW_AT_decl_line(0xdf)
	.dwattr $C$DW$T$818, DW_AT_decl_column(0x12)

$C$DW$T$173	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$173, DW_AT_byte_size(0x04)
$C$DW$261	.dwtag  DW_TAG_member
	.dwattr $C$DW$261, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$261, DW_AT_name("NextHeader")
	.dwattr $C$DW$261, DW_AT_TI_symbol_name("NextHeader")
	.dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$261, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$261, DW_AT_decl_line(0xe7)
	.dwattr $C$DW$261, DW_AT_decl_column(0x1a)
$C$DW$262	.dwtag  DW_TAG_member
	.dwattr $C$DW$262, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$262, DW_AT_name("HdrExtLen")
	.dwattr $C$DW$262, DW_AT_TI_symbol_name("HdrExtLen")
	.dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$262, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$262, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$262, DW_AT_decl_column(0x1a)
$C$DW$263	.dwtag  DW_TAG_member
	.dwattr $C$DW$263, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$263, DW_AT_name("RoutingType")
	.dwattr $C$DW$263, DW_AT_TI_symbol_name("RoutingType")
	.dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$263, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$263, DW_AT_decl_line(0xe9)
	.dwattr $C$DW$263, DW_AT_decl_column(0x1a)
$C$DW$264	.dwtag  DW_TAG_member
	.dwattr $C$DW$264, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$264, DW_AT_name("SegmentsLeft")
	.dwattr $C$DW$264, DW_AT_TI_symbol_name("SegmentsLeft")
	.dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$264, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$264, DW_AT_decl_line(0xea)
	.dwattr $C$DW$264, DW_AT_decl_column(0x1a)
	.dwendtag $C$DW$T$173

	.dwattr $C$DW$T$173, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$T$173, DW_AT_decl_line(0xe6)
	.dwattr $C$DW$T$173, DW_AT_decl_column(0x10)
$C$DW$T$819	.dwtag  DW_TAG_typedef, DW_AT_name("IPV6_ROUTINGHDR")
	.dwattr $C$DW$T$819, DW_AT_type(*$C$DW$T$173)
	.dwattr $C$DW$T$819, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$819, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$T$819, DW_AT_decl_line(0xeb)
	.dwattr $C$DW$T$819, DW_AT_decl_column(0x12)

$C$DW$T$174	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$174, DW_AT_byte_size(0x08)
$C$DW$265	.dwtag  DW_TAG_member
	.dwattr $C$DW$265, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$265, DW_AT_name("NextHeader")
	.dwattr $C$DW$265, DW_AT_TI_symbol_name("NextHeader")
	.dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$265, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$265, DW_AT_decl_line(0xf3)
	.dwattr $C$DW$265, DW_AT_decl_column(0x1a)
$C$DW$266	.dwtag  DW_TAG_member
	.dwattr $C$DW$266, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$266, DW_AT_name("HdrExtLen")
	.dwattr $C$DW$266, DW_AT_TI_symbol_name("HdrExtLen")
	.dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$266, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$266, DW_AT_decl_line(0xf4)
	.dwattr $C$DW$266, DW_AT_decl_column(0x1a)
$C$DW$267	.dwtag  DW_TAG_member
	.dwattr $C$DW$267, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$267, DW_AT_name("RoutingType")
	.dwattr $C$DW$267, DW_AT_TI_symbol_name("RoutingType")
	.dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$267, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$267, DW_AT_decl_line(0xf5)
	.dwattr $C$DW$267, DW_AT_decl_column(0x1a)
$C$DW$268	.dwtag  DW_TAG_member
	.dwattr $C$DW$268, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$268, DW_AT_name("SegmentsLeft")
	.dwattr $C$DW$268, DW_AT_TI_symbol_name("SegmentsLeft")
	.dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$268, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$268, DW_AT_decl_line(0xf6)
	.dwattr $C$DW$268, DW_AT_decl_column(0x1a)
$C$DW$269	.dwtag  DW_TAG_member
	.dwattr $C$DW$269, DW_AT_type(*$C$DW$T$153)
	.dwattr $C$DW$269, DW_AT_name("Rsvd")
	.dwattr $C$DW$269, DW_AT_TI_symbol_name("Rsvd")
	.dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$269, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$269, DW_AT_decl_line(0xf7)
	.dwattr $C$DW$269, DW_AT_decl_column(0x1a)
	.dwendtag $C$DW$T$174

	.dwattr $C$DW$T$174, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$T$174, DW_AT_decl_line(0xf2)
	.dwattr $C$DW$T$174, DW_AT_decl_column(0x10)
$C$DW$T$820	.dwtag  DW_TAG_typedef, DW_AT_name("IPV6_RTGHDR_TYPE0")
	.dwattr $C$DW$T$820, DW_AT_type(*$C$DW$T$174)
	.dwattr $C$DW$T$820, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$820, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$T$820, DW_AT_decl_line(0xf8)
	.dwattr $C$DW$T$820, DW_AT_decl_column(0x12)

$C$DW$T$175	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$175, DW_AT_byte_size(0x08)
$C$DW$270	.dwtag  DW_TAG_member
	.dwattr $C$DW$270, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$270, DW_AT_name("NextHeader")
	.dwattr $C$DW$270, DW_AT_TI_symbol_name("NextHeader")
	.dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$270, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$270, DW_AT_decl_line(0x100)
	.dwattr $C$DW$270, DW_AT_decl_column(0x1a)
$C$DW$271	.dwtag  DW_TAG_member
	.dwattr $C$DW$271, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$271, DW_AT_name("Rsvd")
	.dwattr $C$DW$271, DW_AT_TI_symbol_name("Rsvd")
	.dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$271, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$271, DW_AT_decl_line(0x101)
	.dwattr $C$DW$271, DW_AT_decl_column(0x1a)
$C$DW$272	.dwtag  DW_TAG_member
	.dwattr $C$DW$272, DW_AT_type(*$C$DW$T$150)
	.dwattr $C$DW$272, DW_AT_name("FragOffset")
	.dwattr $C$DW$272, DW_AT_TI_symbol_name("FragOffset")
	.dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$272, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$272, DW_AT_decl_line(0x102)
	.dwattr $C$DW$272, DW_AT_decl_column(0x1a)
$C$DW$273	.dwtag  DW_TAG_member
	.dwattr $C$DW$273, DW_AT_type(*$C$DW$T$153)
	.dwattr $C$DW$273, DW_AT_name("FragId")
	.dwattr $C$DW$273, DW_AT_TI_symbol_name("FragId")
	.dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$273, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$273, DW_AT_decl_line(0x103)
	.dwattr $C$DW$273, DW_AT_decl_column(0x1a)
	.dwendtag $C$DW$T$175

	.dwattr $C$DW$T$175, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$T$175, DW_AT_decl_line(0xff)
	.dwattr $C$DW$T$175, DW_AT_decl_column(0x10)
$C$DW$T$821	.dwtag  DW_TAG_typedef, DW_AT_name("IPV6_FRAGHDR")
	.dwattr $C$DW$T$821, DW_AT_type(*$C$DW$T$175)
	.dwattr $C$DW$T$821, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$821, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$T$821, DW_AT_decl_line(0x104)
	.dwattr $C$DW$T$821, DW_AT_decl_column(0x12)

$C$DW$T$176	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$176, DW_AT_byte_size(0x02)
$C$DW$274	.dwtag  DW_TAG_member
	.dwattr $C$DW$274, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$274, DW_AT_name("NextHeader")
	.dwattr $C$DW$274, DW_AT_TI_symbol_name("NextHeader")
	.dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$274, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$274, DW_AT_decl_line(0x10c)
	.dwattr $C$DW$274, DW_AT_decl_column(0x1a)
$C$DW$275	.dwtag  DW_TAG_member
	.dwattr $C$DW$275, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$275, DW_AT_name("HdrExtLen")
	.dwattr $C$DW$275, DW_AT_TI_symbol_name("HdrExtLen")
	.dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$275, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$275, DW_AT_decl_line(0x10d)
	.dwattr $C$DW$275, DW_AT_decl_column(0x1a)
	.dwendtag $C$DW$T$176

	.dwattr $C$DW$T$176, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$T$176, DW_AT_decl_line(0x10b)
	.dwattr $C$DW$T$176, DW_AT_decl_column(0x10)
$C$DW$T$822	.dwtag  DW_TAG_typedef, DW_AT_name("IPV6_DSTOPTSHDR")
	.dwattr $C$DW$T$822, DW_AT_type(*$C$DW$T$176)
	.dwattr $C$DW$T$822, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$822, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/netdf.h")
	.dwattr $C$DW$T$822, DW_AT_decl_line(0x10e)
	.dwattr $C$DW$T$822, DW_AT_decl_column(0x12)

$C$DW$T$177	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$177, DW_AT_byte_size(0x68)
$C$DW$276	.dwtag  DW_TAG_member
	.dwattr $C$DW$276, DW_AT_type(*$C$DW$T$155)
	.dwattr $C$DW$276, DW_AT_name("Total")
	.dwattr $C$DW$276, DW_AT_TI_symbol_name("Total")
	.dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$276, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/ipif.h")
	.dwattr $C$DW$276, DW_AT_decl_line(0x38)
	.dwattr $C$DW$276, DW_AT_decl_column(0x11)
$C$DW$277	.dwtag  DW_TAG_member
	.dwattr $C$DW$277, DW_AT_type(*$C$DW$T$155)
	.dwattr $C$DW$277, DW_AT_name("Odropped")
	.dwattr $C$DW$277, DW_AT_TI_symbol_name("Odropped")
	.dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$277, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/ipif.h")
	.dwattr $C$DW$277, DW_AT_decl_line(0x39)
	.dwattr $C$DW$277, DW_AT_decl_column(0x11)
$C$DW$278	.dwtag  DW_TAG_member
	.dwattr $C$DW$278, DW_AT_type(*$C$DW$T$155)
	.dwattr $C$DW$278, DW_AT_name("Badsum")
	.dwattr $C$DW$278, DW_AT_TI_symbol_name("Badsum")
	.dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$278, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/ipif.h")
	.dwattr $C$DW$278, DW_AT_decl_line(0x3a)
	.dwattr $C$DW$278, DW_AT_decl_column(0x11)
$C$DW$279	.dwtag  DW_TAG_member
	.dwattr $C$DW$279, DW_AT_type(*$C$DW$T$155)
	.dwattr $C$DW$279, DW_AT_name("Badhlen")
	.dwattr $C$DW$279, DW_AT_TI_symbol_name("Badhlen")
	.dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$279, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/ipif.h")
	.dwattr $C$DW$279, DW_AT_decl_line(0x3b)
	.dwattr $C$DW$279, DW_AT_decl_column(0x11)
$C$DW$280	.dwtag  DW_TAG_member
	.dwattr $C$DW$280, DW_AT_type(*$C$DW$T$155)
	.dwattr $C$DW$280, DW_AT_name("Badlen")
	.dwattr $C$DW$280, DW_AT_TI_symbol_name("Badlen")
	.dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$280, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/ipif.h")
	.dwattr $C$DW$280, DW_AT_decl_line(0x3c)
	.dwattr $C$DW$280, DW_AT_decl_column(0x11)
$C$DW$281	.dwtag  DW_TAG_member
	.dwattr $C$DW$281, DW_AT_type(*$C$DW$T$155)
	.dwattr $C$DW$281, DW_AT_name("Badoptions")
	.dwattr $C$DW$281, DW_AT_TI_symbol_name("Badoptions")
	.dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$281, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/ipif.h")
	.dwattr $C$DW$281, DW_AT_decl_line(0x3d)
	.dwattr $C$DW$281, DW_AT_decl_column(0x11)
$C$DW$282	.dwtag  DW_TAG_member
	.dwattr $C$DW$282, DW_AT_type(*$C$DW$T$155)
	.dwattr $C$DW$282, DW_AT_name("Badvers")
	.dwattr $C$DW$282, DW_AT_TI_symbol_name("Badvers")
	.dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$282, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/ipif.h")
	.dwattr $C$DW$282, DW_AT_decl_line(0x3e)
	.dwattr $C$DW$282, DW_AT_decl_column(0x11)
$C$DW$283	.dwtag  DW_TAG_member
	.dwattr $C$DW$283, DW_AT_type(*$C$DW$T$155)
	.dwattr $C$DW$283, DW_AT_name("Forward")
	.dwattr $C$DW$283, DW_AT_TI_symbol_name("Forward")
	.dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$283, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/ipif.h")
	.dwattr $C$DW$283, DW_AT_decl_line(0x3f)
	.dwattr $C$DW$283, DW_AT_decl_column(0x11)
$C$DW$284	.dwtag  DW_TAG_member
	.dwattr $C$DW$284, DW_AT_type(*$C$DW$T$155)
	.dwattr $C$DW$284, DW_AT_name("Noproto")
	.dwattr $C$DW$284, DW_AT_TI_symbol_name("Noproto")
	.dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$284, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/ipif.h")
	.dwattr $C$DW$284, DW_AT_decl_line(0x40)
	.dwattr $C$DW$284, DW_AT_decl_column(0x11)
$C$DW$285	.dwtag  DW_TAG_member
	.dwattr $C$DW$285, DW_AT_type(*$C$DW$T$155)
	.dwattr $C$DW$285, DW_AT_name("Delivered")
	.dwattr $C$DW$285, DW_AT_TI_symbol_name("Delivered")
	.dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$285, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/ipif.h")
	.dwattr $C$DW$285, DW_AT_decl_line(0x41)
	.dwattr $C$DW$285, DW_AT_decl_column(0x11)
$C$DW$286	.dwtag  DW_TAG_member
	.dwattr $C$DW$286, DW_AT_type(*$C$DW$T$155)
	.dwattr $C$DW$286, DW_AT_name("Cantforward")
	.dwattr $C$DW$286, DW_AT_TI_symbol_name("Cantforward")
	.dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$286, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/ipif.h")
	.dwattr $C$DW$286, DW_AT_decl_line(0x42)
	.dwattr $C$DW$286, DW_AT_decl_column(0x11)
$C$DW$287	.dwtag  DW_TAG_member
	.dwattr $C$DW$287, DW_AT_type(*$C$DW$T$155)
	.dwattr $C$DW$287, DW_AT_name("CantforwardBA")
	.dwattr $C$DW$287, DW_AT_TI_symbol_name("CantforwardBA")
	.dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$287, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/ipif.h")
	.dwattr $C$DW$287, DW_AT_decl_line(0x43)
	.dwattr $C$DW$287, DW_AT_decl_column(0x11)
$C$DW$288	.dwtag  DW_TAG_member
	.dwattr $C$DW$288, DW_AT_type(*$C$DW$T$155)
	.dwattr $C$DW$288, DW_AT_name("Expired")
	.dwattr $C$DW$288, DW_AT_TI_symbol_name("Expired")
	.dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$288, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/ipif.h")
	.dwattr $C$DW$288, DW_AT_decl_line(0x44)
	.dwattr $C$DW$288, DW_AT_decl_column(0x11)
$C$DW$289	.dwtag  DW_TAG_member
	.dwattr $C$DW$289, DW_AT_type(*$C$DW$T$155)
	.dwattr $C$DW$289, DW_AT_name("Redirectsent")
	.dwattr $C$DW$289, DW_AT_TI_symbol_name("Redirectsent")
	.dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$289, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/ipif.h")
	.dwattr $C$DW$289, DW_AT_decl_line(0x45)
	.dwattr $C$DW$289, DW_AT_decl_column(0x11)
$C$DW$290	.dwtag  DW_TAG_member
	.dwattr $C$DW$290, DW_AT_type(*$C$DW$T$155)
	.dwattr $C$DW$290, DW_AT_name("Localout")
	.dwattr $C$DW$290, DW_AT_TI_symbol_name("Localout")
	.dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$290, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/ipif.h")
	.dwattr $C$DW$290, DW_AT_decl_line(0x46)
	.dwattr $C$DW$290, DW_AT_decl_column(0x11)
$C$DW$291	.dwtag  DW_TAG_member
	.dwattr $C$DW$291, DW_AT_type(*$C$DW$T$155)
	.dwattr $C$DW$291, DW_AT_name("Localnoroute")
	.dwattr $C$DW$291, DW_AT_TI_symbol_name("Localnoroute")
	.dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$291, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/ipif.h")
	.dwattr $C$DW$291, DW_AT_decl_line(0x47)
	.dwattr $C$DW$291, DW_AT_decl_column(0x11)
$C$DW$292	.dwtag  DW_TAG_member
	.dwattr $C$DW$292, DW_AT_type(*$C$DW$T$155)
	.dwattr $C$DW$292, DW_AT_name("Reassembled")
	.dwattr $C$DW$292, DW_AT_TI_symbol_name("Reassembled")
	.dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$292, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/ipif.h")
	.dwattr $C$DW$292, DW_AT_decl_line(0x48)
	.dwattr $C$DW$292, DW_AT_decl_column(0x11)
$C$DW$293	.dwtag  DW_TAG_member
	.dwattr $C$DW$293, DW_AT_type(*$C$DW$T$155)
	.dwattr $C$DW$293, DW_AT_name("Fragments")
	.dwattr $C$DW$293, DW_AT_TI_symbol_name("Fragments")
	.dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$293, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/ipif.h")
	.dwattr $C$DW$293, DW_AT_decl_line(0x49)
	.dwattr $C$DW$293, DW_AT_decl_column(0x11)
$C$DW$294	.dwtag  DW_TAG_member
	.dwattr $C$DW$294, DW_AT_type(*$C$DW$T$155)
	.dwattr $C$DW$294, DW_AT_name("Fragdropped")
	.dwattr $C$DW$294, DW_AT_TI_symbol_name("Fragdropped")
	.dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$294, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/ipif.h")
	.dwattr $C$DW$294, DW_AT_decl_line(0x4a)
	.dwattr $C$DW$294, DW_AT_decl_column(0x11)
$C$DW$295	.dwtag  DW_TAG_member
	.dwattr $C$DW$295, DW_AT_type(*$C$DW$T$155)
	.dwattr $C$DW$295, DW_AT_name("Fragtimeout")
	.dwattr $C$DW$295, DW_AT_TI_symbol_name("Fragtimeout")
	.dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$295, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/ipif.h")
	.dwattr $C$DW$295, DW_AT_decl_line(0x4b)
	.dwattr $C$DW$295, DW_AT_decl_column(0x11)
$C$DW$296	.dwtag  DW_TAG_member
	.dwattr $C$DW$296, DW_AT_type(*$C$DW$T$155)
	.dwattr $C$DW$296, DW_AT_name("Fragmented")
	.dwattr $C$DW$296, DW_AT_TI_symbol_name("Fragmented")
	.dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$296, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/ipif.h")
	.dwattr $C$DW$296, DW_AT_decl_line(0x4c)
	.dwattr $C$DW$296, DW_AT_decl_column(0x11)
$C$DW$297	.dwtag  DW_TAG_member
	.dwattr $C$DW$297, DW_AT_type(*$C$DW$T$155)
	.dwattr $C$DW$297, DW_AT_name("Ofragments")
	.dwattr $C$DW$297, DW_AT_TI_symbol_name("Ofragments")
	.dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
	.dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$297, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/ipif.h")
	.dwattr $C$DW$297, DW_AT_decl_line(0x4d)
	.dwattr $C$DW$297, DW_AT_decl_column(0x11)
$C$DW$298	.dwtag  DW_TAG_member
	.dwattr $C$DW$298, DW_AT_type(*$C$DW$T$155)
	.dwattr $C$DW$298, DW_AT_name("Cantfrag")
	.dwattr $C$DW$298, DW_AT_TI_symbol_name("Cantfrag")
	.dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
	.dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$298, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/ipif.h")
	.dwattr $C$DW$298, DW_AT_decl_line(0x4e)
	.dwattr $C$DW$298, DW_AT_decl_column(0x11)
$C$DW$299	.dwtag  DW_TAG_member
	.dwattr $C$DW$299, DW_AT_type(*$C$DW$T$155)
	.dwattr $C$DW$299, DW_AT_name("CacheHit")
	.dwattr $C$DW$299, DW_AT_TI_symbol_name("CacheHit")
	.dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
	.dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$299, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/ipif.h")
	.dwattr $C$DW$299, DW_AT_decl_line(0x4f)
	.dwattr $C$DW$299, DW_AT_decl_column(0x11)
$C$DW$300	.dwtag  DW_TAG_member
	.dwattr $C$DW$300, DW_AT_type(*$C$DW$T$155)
	.dwattr $C$DW$300, DW_AT_name("CacheMiss")
	.dwattr $C$DW$300, DW_AT_TI_symbol_name("CacheMiss")
	.dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
	.dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$300, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/ipif.h")
	.dwattr $C$DW$300, DW_AT_decl_line(0x50)
	.dwattr $C$DW$300, DW_AT_decl_column(0x11)
$C$DW$301	.dwtag  DW_TAG_member
	.dwattr $C$DW$301, DW_AT_type(*$C$DW$T$155)
	.dwattr $C$DW$301, DW_AT_name("Filtered")
	.dwattr $C$DW$301, DW_AT_TI_symbol_name("Filtered")
	.dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
	.dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$301, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/ipif.h")
	.dwattr $C$DW$301, DW_AT_decl_line(0x51)
	.dwattr $C$DW$301, DW_AT_decl_column(0x11)
	.dwendtag $C$DW$T$177

	.dwattr $C$DW$T$177, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/ipif.h")
	.dwattr $C$DW$T$177, DW_AT_decl_line(0x37)
	.dwattr $C$DW$T$177, DW_AT_decl_column(0x10)
$C$DW$T$823	.dwtag  DW_TAG_typedef, DW_AT_name("IPSTATS")
	.dwattr $C$DW$T$823, DW_AT_type(*$C$DW$T$177)
	.dwattr $C$DW$T$823, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$823, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/ipif.h")
	.dwattr $C$DW$T$823, DW_AT_decl_line(0x52)
	.dwattr $C$DW$T$823, DW_AT_decl_column(0x0b)

$C$DW$T$178	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$178, DW_AT_byte_size(0x28)
$C$DW$302	.dwtag  DW_TAG_member
	.dwattr $C$DW$302, DW_AT_type(*$C$DW$T$155)
	.dwattr $C$DW$302, DW_AT_name("TxExamined")
	.dwattr $C$DW$302, DW_AT_TI_symbol_name("TxExamined")
	.dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$302, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/natif.h")
	.dwattr $C$DW$302, DW_AT_decl_line(0x31)
	.dwattr $C$DW$302, DW_AT_decl_column(0x11)
$C$DW$303	.dwtag  DW_TAG_member
	.dwattr $C$DW$303, DW_AT_type(*$C$DW$T$155)
	.dwattr $C$DW$303, DW_AT_name("TxQualified")
	.dwattr $C$DW$303, DW_AT_TI_symbol_name("TxQualified")
	.dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$303, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/natif.h")
	.dwattr $C$DW$303, DW_AT_decl_line(0x32)
	.dwattr $C$DW$303, DW_AT_decl_column(0x11)
$C$DW$304	.dwtag  DW_TAG_member
	.dwattr $C$DW$304, DW_AT_type(*$C$DW$T$155)
	.dwattr $C$DW$304, DW_AT_name("TxAltered")
	.dwattr $C$DW$304, DW_AT_TI_symbol_name("TxAltered")
	.dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$304, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/natif.h")
	.dwattr $C$DW$304, DW_AT_decl_line(0x33)
	.dwattr $C$DW$304, DW_AT_decl_column(0x11)
$C$DW$305	.dwtag  DW_TAG_member
	.dwattr $C$DW$305, DW_AT_type(*$C$DW$T$155)
	.dwattr $C$DW$305, DW_AT_name("RxExamined")
	.dwattr $C$DW$305, DW_AT_TI_symbol_name("RxExamined")
	.dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$305, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/natif.h")
	.dwattr $C$DW$305, DW_AT_decl_line(0x34)
	.dwattr $C$DW$305, DW_AT_decl_column(0x11)
$C$DW$306	.dwtag  DW_TAG_member
	.dwattr $C$DW$306, DW_AT_type(*$C$DW$T$155)
	.dwattr $C$DW$306, DW_AT_name("RxQualified")
	.dwattr $C$DW$306, DW_AT_TI_symbol_name("RxQualified")
	.dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$306, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/natif.h")
	.dwattr $C$DW$306, DW_AT_decl_line(0x35)
	.dwattr $C$DW$306, DW_AT_decl_column(0x11)
$C$DW$307	.dwtag  DW_TAG_member
	.dwattr $C$DW$307, DW_AT_type(*$C$DW$T$155)
	.dwattr $C$DW$307, DW_AT_name("RxAltered")
	.dwattr $C$DW$307, DW_AT_TI_symbol_name("RxAltered")
	.dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$307, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/natif.h")
	.dwattr $C$DW$307, DW_AT_decl_line(0x36)
	.dwattr $C$DW$307, DW_AT_decl_column(0x11)
$C$DW$308	.dwtag  DW_TAG_member
	.dwattr $C$DW$308, DW_AT_type(*$C$DW$T$155)
	.dwattr $C$DW$308, DW_AT_name("Entries")
	.dwattr $C$DW$308, DW_AT_TI_symbol_name("Entries")
	.dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$308, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/natif.h")
	.dwattr $C$DW$308, DW_AT_decl_line(0x37)
	.dwattr $C$DW$308, DW_AT_decl_column(0x11)
$C$DW$309	.dwtag  DW_TAG_member
	.dwattr $C$DW$309, DW_AT_type(*$C$DW$T$155)
	.dwattr $C$DW$309, DW_AT_name("MaxEntries")
	.dwattr $C$DW$309, DW_AT_TI_symbol_name("MaxEntries")
	.dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$309, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/natif.h")
	.dwattr $C$DW$309, DW_AT_decl_line(0x38)
	.dwattr $C$DW$309, DW_AT_decl_column(0x11)
$C$DW$310	.dwtag  DW_TAG_member
	.dwattr $C$DW$310, DW_AT_type(*$C$DW$T$155)
	.dwattr $C$DW$310, DW_AT_name("LongTerm")
	.dwattr $C$DW$310, DW_AT_TI_symbol_name("LongTerm")
	.dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$310, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/natif.h")
	.dwattr $C$DW$310, DW_AT_decl_line(0x39)
	.dwattr $C$DW$310, DW_AT_decl_column(0x11)
$C$DW$311	.dwtag  DW_TAG_member
	.dwattr $C$DW$311, DW_AT_type(*$C$DW$T$155)
	.dwattr $C$DW$311, DW_AT_name("MaxLongTerm")
	.dwattr $C$DW$311, DW_AT_TI_symbol_name("MaxLongTerm")
	.dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$311, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/natif.h")
	.dwattr $C$DW$311, DW_AT_decl_line(0x3a)
	.dwattr $C$DW$311, DW_AT_decl_column(0x11)
	.dwendtag $C$DW$T$178

	.dwattr $C$DW$T$178, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/natif.h")
	.dwattr $C$DW$T$178, DW_AT_decl_line(0x30)
	.dwattr $C$DW$T$178, DW_AT_decl_column(0x10)
$C$DW$T$824	.dwtag  DW_TAG_typedef, DW_AT_name("NATSTATS")
	.dwattr $C$DW$T$824, DW_AT_type(*$C$DW$T$178)
	.dwattr $C$DW$T$824, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$824, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/natif.h")
	.dwattr $C$DW$T$824, DW_AT_decl_line(0x3b)
	.dwattr $C$DW$T$824, DW_AT_decl_column(0x07)

$C$DW$T$179	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$179, DW_AT_byte_size(0x50)
$C$DW$312	.dwtag  DW_TAG_member
	.dwattr $C$DW$312, DW_AT_type(*$C$DW$T$155)
	.dwattr $C$DW$312, DW_AT_name("InReceives")
	.dwattr $C$DW$312, DW_AT_TI_symbol_name("InReceives")
	.dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$312, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/ip6if.h")
	.dwattr $C$DW$312, DW_AT_decl_line(0xaf)
	.dwattr $C$DW$312, DW_AT_decl_column(0x0d)
$C$DW$313	.dwtag  DW_TAG_member
	.dwattr $C$DW$313, DW_AT_type(*$C$DW$T$155)
	.dwattr $C$DW$313, DW_AT_name("InHdrErrors")
	.dwattr $C$DW$313, DW_AT_TI_symbol_name("InHdrErrors")
	.dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$313, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/ip6if.h")
	.dwattr $C$DW$313, DW_AT_decl_line(0xb4)
	.dwattr $C$DW$313, DW_AT_decl_column(0x0d)
$C$DW$314	.dwtag  DW_TAG_member
	.dwattr $C$DW$314, DW_AT_type(*$C$DW$T$155)
	.dwattr $C$DW$314, DW_AT_name("InMcastPkts")
	.dwattr $C$DW$314, DW_AT_TI_symbol_name("InMcastPkts")
	.dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$314, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/ip6if.h")
	.dwattr $C$DW$314, DW_AT_decl_line(0xb9)
	.dwattr $C$DW$314, DW_AT_decl_column(0x0d)
$C$DW$315	.dwtag  DW_TAG_member
	.dwattr $C$DW$315, DW_AT_type(*$C$DW$T$155)
	.dwattr $C$DW$315, DW_AT_name("InTruncatedPkts")
	.dwattr $C$DW$315, DW_AT_TI_symbol_name("InTruncatedPkts")
	.dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$315, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/ip6if.h")
	.dwattr $C$DW$315, DW_AT_decl_line(0xbe)
	.dwattr $C$DW$315, DW_AT_decl_column(0x0d)
$C$DW$316	.dwtag  DW_TAG_member
	.dwattr $C$DW$316, DW_AT_type(*$C$DW$T$155)
	.dwattr $C$DW$316, DW_AT_name("InForwErrors")
	.dwattr $C$DW$316, DW_AT_TI_symbol_name("InForwErrors")
	.dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$316, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/ip6if.h")
	.dwattr $C$DW$316, DW_AT_decl_line(0xc3)
	.dwattr $C$DW$316, DW_AT_decl_column(0x0d)
$C$DW$317	.dwtag  DW_TAG_member
	.dwattr $C$DW$317, DW_AT_type(*$C$DW$T$155)
	.dwattr $C$DW$317, DW_AT_name("InExtnHdrErrors")
	.dwattr $C$DW$317, DW_AT_TI_symbol_name("InExtnHdrErrors")
	.dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$317, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/ip6if.h")
	.dwattr $C$DW$317, DW_AT_decl_line(0xc8)
	.dwattr $C$DW$317, DW_AT_decl_column(0x0d)
$C$DW$318	.dwtag  DW_TAG_member
	.dwattr $C$DW$318, DW_AT_type(*$C$DW$T$155)
	.dwattr $C$DW$318, DW_AT_name("InReasmReqds")
	.dwattr $C$DW$318, DW_AT_TI_symbol_name("InReasmReqds")
	.dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$318, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/ip6if.h")
	.dwattr $C$DW$318, DW_AT_decl_line(0xcd)
	.dwattr $C$DW$318, DW_AT_decl_column(0x0d)
$C$DW$319	.dwtag  DW_TAG_member
	.dwattr $C$DW$319, DW_AT_type(*$C$DW$T$155)
	.dwattr $C$DW$319, DW_AT_name("InReasmFails")
	.dwattr $C$DW$319, DW_AT_TI_symbol_name("InReasmFails")
	.dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$319, DW_AT_decl_file("C:\ti\ndk_2_24_00_05_eng\packages\ti\ndk\inc\stack\inc/ip6if.h")
	.dwattr $C$DW$319, DW_AT_decl_line(0xd2)
	.dwattr $C$DW$319, DW_AT_decl_column(0x0d)
$C$DW$320	.dwtag  DW_TAG_member
	.dwattr $C$DW$320, DW_AT_type(*$C$DW$T$155)
	.dwattr $C$DW$320, DW_AT_name("InReasmOKs")
	.dwattr $C$DW$320, DW_AT_TI_symbol_name("InReasmOKs")
	.dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
